MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/*!
 * @file        apm32f445.h
 *
 * @brief       CMSIS Cortex-M4 Device Peripheral Access Layer Header File.
 *
 * @details     This file contains all the peripheral register's definitions, bits definitions and memory mapping
 *
 * @version     V1.0.0
 *
 * @date        2026-01-31
 *
 * @attention
 *
 *  Copyright (C) 2026 Geehy Semiconductor
 *
 *  You may not use this file except in compliance with the
 *  GEEHY COPYRIGHT NOTICE (GEEHY SOFTWARE PACKAGE LICENSE).
 *
 *  The program is only for reference, which is distributed in the hope
 *  that it will be useful and instructional for customers to develop
 *  their software. Unless required by applicable law or agreed to in
 *  writing, the program is distributed on an "AS IS" BASIS, WITHOUT
 *  ANY WARRANTY OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the GEEHY SOFTWARE PACKAGE LICENSE for the governing permissions
 *  and limitations under the License.
 */


/** @addtogroup APM32F445_446
  * @{
  */


#ifndef APM32F445_446_H
#define APM32F445_446_H

#ifdef __cplusplus
extern "C" {
#endif


/** @addtogroup Enum_IRQn_Type
  * @{
  */

/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */
typedef enum {
  NotAvail_IRQn             = -128,             /* Not available device specific interrupt */
/* =======================================  ARM Cortex-M4 Specific Interrupt Numbers  ====================================== */
  Reset_IRQn                = -15,              /* -15  Reset Vector, invoked on Power up and warm reset                     */
  NonMaskableInt_IRQn       = -14,              /* -14  Non maskable Interrupt, cannot be stopped or preempted               */
  HardFault_IRQn            = -13,              /* -13  Hard Fault, all classes of Fault                                     */
  MemoryManagement_IRQn     = -12,              /* -12  Memory Management, MPU mismatch, including Access Violation
                                                     and No Match                                                            */
  BusFault_IRQn             = -11,              /* -11  Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory
                                                     related Fault                                                           */
  UsageFault_IRQn           = -10,              /* -10  Usage Fault, i.e. Undef Instruction, Illegal State Transition        */
  SVCall_IRQn               =  -5,              /* -5 System Service Call via SVC instruction                                */
  DebugMonitor_IRQn         =  -4,              /* -4 Debug Monitor                                                          */
  PendSV_IRQn               =  -2,              /* -2 Pendable request for system service                                    */
  SysTick_IRQn              =  -1,              /* -1 System Tick Timer                                                      */
/* =========================================  APM32F445 Specific Interrupt Numbers  =========================================== */
  DMA0_IRQn                 =   0U,              /* 0  DMA0                                                                   */
  DMA1_IRQn                 =   1U,              /* 1  DMA1                                                                   */
  DMA2_IRQn                 =   2U,              /* 2  DMA2                                                                   */
  DMA3_IRQn                 =   3U,              /* 3  DMA3                                                                   */
  DMA4_IRQn                 =   4U,              /* 4  DMA4                                                                   */
  DMA5_IRQn                 =   5U,              /* 5  DMA5                                                                   */
  DMA6_IRQn                 =   6U,              /* 6  DMA6                                                                   */
  DMA7_IRQn                 =   7U,              /* 7  DMA7                                                                   */
  DMA8_IRQn                 =   8U,              /* 8  DMA8                                                                   */
  DMA9_IRQn                 =   9U,              /* 9  DMA9                                                                   */
  DMA10_IRQn                =  10U,              /* 10 DMA10                                                                  */
  DMA11_IRQn                =  11U,              /* 11 DMA11                                                                  */
  DMA12_IRQn                =  12U,              /* 12 DMA12                                                                  */
  DMA13_IRQn                =  13U,              /* 13 DMA13                                                                  */
  DMA14_IRQn                =  14U,              /* 14 DMA14                                                                  */
  DMA15_IRQn                =  15U,              /* 15 DMA15                                                                  */
  DMA_Error_IRQn            =  16U,              /* 16 DMA_Error                                                              */
  MC_IRQn                   =  17U,              /* 17 MC                                                                     */
  FLASH_IRQn                =  18U,              /* 18 FLASH                                                                  */
  Read_Collision_IRQn       =  19U,              /* 19 Read_Collision                                                         */
  LVD_LVW_IRQn              =  20U,              /* 20 LVD_LVW                                                                */
  FLASH_Fault_IRQn          =  21U,              /* 21 FLASH_Fault                                                            */
  WDT_EWDT_IRQn             =  22U,              /* 22 WDT_EWDT                                                               */
  RMU_IRQn                  =  23U,              /* 23 RMU                                                                    */
  LPI2C_Master_IRQn         =  24U,              /* 24 LPI2C_Master                                                           */
  LPI2C_Slave_IRQn          =  25U,              /* 25 LPI2C_Slave                                                            */
  LPSPI0_IRQn               =  26U,              /* 26 LPSPI0                                                                 */
  LPSPI1_IRQn               =  27U,              /* 27 LPSPI1                                                                 */
  LPSPI2_IRQn               =  28U,              /* 28 LPSPI2                                                                 */
  LPUART0_RxTx_IRQn         =  31U,              /* 31 LPUART0_RxTx                                                           */
  LPUART1_RxTx_IRQn         =  33U,              /* 33 LPUART1_RxTx                                                           */
  LPUART2_RxTx_IRQn         =  35U,              /* 35 LPUART2_RxTx                                                           */
  ADC0_IRQn                 =  39U,              /* 39 ADC0                                                                   */
  ADC1_IRQn                 =  40U,              /* 40 ADC1                                                                   */
  COMP_IRQn                 =  41U,              /* 41 COMP                                                                   */
  EREP_single_fault_IRQn    =  44U,              /* 44 EREP_single_fault                                                      */
  EREP_double_fault_IRQn    =  45U,              /* 45 EREP_double_fault                                                      */
  RTC_IRQn                  =  46U,              /* 46 RTC                                                                    */
  RTC_Seconds_IRQn          =  47U,              /* 47 RTC_Seconds                                                            */
  LPITMR_Ch0_IRQn           =  48U,              /* 48 LPITMR_Ch0                                                             */
  LPITMR_Ch1_IRQn           =  49U,              /* 49 LPITMR_Ch1                                                             */
  LPITMR_Ch2_IRQn           =  50U,              /* 50 LPITMR_Ch2                                                             */
  LPITMR_Ch3_IRQn           =  51U,              /* 51 LPITMR_Ch3                                                             */
  PDU0_IRQn                 =  52U,              /* 52 PDU0                                                                   */
  SCG_IRQn                  =  57U,              /* 57 SCG                                                                    */
  LPTMR_IRQn                =  58U,              /* 58 LPTMR                                                                  */
  PMA_IRQn                  =  59U,              /* 59 PMA                                                                    */
  PMB_IRQn                  =  60U,              /* 60 PMB                                                                    */
  PMC_IRQn                  =  61U,              /* 61 PMC                                                                    */
  PMD_IRQn                  =  62U,              /* 62 PMD                                                                    */
  PME_IRQn                  =  63U,              /* 63 PME                                                                    */
  SWI_IRQn                  =  64U,              /* 64 SWI                                                                    */
  PDU1_IRQn                 =  68U,              /* 68 PDU1                                                                   */
  CFGIO_IRQn                =  69U,         /* 69 CFGIO                                                                 */
  CAN0_ORed_IRQn            =  78U,         /* 78 CAN0_ORed                                                           */
  CAN0_Error_IRQn           =  79U,         /* 79 CAN0_Error                                                          */
  CAN0_Wake_Up_IRQn         =  80U,         /* 80 CAN0_Wake_Up                                                        */
  CAN0_ORed_0_15_MB_IRQn    =  81U,         /* 81 CAN0_ORed_0_15_MB                                                   */
  CAN0_ORed_16_31_MB_IRQn   =  82U,         /* 82 CAN0_ORed_16_31_MB                                                  */
  CAN1_ORed_IRQn            =  85U,         /* 85 CAN1_ORed                                                           */
  CAN1_Error_IRQn           =  86U,         /* 86 CAN1_Error                                                          */
  CAN1_ORed_0_15_MB_IRQn    =  88U,         /* 88 CAN1_ORed_0_15_MB                                                   */
  CAN2_ORed_IRQn            =  92U,         /* 92 CAN2_ORed                                                           */
  CAN2_Error_IRQn           =  93U,         /* 93 CAN2_Error                                                          */
  CAN2_ORed_0_15_MB_IRQn    =  95U,         /* 95 CAN2_ORed_0_15_MB                                                   */
  CFGTMR0_Ch0_Ch1_IRQn        =  99U,             /* 99 CFGTMR0_Ch0_Ch1                                                           */
  CFGTMR0_Ch2_Ch3_IRQn        = 100U,             /* 100  CFGTMR0_Ch2_Ch3                                                         */
  CFGTMR0_Ch4_Ch5_IRQn        = 101U,             /* 101  CFGTMR0_Ch4_Ch5                                                         */
  CFGTMR0_Ch6_Ch7_IRQn        = 102U,             /* 102  CFGTMR0_Ch6_Ch7                                                         */
  CFGTMR0_Fault_IRQn          = 103U,             /* 103  CFGTMR0_Fault                                                           */
  CFGTMR0_Ovf_Reload_IRQn     = 104U,             /* 104  CFGTMR0_Ovf_Reload                                                      */
  CFGTMR1_Ch0_Ch1_IRQn        = 105U,             /* 105  CFGTMR1_Ch0_Ch1                                                         */
  CFGTMR1_Ch2_Ch3_IRQn        = 106U,             /* 106  CFGTMR1_Ch2_Ch3                                                         */
  CFGTMR1_Ch4_Ch5_IRQn        = 107U,             /* 107  CFGTMR1_Ch4_Ch5                                                         */
  CFGTMR1_Ch6_Ch7_IRQn        = 108U,             /* 108  CFGTMR1_Ch6_Ch7                                                         */
  CFGTMR1_Fault_IRQn          = 109U,             /* 109  CFGTMR1_Fault                                                           */
  CFGTMR1_Ovf_Reload_IRQn     = 110U,             /* 110  CFGTMR1_Ovf_Reload                                                      */
  CFGTMR2_Ch0_Ch1_IRQn        = 111U,             /* 111  CFGTMR2_Ch0_Ch1                                                         */
  CFGTMR2_Ch2_Ch3_IRQn        = 112U,             /* 112  CFGTMR2_Ch2_Ch3                                                         */
  CFGTMR2_Ch4_Ch5_IRQn        = 113U,             /* 113  CFGTMR2_Ch4_Ch5                                                         */
  CFGTMR2_Ch6_Ch7_IRQn        = 114U,             /* 114  CFGTMR2_Ch6_Ch7                                                         */
  CFGTMR2_Fault_IRQn          = 115U,             /* 115  CFGTMR2_Fault                                                           */
  CFGTMR2_Ovf_Reload_IRQn     = 116U,             /* 116  CFGTMR2_Ovf_Reload                                                      */
  CFGTMR3_Ch0_Ch1_IRQn        = 117U,             /* 117  CFGTMR3_Ch0_Ch1                                                         */
  CFGTMR3_Ch2_Ch3_IRQn        = 118U,             /* 118  CFGTMR3_Ch2_Ch3                                                         */
  CFGTMR3_Ch4_Ch5_IRQn        = 119U,             /* 119  CFGTMR3_Ch4_Ch5                                                         */
  CFGTMR3_Ch6_Ch7_IRQn        = 120U,             /* 120  CFGTMR3_Ch6_Ch7                                                         */
  CFGTMR3_Fault_IRQn          = 121U,             /* 121  CFGTMR3_Fault                                                           */
  CFGTMR3_Ovf_Reload_IRQn     = 122U              /* 122  CFGTMR3_Ovf_Reload                                                      */
} IRQn_Type;

/** @} */ /* End of group Enum_IRQn_Type */

/** @addtogroup Configuration_of_CMSIS
  * @{
  */
/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

/* ==========================  Configuration of the ARM Cortex-M4 Processor and Core Peripherals  =========================== */
#define __CM4_REV                      1U        /* CM4 Core Revision                                                         */
#define __NVIC_PRIO_BITS               4U        /* Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig         0U        /* Set to 1 if different SysTick Config is used                              */
#define __MPU_PRESENT                  0U        /* MPU present                                                               */
#define __FPU_PRESENT                  1U        /* FPU present                                                               */

/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm4.h"                           /* ARM Cortex-M4 processor and core peripherals                               */
// Note: Changed for MikroE implementation.
//#include "apm_core_cm4.h"
// Note: Changed for MikroE implementation.
//#include "system_apm32f445_446.h"                     /* APM32F445 System                                                            */
#define __I volatile // Note: Added for MikroE implementation.
#define __O __I // Note: Added for MikroE implementation.
#define __IO __I // Note: Added for MikroE implementation.

