MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/** @addtogroup Exported_Types
  * @{
  */

#ifndef __IM
#define __IM   __I
#endif
#ifndef __OM
#define __OM   __O
#endif
#ifndef __IOM
#define __IOM  __IO
#endif
/** @} */ /* End of group Exported_Types */

/* ========================================  Start of section using anonymous unions  ======================================== */
#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif

/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */
/** @addtogroup Device_Peripheral_peripherals
  * @{
  */
/* =========================================================================================================================== */
/* ================                                         CSE_PRAM                                          ================ */
/* =========================================================================================================================== */

/**
  * @brief CSE_PRAM (CSE_PRAM)
  */

/** CSE_PRAM - Size of Registers Arrays */
#define CSE_PRAM_RAMn_COUNT                      32U

/** CSE_PRAM - Register Layout Typedef */
typedef struct {
  union {                                  /* offset: 0x0, array step: 0x4                                                      */
    __IO uint32_t DATA_32;                 /* CSE PRAM 0 Register..CSE PRAM 31 Register, array offset: 0x0, array step: 0x4     */
    struct {                               /* offset: 0x0, array step: 0x4                                                      */
      __IO uint8_t DATA_8LL;               /* CSE PRAM0LL register...CSE PRAM31LL register., array offset: 0x0, array step: 0x4 */
      __IO uint8_t DATA_8LU;               /* CSE PRAM0LU register...CSE PRAM31LU register., array offset: 0x1, array step: 0x4 */
      __IO uint8_t DATA_8HL;               /* CSE PRAM0HL register...CSE PRAM31HL register., array offset: 0x2, array step: 0x4 */
      __IO uint8_t DATA_8HU;               /* CSE PRAM0HU register...CSE PRAM31HU register., array offset: 0x3, array step: 0x4 */
    } ACCESS8BIT;
  } RAMn[CSE_PRAM_RAMn_COUNT];
} CSE_PRAM_T;


/* =========================================================================================================================== */
/* ================                                            AC                                             ================ */
/* =========================================================================================================================== */


/**
  * @brief Access Controller (AC)
  */

typedef struct {                                /* (@ 0x40000000) AC Structure                                               */

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000000) Master Privilege Register A                                */

    struct {
      __IM  uint32_t RESERVED0  : 16;
      __IOM uint32_t MPLCFG3    : 1;            /* [16..16] Master 3 Privilege Level Configure                               */
      __IOM uint32_t MTWA3      : 1;            /* [17..17] Master 3 Trusted For Writes                                      */
      __IOM uint32_t MTRA3      : 1;            /* [18..18] Master 3 Trusted For Read                                        */
      __IM  uint32_t RESERVED1  : 1;
      __IOM uint32_t MPLCFG2    : 1;            /* [20..20] Master 2 Privilege Level Configure                               */
      __IOM uint32_t MTWA2      : 1;            /* [21..21] Master 2 Trusted For Writes                                      */
      __IOM uint32_t MTRA2      : 1;            /* [22..22] Master 2 Trusted For Read                                        */
      __IM  uint32_t RESERVED2  : 1;
      __IOM uint32_t MPLCFG1    : 1;            /* [24..24] Master 1 Privilege Level Configure                               */
      __IOM uint32_t MTWA1      : 1;            /* [25..25] Master 1 Trusted for Writes                                      */
      __IOM uint32_t MTRA1      : 1;            /* [26..26] Master 1 Trusted for Read                                        */
      __IM  uint32_t RESERVED3  : 1;
      __IOM uint32_t MPLCFG0    : 1;            /* [28..28] Master 0 Privilege Level Configure                               */
      __IOM uint32_t MTWA0      : 1;            /* [29..29] Master 0 Trusted For Writes                                      */
      __IOM uint32_t MTRA0      : 1;            /* [30..30] Master 0 Trusted For Read                                        */
      __IM  uint32_t RESERVED4  : 1;
    } bit;
  } MPRIA;
  __IM  uint32_t  RESERVED[7];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000020) Peripheral Access Control Register A                       */

    struct {
      __IM  uint32_t RESERVED0  : 24;
      __IOM uint32_t TPCFG1     : 1;            /* [24..24] Trusted Protect Configure                                        */
      __IOM uint32_t WPCFG1     : 1;            /* [25..25] Write Protect Configure                                          */
      __IOM uint32_t SPCFG1     : 1;            /* [26..26] Supervisor Protect Configure                                     */
      __IM  uint32_t RESERVED1  : 1;
      __IOM uint32_t TPCFG0     : 1;            /* [28..28] Trusted Protect Configure                                        */
      __IOM uint32_t WPCFG0     : 1;            /* [29..29] Write Protect Configure                                          */
      __IOM uint32_t SPCFG0     : 1;            /* [30..30] Supervisor Protect Configure                                     */
      __IM  uint32_t RESERVED2  : 1;
    } bit;
  } PACCTRLA;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000024) Peripheral Access Control Register B                       */

