MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
      __IM  uint32_t RESERVED0  : 4;
      __IOM uint32_t OCMCTRLF1  : 2;            /* [5..4] On-Chip Memory Control Field 1                                     */
      __IM  uint32_t RESERVED1  : 6;
      __IM  uint32_t OCMMPU     : 1;            /* [12..12] On-Chip Memory Memory Protect Unit                               */
      __IM  uint32_t OCMTYPE    : 3;            /* [15..13] On-Chip Memory Type                                              */
      __IOM uint32_t RONLY      : 1;            /* [16..16] Read-Only                                                        */
      __IM  uint32_t OCMDPWID   : 3;            /* [19..17] On-Chip Memory Datapath Width                                    */
      __IM  uint32_t RESERVED2  : 4;
      __IM  uint32_t OCMSIZE    : 4;            /* [27..24] On-Chip Memory Size                                              */
      __IM  uint32_t IFOCM      : 1;            /* [28..28] Incompletely Filled On-Chip Memory                               */
      __IM  uint32_t RESERVED3  : 2;
      __IM  uint32_t OCMVLDFLG  : 1;            /* [31..31] On-Chip Memory Valid Flag                                        */
    } bit;
  } OCMD0;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000404) On-Chip Memory Descriptor Register 1                       */

    struct {
      __IM  uint32_t RESERVED0  : 4;
      __IOM uint32_t OCMCTRLF1  : 2;            /* [5..4] On-Chip Memory Control Field 1                                     */
      __IM  uint32_t RESERVED1  : 6;
      __IM  uint32_t OCMMPU     : 1;            /* [12..12] On-Chip Memory Memory Protect Unit                               */
      __IM  uint32_t OCMTYPE    : 3;            /* [15..13] On-Chip Memory Type                                              */
      __IOM uint32_t RONLY      : 1;            /* [16..16] Read-Only                                                        */
      __IM  uint32_t OCMDPWID   : 3;            /* [19..17] On-Chip Memory Datapath Width                                    */
      __IM  uint32_t RESERVED2  : 4;
      __IM  uint32_t OCMSIZE    : 4;            /* [27..24] On-Chip Memory Size                                              */
      __IM  uint32_t IFOCM      : 1;            /* [28..28] Incompletely Filled On-Chip Memory                               */
      __IM  uint32_t RESERVED3  : 2;
      __IM  uint32_t OCMVLDFLG  : 1;            /* [31..31] On-Chip Memory Valid Flag                                        */
    } bit;
  } OCMD1;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000408) On-Chip Memory Descriptor Register2                        */

    struct {
      __IM  uint32_t RESERVED0  : 12;
      __IM  uint32_t OCMMPU     : 1;            /* [12..12] On-Chip Memory Memory Protect Unit                               */
      __IM  uint32_t OCMTYPE    : 3;            /* [15..13] On-Chip Memory Type                                              */
      __IOM uint32_t RONLY      : 1;            /* [16..16] Read-Only                                                        */
      __IM  uint32_t OCMDPWID   : 3;            /* [19..17] On-Chip Memory Datapath Width                                    */
      __IM  uint32_t RESERVED1  : 4;
      __IM  uint32_t OCMSIZE    : 4;            /* [27..24] On-Chip Memory Size                                              */
      __IM  uint32_t IFOCM      : 1;            /* [28..28] Incompletely Filled On-Chip Memory                               */
      __IM  uint32_t RESERVED2  : 2;
      __IM  uint32_t OCMVLDFLG  : 1;            /* [31..31] On-Chip Memory Valid Flag                                        */
    } bit;
  } OCMD2;
} MSC_T;                                     /* Size = 1036 (0x40c)                                                         */



/* =========================================================================================================================== */
/* ================                                            DMA                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Direct Memory Access (DMA)
  */

typedef struct {                                /* (@ 0x40008000) DMA Structure                                              */

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000000) Control Register                                           */

    struct {
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t DBGEN      : 1;            /* [1..1] Debug Enable                                                       */
      __IOM uint32_t CHASEL     : 1;            /* [2..2] Channel Arbitration Mode Select                                    */
      __IM  uint32_t RESERVED1  : 1;
      __IOM uint32_t HALTEFLG   : 1;            /* [4..4] HALT Error Flag                                                    */
      __IOM uint32_t HALT       : 1;            /* [5..5] DMA Operations Halt                                                */
      __IOM uint32_t CLMEN      : 1;            /* [6..6] Continuous Link Mode Enable                                        */
      __IOM uint32_t MINLMEN    : 1;            /* [7..7] Minor Loop Mapping Enable                                          */
      __IM  uint32_t RESERVED2  : 8;
      __IOM uint32_t TXCNLERR   : 1;            /* [16..16] Data Transfer Cancel Error                                       */
      __IOM uint32_t TXCNL      : 1;            /* [17..17] Data Transfer Cancel                                             */
      __IM  uint32_t RESERVED3  : 13;
      __IM  uint32_t ACTFLG     : 1;            /* [31..31] DMA Active Flag                                                  */
    } bit;
  } CTRL;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000004) Error Status Register                                      */

