MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
      struct {
        __IOM uint32_t DADDRAVSGA : 32;           /* [31..0] Destination Address Adjustment Value or SG next TCD
                                                       Address                                                                 */
      } bit;
    } DADDRAVSGA;

    union {
      __IOM uint16_t reg;                         /* (@ 0x0000101C) TCD Control and Status Register                            */

      struct {
        __IOM uint16_t START      : 1;            /* [0..0] Channel Start                                                      */
        __IOM uint16_t MAJICMPIEN : 1;            /* [1..1] Major Iteration Count Complete Interrupt Enable                    */
        __IOM uint16_t MAJIHCMPIEN : 1;           /* [2..2] Major Iteration Counter Half Complete Interrupt Enable             */
        __IOM uint16_t DMAREQD    : 1;            /* [3..3] DMA Request Disable                                                */
        __IOM uint16_t SGFEN      : 1;            /* [4..4] Scatter Gather Format Enable                                       */
        __IOM uint16_t MAJILINKEN : 1;            /* [5..5] Major Iteration Channel-to-channel Linking Enable                  */
        __IOM uint16_t ACTFLG     : 1;            /* [6..6] Channel Active Flag Flag Flag                                      */
        __IOM uint16_t MAJLCMPFLG : 1;            /* [7..7] Major Loop Complete Flag                                           */
        __IOM uint16_t MAJLINKCH  : 4;            /* [11..8] Major Loop Link Channel Number                                    */
              uint16_t            : 2;
        __IOM uint16_t BWCTRL     : 2;            /* [15..14] DMA Bandwidth Control                                            */
      } bit;
    } CSTS;

    union {
      union {
        __IOM uint16_t reg;                       /* (@ 0x0000101E) TCD Major Iteration Count Start(Channel Linking
                                                                      Disabled) Register                                       */

        struct {
          __IOM uint16_t MAJICSTAT : 15;          /* [14..0] Major Iteration Count Start                                       */
          __IOM uint16_t LINKEN    : 1;           /* [15..15] Channel-to-channel Linking Enable                                */
        } bit;
      } LINKD;

      union {
        __IOM uint16_t reg;                       /* (@ 0x0000101E) TCD Major Iteration Count Start (Channel Linking
                                                                      Enabled) Register                                        */

        struct {
          __IOM uint16_t MAJICSTAT : 9;           /* [8..0] Major Iteration Count Start                                        */
          __IOM uint16_t MINLINKCH : 4;           /* [12..9] Minor Loop Link Channel Number                                    */
                uint16_t           : 2;
          __IOM uint16_t LINKEN    : 1;           /* [15..15] Channel-to-channel Linking Enable                                */
        } bit;
      } LINKEN;
    } MAJICNTSTAT;
  } TCD[16u];
} DMA_T;                                     /* Size = 4608 (0x1200)                                                           */



/* =========================================================================================================================== */
/* ================                                            MPU                                            ================ */
/* =========================================================================================================================== */

/** MPU - Size of Registers Arrays */
#define MPU_EADDR_EDETAIL_COUNT                   4U
#define MPU_REGD_COUNT                            8U
#define MPU_RDAACC_COUNT                          8U

/**
  * @brief Memory protection (MPU)
  */

typedef struct {                                /* (@ 0x4000D000) MPU Structure                                              */

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000000) Control/Error Status Register                              */

    struct {
      __IOM uint32_t MPUEN      : 1;            /* [0..0] MPU Global Enable                                                  */
      __IM  uint32_t RESERVED0  : 7;
      __IM  uint32_t RDINUM     : 4;            /* [11..8] Region Descriptors Number                                         */
      __IM  uint32_t SPCNUM     : 4;            /* [15..12] Slave Ports Connected Number                                     */
      __IM  uint32_t HWDRL      : 4;            /* [19..16] Hardware and Definition Revision Level                           */
      __IM  uint32_t RESERVED1  : 8;
      __IOM uint32_t SPEFLG3    : 1;            /* [28..28] Slave Port 3 Error Occurred Flag                                 */
      __IOM uint32_t SPEFLG2    : 1;            /* [29..29] Slave Port 2 Error Occurred Flag                                 */
      __IOM uint32_t SPEFLG1    : 1;            /* [30..30] Slave Port 2 Error Occurred Flag                                 */
      __IOM uint32_t SPEFLG0    : 1;            /* [31..31] Slave Port 2 Error Occurred Flag                                 */
    } bit;
  } CESTS;
  __IM  uint32_t  RESERVED[3];

  struct {
    union {
      __IM  uint32_t reg;                         /* (@ 0x00000010) Error Address Register, slave port 0                     */

      struct {
        __IM  uint32_t SACCEADDR  : 32;           /* [31..0] Error Address                                                   */
      } bit;
    } EADDR;

    union {
      __IM  uint32_t reg;                         /* (@ 0x00000014) Error Detail Register, slave port 0                      */

      struct {
        __IM  uint32_t RWE        : 1;            /* [0..0] Read/Write Error                                                   */
        __IM  uint32_t AINFOE     : 3;            /* [3..1] Attribute Information of Error                                     */
        __IM  uint32_t MNUME      : 4;            /* [7..4] Master Number of Error                                             */
        __IM  uint32_t PIDE       : 8;            /* [15..8] Process Identification of Error                                   */
        __IM  uint32_t RDACCE     : 16;           /* [31..16] Region Descriptor with the Access Error                          */
      } bit;
    } EDETAIL;
  } EADDR_EDETAIL[MPU_EADDR_EDETAIL_COUNT];
  __IM  uint32_t  RESERVED1[244];

