MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
  struct {
    union {
      __IOM uint32_t reg;                         /* (@ 0x00000400) Region Descriptor n, Word Register 0                                */

      struct {
        __IM  uint32_t RESERVED0  : 5;
        __IOM uint32_t SADDR      : 27;           /* [31..5] Start Address of the Memory Region                                */
      } bit;
    } WORD0;

    union {
      __IOM uint32_t reg;                         /* (@ 0x00000404) Region Descriptor n, Word Register 1                                */

      struct {
        __IM  uint32_t RESERVED0  : 5;
        __IOM uint32_t ENDADDR    : 27;           /* [31..5] End Address of the Memory Region                                  */
      } bit;
    } WORD1;

    union {
      __IOM uint32_t reg;                         /* (@ 0x00000408) Region Descriptor n, Word Register 2                                */

      struct {
        __IOM uint32_t UMCTRLM0   : 3;            /* [2..0] Bus Master 0 User Mode Access Control                              */
        __IOM uint32_t SMCTRLM0   : 2;            /* [4..3] Bus Master 0 Supervisor Mode Access Control                        */
        __IOM uint32_t PIDENM0    : 1;            /* [5..5] Bus Master 0 Process Identifier enable                             */
        __IOM uint32_t UMCTRLM1   : 3;            /* [8..6] Bus Master 1 User Mode Access Control                              */
        __IOM uint32_t SMCTRLM1   : 2;            /* [10..9] Bus Master 1 Supervisor Mode Access Control                       */
        __IOM uint32_t PIDENM1    : 1;            /* [11..11] Bus Master 1 Process Identifier enable                           */
        __IOM uint32_t UMCTRLM2   : 3;            /* [14..12] Bus Master 2 User Mode Access control                            */
        __IOM uint32_t SMCTRLM2   : 2;            /* [16..15] Bus Master 2 Supervisor Mode Access Control                      */
        __IM  uint32_t RESERVED0  : 1;
        __IOM uint32_t UMCTRLM3   : 3;            /* [20..18] Bus Master 3 User Mode Access Control                            */
        __IOM uint32_t SMCTRLM3   : 2;            /* [22..21] Bus Master 3 Supervisor Mode Access Control                      */
        __IM  uint32_t RESERVED1  : 1;
        __IOM uint32_t WENM4      : 1;            /* [24..24] Bus Master 4 Write Enable                                        */
        __IOM uint32_t RENM4      : 1;            /* [25..25] Bus Master 4 Read Enable                                         */
        __IOM uint32_t WENM5      : 1;            /* [26..26] Bus Master 5 Write Enable                                        */
        __IOM uint32_t RENM5      : 1;            /* [27..27] Bus Master 5 Read Enable                                         */
        __IOM uint32_t WENM6      : 1;            /* [28..28] Bus Master 6 Write Enable                                        */
        __IOM uint32_t RENM6      : 1;            /* [29..29] Bus Master 6 Read Enable                                         */
        __IOM uint32_t WENM7      : 1;            /* [30..30] Bus Master 7 Write Enable                                        */
        __IOM uint32_t RENM7      : 1;            /* [31..31] Bus Master 7 Read Enable                                         */
      } bit;
    } WORD2;

    union {
      __IOM uint32_t reg;                         /* (@ 0x0000040C) Region Descriptor n, Word Register 3                                */

      struct {
        __IOM uint32_t RDVALID    : 1;            /* [0..0] Region Descriptor Valid                                            */
        __IM  uint32_t RESERVED0  : 15;
        __IOM uint32_t PIDMASK    : 8;            /* [23..16] Process Identifier Mask                                          */
        __IOM uint32_t PID        : 8;            /* [31..24] Process Identifier                                               */
      } bit;
    } WORD3;
  } REGD[MPU_REGD_COUNT];
  __IM  uint32_t  RESERVED2[224];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000800) Region Descriptor Alternate Access Control 0               */

    struct {
      __IOM uint32_t UMCTRLM0   : 3;            /* [2..0] Bus Master 0 User Mode Access Control                              */
      __IOM uint32_t SMCTRLM0   : 2;            /* [4..3] Bus Master 0 Supervisor Mode Access Control                        */
      __IOM uint32_t PIDENM0    : 1;            /* [5..5] Bus Master 0 Process Identifier Enable                             */
      __IOM uint32_t UMCTRLM1   : 3;            /* [8..6] Bus Master 1 User Mode Access Control                              */
      __IOM uint32_t SMCTRLM1   : 2;            /* [10..9] Bus Master 1 Supervisor Mode Access Control                       */
      __IOM uint32_t PIDENM1    : 1;            /* [11..11] Bus Master 1 Process Identifier Enable                           */
      __IOM uint32_t UMCTRLM2   : 3;            /* [14..12] Bus Master 2 User Mode Access Control                            */
      __IOM uint32_t SMCTRLM2   : 2;            /* [16..15] Bus Master 2 Supervisor Mode Access Control                      */
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t UMCTRLM3   : 3;            /* [20..18] Bus Master 3 User Mode Access Control                            */
      __IOM uint32_t SMCTRLM3   : 2;            /* [22..21] Bus Master 3 Supervisor Mode Access Control                      */
      __IM  uint32_t RESERVED1  : 1;
      __IOM uint32_t WENM4      : 1;            /* [24..24] Bus Master 4 Write Enable                                        */
      __IOM uint32_t RENM4      : 1;            /* [25..25] Bus Master 4 Read Enable                                         */
      __IOM uint32_t WENM5      : 1;            /* [26..26] Bus Master 5 Write Enable                                        */
      __IOM uint32_t RENM5      : 1;            /* [27..27] Bus Master 5 Read Enable                                         */
      __IOM uint32_t WENM6      : 1;            /* [28..28] Bus Master 6 Write Enable                                        */
      __IOM uint32_t RENM6      : 1;            /* [29..29] Bus Master 6 Read Enable                                         */
      __IOM uint32_t WENM7      : 1;            /* [30..30] Bus Master 7 Write Enable                                        */
      __IOM uint32_t RENM7      : 1;            /* [31..31] Bus Master 7 Read Enable                                         */
    } bit;
  } RDAACC[MPU_RDAACC_COUNT];
} MPU_T;                                     /* Size = 2080 (0x820)                                                       */



/* =========================================================================================================================== */
/* ================                                           EREP                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Error Reporting (EREP)
  */

typedef struct {                                /* (@ 0x40018000) EREP Structure                                             */

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000000) Configure Register 0                                       */

