MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
      __IM  uint8_t EDFLG       : 1;            /* [0..0] Error Detect Flag                                                  */
            uint8_t             : 3;
      __IOM uint8_t PROVFLG     : 1;            /* [4..4] Protection Violation Flag                                          */
      __IOM uint8_t ACCEFLG     : 1;            /* [5..5] Access Error Flag                                                  */
      __IOM uint8_t COLEFLG     : 1;            /* [6..6] Collision Error Flag                                               */
      __IOM uint8_t OCIFLG      : 1;            /* [7..7] Operation Completed Interrupt Flag                                 */
    } bit;
  } STS;

  union {
    __IOM uint8_t reg;                          /* (@ 0x00000001) Configure Register                                         */

    struct {
      __IM  uint8_t EERAMSTS    : 1;           /* [0..0] EERAM State, RAM Available for EEPROM                              */
      __IM  uint8_t RAMCSTS     : 1;            /* [1..1] RAM Current State                                                  */
            uint8_t             : 2;
      __IOM uint8_t ERACMDSUS   : 1;            /* [4..4] Erase Command Suspend                                              */
      __IM  uint8_t ERAABREQ    : 1;            /* [5..5] Erase All Blocks Request                                           */
      __IOM uint8_t RCOLEIEN    : 1;            /* [6..6] Read Collision Error Interrupt Enable                              */
      __IOM uint8_t CMDCIEN     : 1;            /* [7..7] Command Complete Interrupt Enable                                  */
    } bit;
  } CFG;

  union {
    __IM  uint8_t reg;                          /* (@ 0x00000002) Security Register                                          */

    struct {
      __IM  uint8_t SECFLG      : 2;            /* [1..0] Flash Secure Flag                                                  */
      __IM  uint8_t FCACCEN     : 2;            /* [3..2] Flash Content Access Enable                                        */
      __IM  uint8_t MERAEN      : 2;            /* [5..4] Mass Erase Enable                                                  */
      __IM  uint8_t BKEYACCEN   : 2;            /* [7..6] Backdoor Key Access Enable                                         */
    } bit;
  } SEC;

  union {
    __IM  uint8_t reg;                          /* (@ 0x00000003) Nonvolatile Option Register                                */

    struct {
      __IM  uint8_t NOPT        : 8;            /* [7..0] Nonvolatile Option                                                 */
    } bit;
  } NOPT;

  union {
    __IOM uint8_t reg;                          /* (@ 0x00000004) Common Command Data Registers 3                            */

    struct {
      __IOM uint8_t PCMDCODEP3  : 8;            /* [7..0] Provide Command Code and Parameter                                 */
    } bit;
  } CCMDDATA3;

  union {
    __IOM uint8_t reg;                          /* (@ 0x00000005) Common Command Data Registers 2                            */

    struct {
      __IOM uint8_t PCMDCODEP2  : 8;            /* [7..0] Provide Command Code and Parameter                                 */
    } bit;
  } CCMDDATA2;

  union {
    __IOM uint8_t reg;                          /* (@ 0x00000006) Common Command Data Registers 1                            */

    struct {
      __IOM uint8_t PCMDCODEP1  : 8;            /* [7..0] Provide Command Code and Parameter                                 */
    } bit;
  } CCMDDATA1;

  union {
    __IOM uint8_t reg;                          /* (@ 0x00000007) Common Command Data Registers 0                            */

    struct {
      __IOM uint8_t PCMDCODEP0  : 8;            /* [7..0] Provide Command Code and Parameter                                 */
    } bit;
  } CCMDDATA0;

  union {
    __IOM uint8_t reg;                          /* (@ 0x00000008) Common Command Data Registers 7                            */

    struct {
      __IOM uint8_t PCMDCODEP7  : 8;            /* [7..0] Provide Command Code and Parameter                                 */
    } bit;
  } CCMDDATA7;

  union {
    __IOM uint8_t reg;                          /* (@ 0x00000009) Common Command Data Registers 6                            */

    struct {
      __IOM uint8_t PCMDCODEP6  : 8;            /* [7..0] Provide Command Code and Parameter                                 */
    } bit;
  } CCMDDATA6;

  union {
    __IOM uint8_t reg;                          /* (@ 0x0000000A) Common Command Data Registers 5                            */

    struct {
      __IOM uint8_t PCMDCODEP5  : 8;            /* [7..0] Provide Command Code and Parameter                                 */
    } bit;
  } CCMDDATA5;

  union {
    __IOM uint8_t reg;                          /* (@ 0x0000000B) Common Command Data Registers 4                            */

    struct {
      __IOM uint8_t PCMDCODEP4  : 8;            /* [7..0] Provide Command Code and Parameter                                 */
    } bit;
  } CCMDDATA4;

  union {
    __IOM uint8_t reg;                          /* (@ 0x0000000C) Common Command Data Registers B                            */

    struct {
      __IOM uint8_t PCMDCODEPB  : 8;            /* [7..0] Provide Command Code and Parameter                                 */
    } bit;
  } CCMDDATAB;

  union {
    __IOM uint8_t reg;                          /* (@ 0x0000000D) Common Command Data Registers A                            */

    struct {
      __IOM uint8_t PCMDCODEPA  : 8;            /* [7..0] Provide Command Code and Parameter                                 */
    } bit;
  } CCMDDATAA;

  union {
    __IOM uint8_t reg;                          /* (@ 0x0000000E) Common Command Data Registers 9                            */

    struct {
      __IOM uint8_t PCMDCODEP9  : 8;            /* [7..0] Provide Command Code and Parameter                                 */
    } bit;
  } CCMDDATA9;

  union {
    __IOM uint8_t reg;                          /* (@ 0x0000000F) Common Command Data Registers 8                            */

