MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
            uint8_t             : 1;
      __IOM uint8_t DBFIFLG     : 1;            /* [1..1] Double Bit Fault Interrupt Flag                                    */
            uint8_t             : 6;
    } bit;
  } ESTS;

  union {
    __IOM uint8_t reg;                          /* (@ 0x0000002F) Error Configuration Register                               */

    struct {
            uint8_t             : 1;
      __IOM uint8_t DBFIEN      : 1;            /* [1..1] Double Bit Fault Interrupt Enable                                  */
            uint8_t             : 3;
      __IOM uint8_t EDBFINTD    : 1;            /* [5..5] Emulate Double Bit Fault Interrupt Detect                          */
            uint8_t             : 2;
    } bit;
  } ECFG;
} FLASH_T;                                   /* Size = 48 (0x30)                                                             */



/* =========================================================================================================================== */
/* ================                                          DMACHM                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief DMA Memory Access Channel Multiplexer (DMACHM)
  */

typedef struct {                                /* (@ 0x40021000) DMACHM Structure                                           */

  union {
    __IOM uint8_t reg;                          /* (@ 0x00000000) Channel register 0                                         */

    struct {
      __IOM uint8_t SRCCFG      : 6;            /* [5..0] DMA Channel Source Configure                                       */
      __IOM uint8_t PRDTREN     : 1;            /* [6..6] DMA Channel Periodic Trigger Enable                                */
      __IOM uint8_t CHEN        : 1;            /* [7..7] DMA Channel Enable                                                 */
    } bit;
  } CFG[16u];
} DMACHM_T;                                  /* Size = 16 (0x10)                                                             */



/* =========================================================================================================================== */
/* ================                                         CAN                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Controller Local Area Network (CAN)
  */

typedef struct {                                /*  CAN Structure
                                                       (@ 0x40024000)CAN0 (@ 0x40025000)CAN1 (@ 0x4002B000)CAN2  */

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000000) Module Configure register                                  */

    struct {
      __IOM uint32_t LASTMB     : 7;            /* [6..0] Number of the Last Message Buffer                                  */
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t IDFFMT     : 2;            /* [9..8] Rx FIFO ID Filter Format                                           */
      __IM  uint32_t RESERVED1  : 1;
      __IOM uint32_t CANFDEN    : 1;            /* [11..11] CAN FD Operation Enable                                          */
      __IOM uint32_t TAEN       : 1;            /* [12..12] Tx Abort Mechanism Enable                                        */
      __IOM uint32_t LPRIEN     : 1;            /* [13..13] Local Priority Enable                                            */
      __IOM uint32_t PNEN       : 1;            /* [14..14] Pretended Networking Enable                                      */
      __IOM uint32_t DMAEN      : 1;            /* [15..15] DMA Enable for Rx FIFO                                           */
      __IOM uint32_t IRXMQEN    : 1;            /* [16..16] Individual Receive Masking and Queue Enable                      */
      __IOM uint32_t SRD        : 1;            /* [17..17] Self Reception Disable                                           */
      __IM  uint32_t RESERVED2  : 2;
      __IM  uint32_t LPM        : 1;            /* [20..20] Low-Power Mode                                                   */
      __IOM uint32_t WIEN       : 1;            /* [21..21] Warning Interrupt Enable                                         */
      __IM  uint32_t RESERVED3  : 1;
      __IOM uint32_t SVEN       : 1;            /* [23..23] Supervisor Mode Enable                                           */
      __IM  uint32_t FRZFLG     : 1;            /* [24..24] Freeze Mode Flag                                                 */
      __IOM uint32_t CANRST     : 1;            /* [25..25] CAN Reset                                                        */
      __IM  uint32_t RESERVED4  : 1;
      __IM  uint32_t NRDY       : 1;            /* [27..27] Not Ready                                                        */
      __IOM uint32_t EFRZ       : 1;            /* [28..28] Enter Freeze Mode                                                */
      __IOM uint32_t FIFOEN     : 1;            /* [29..29] Rx FIFO Enable                                                   */
      __IOM uint32_t FRZEN      : 1;            /* [30..30] Freeze Mode Enable                                               */
      __IOM uint32_t CMD        : 1;            /* [31..31] CAN Module Disable                                               */
    } bit;
  } MCFG;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000004) Control register 1                                         */

    struct {
      __IOM uint32_t PTS        : 3;            /* [2..0] Propagation Time Segment                                           */
      __IOM uint32_t LOEN       : 1;            /* [3..3] Listen-Only Mode Enable                                            */
      __IOM uint32_t TXLB       : 1;            /* [4..4] Transmit Lowest Buffer First                                       */
      __IOM uint32_t TMRSYN     : 1;            /* [5..5] Timer Sync Feature Enable                                          */
      __IOM uint32_t BORD       : 1;            /* [6..6] Bus Off Recovery Disable                                           */
      __IOM uint32_t TSEN       : 1;            /* [7..7] Triple Sampling Enable                                             */
      __IM  uint32_t RESERVED0  : 2;
      __IOM uint32_t RXWIEN     : 1;            /* [10..10] Rx Warning Interrupt Enable                                      */
      __IOM uint32_t TXWIEN     : 1;            /* [11..11] Tx Warning Interrupt Enable                                      */
      __IOM uint32_t LBEN       : 1;            /* [12..12] Loop Back Mode Enable                                            */
      __IOM uint32_t CLKSEL     : 1;            /* [13..13] CAN Engine Clock Source Select                                   */
      __IOM uint32_t ERRIEN     : 1;            /* [14..14] Error Interrupt Enable                                           */
      __IOM uint32_t BOIEN      : 1;            /* [15..15] Bus Off Interrupt Enable                                         */
      __IOM uint32_t PBS2       : 3;            /* [18..16] Phase Buffer Segment 2                                           */
      __IOM uint32_t PBS1       : 3;            /* [21..19] Phase Buffer Segment 1                                           */
      __IOM uint32_t SJW        : 2;            /* [23..22] Resynchronized Jump Width                                        */
      __IOM uint32_t PDF        : 8;            /* [31..24] Prescaler Division Factor                                        */
    } bit;
  } CTRL1;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000008) Free Running Timer register                                */

