MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
      __IOM uint32_t FRTMR      : 16;           /* [15..0] Free Runnning Timer Value                                         */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } FRTMR;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000010) Rx Mailboxes Global Mask register                          */

    struct {
      __IOM uint32_t RXMASK     : 32;           /* [31..0] Rx Mailboxes Global Mask                                          */
    } bit;
  } RXMASK;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000014) Rx 14 Mask register                                        */

    struct {
      __IOM uint32_t RX14MASK   : 32;           /* [31..0] Rx Buffer 14 Mask                                                 */
    } bit;
  } RX14MASK;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000018) Rx 15 Mask register                                        */

    struct {
      __IOM uint32_t RX15MASK   : 32;           /* [31..0] Rx Buffer 15 Mask                                                 */
    } bit;
  } RX15MASK;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000001C) Error Counter register                                     */

    struct {
      __IOM uint32_t TXERRCNT   : 8;            /* [7..0] Transmit Error Counter                                             */
      __IOM uint32_t RXERRCNT   : 8;            /* [15..8] Receive Error Counter                                             */
      __IOM uint32_t FTXERRCNT  : 8;            /* [23..16] Fast Transmit Error Counter                                      */
      __IOM uint32_t FRXERRCNT  : 8;            /* [31..24] Fast Receive Error Counter                                       */
    } bit;
  } ERRCNT;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000020) Error Flag register 1                                      */

    struct {
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t ERRFLG     : 1;            /* [1..1] Error Interrupt Flag                                               */
      __IOM uint32_t BOFLG      : 1;            /* [2..2] Bus Off Flag                                                       */
      __IM  uint32_t RXFLG      : 1;            /* [3..3] Being Receive Flag                                                 */
      __IM  uint32_t FCFLG      : 2;            /* [5..4] Fault Confinement Flag                                             */
      __IM  uint32_t TXFLG      : 1;            /* [6..6] Being Transmit Flag                                                */
      __IM  uint32_t BIDLEFLG   : 1;            /* [7..7] Bus Idle Flag                                                      */
      __IM  uint32_t RXERRWFLG  : 1;            /* [8..8] RX Error Warning Flag                                              */
      __IM  uint32_t TXERRWFLG  : 1;            /* [9..9] TX Error Warning Flag                                              */
      __IM  uint32_t SERRFLG    : 1;            /* [10..10] Stuffing Error Flag                                              */
      __IM  uint32_t FERRFLG    : 1;            /* [11..11] Form Error Flag                                                  */
      __IM  uint32_t CRCERRFLG  : 1;            /* [12..12] CRC Error Flag                                                   */
      __IM  uint32_t ACKERRFLG  : 1;            /* [13..13] Acknowledge Error Flag                                           */
      __IM  uint32_t B0ERRFLG   : 1;            /* [14..14] Bit0 Error Flag                                                  */
      __IM  uint32_t B1ERRFLG   : 1;            /* [15..15] Bit1 Error Flag                                                  */
      __IOM uint32_t RXWINTFLG  : 1;            /* [16..16] Rx Warning Interrupt Flag                                        */
      __IOM uint32_t TXWINTFLG  : 1;            /* [17..17] Tx Warning Interrupt Flag                                        */
      __IM  uint32_t BSYNFLG    : 1;            /* [18..18] CAN Bus Synchronization Flag                                     */
      __IOM uint32_t BOCINTFLG  : 1;            /* [19..19] Bus Off Process Complete Flag                                    */
      __IOM uint32_t FDERRFLG   : 1;            /* [20..20] Error Interrupt Detected in CAN FD Frame Data Phase
                                                     with BRS bit Set Flag                                                   */
      __IOM uint32_t OVRFLG     : 1;            /* [21..21] Overrun Flag                                                     */
      __IM  uint32_t RESERVED1  : 4;
      __IM  uint32_t FDSERRFLG  : 1;            /* [26..26] Stuffing Error in CAN FD Frame Data Phase with BRS
                                                     bit Set                                                                 */
      __IM  uint32_t FDFERRFLG  : 1;            /* [27..27] Form Error in CAN FD Frame Data Phase with BRS bit
                                                     Set                                                                      */
      __IM  uint32_t FDCRCERRFLG : 1;           /* [28..28] CRC Error in CAN FD Frame Data Phasewith BRS bit Set              */
      __IM  uint32_t RESERVED2  : 1;
      __IM  uint32_t FDB0ERRFLG : 1;            /* [30..30] Bit0 Error in CAN FD Frames Data Phase with BRS bit
                                                     Set                                                                      */
      __IM  uint32_t FDB1ERRFLG : 1;            /* [31..31] Bit1 Error in CAN FD Frames Data Phase with BRS bit
                                                     Set                                                                      */
    } bit;
  } ERRFLG1;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000028) Message Buffer i Interrupt Enable register                 */

