MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
        struct {
          __IM  uint32_t WMID       : 29;           /* [28..0] Wake Up Message ID                                            */
          __IM  uint32_t RESERVED0  : 3;
        } bit;
      } WMBn_ID;

      union {
        __IM  uint32_t reg;                         /* (@ 0x00000B48) Wake Up Message Buffer Register a Low Data              */

        struct {
          __IM  uint32_t BYTE3      : 8;            /* [7..0] Byte3                                                           */
          __IM  uint32_t BYTE2      : 8;            /* [15..8] Byte2                                                          */
          __IM  uint32_t BYTE1      : 8;            /* [23..16] Byte1                                                         */
          __IM  uint32_t BYTE0      : 8;            /* [31..24] Byte0                                                         */
        } bit;
      } WMBn_LDATA;

      union {
        __IM  uint32_t reg;                         /* (@ 0x00000B4C) Wake Up Message Buffer Register a for High Data         */

        struct {
          __IM  uint32_t BYTE7      : 8;            /* [7..0] Byte7                                                           */
          __IM  uint32_t BYTE6      : 8;            /* [15..8] Byte6                                                          */
          __IM  uint32_t BYTE5      : 8;            /* [23..16] Byte5                                                         */
          __IM  uint32_t BYTE4      : 8;            /* [31..24] Byte4                                                         */
        } bit;
      } WMBn_HDATA;
    }WMB[4];

  __IM  uint32_t  RESERVED8[32];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000C00) FD Control register                                        */

    struct {
      __IM  uint32_t TDCV       : 6;            /* [5..0] Transceiver Delay Compensation Value                               */
      __IM  uint32_t RESERVED0  : 2;
      __IOM uint32_t TDCOF      : 5;            /* [12..8] Transceiver Delay Compensation Offset                             */
      __IM  uint32_t RESERVED1  : 1;
      __IOM uint32_t TDCF       : 1;            /* [14..14] Transceiver Delay Compensation Mechanism has Failed              */
      __IOM uint32_t TDCEN      : 1;            /* [15..15] Transceiver Delay Compensation Feature Enable                    */
      __IOM uint32_t MBSIZE     : 2;            /* [17..16] Message Buffer Data Size for Region 0                            */
      __IM  uint32_t RESERVED2  : 13;
      __IOM uint32_t BRSEN      : 1;            /* [31..31] Bit Rate Switch Enable                                           */
    } bit;
  } FDCTRL;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000C04) FD Bit Timing register                                     */

    struct {
      __IOM uint32_t FPBS2      : 3;            /* [2..0] Fast Phase Buffer Segment 2                                        */
      __IM  uint32_t RESERVED0  : 2;
      __IOM uint32_t FPBS1      : 3;            /* [7..5] Fast Phase Buffer Segment 1                                        */
      __IM  uint32_t RESERVED1  : 2;
      __IOM uint32_t FPTS       : 5;            /* [14..10] Fast Propagation Time Segment                                    */
      __IM  uint32_t RESERVED2  : 1;
      __IOM uint32_t FSJW       : 3;            /* [18..16] Fast Resynchronized Jump Width                                   */
      __IM  uint32_t RESERVED3  : 1;
      __IOM uint32_t FPDF       : 10;           /* [29..20] Fast Prescaler Division Factor                                   */
      __IM  uint32_t RESERVED4  : 2;
    } bit;
  } FDBTIM;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000C08) FD CRC register                                            */

    struct {
      __IM  uint32_t EXTCRCV    : 21;           /* [20..0] Extended CRC Value of the Transmitted Message                     */
      __IM  uint32_t RESERVED0  : 3;
      __IM  uint32_t EXTCRCMB   : 7;            /* [30..24] Number of Extended CRC Mailbox                                   */
      __IM  uint32_t RESERVED1  : 1;
    } bit;
  } FDCRC;
} CAN_T;                                /* Size = 3084 (0xc0c)                                                           */



/* =========================================================================================================================== */
/* ================                                           CFGTMR                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Configurable Timer (CFGTMR)
  */

typedef struct {                                /*  CFGTMR Structure
                                             (@ 0x40038000)CFGTMR0 (@ 0x40039000)CFGTMR1 (@ 0x4003A000)CFGTMR2 (@ 0x40026000)CFGTMR3
                                             (@ 0x4006E000)CFGTMR4 (@ 0x4006F000)CFGTMR5                                         */

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000000) Control and Status Register                                */

    struct {
      __IOM uint32_t CLKDFSEL   : 3;            /* [2..0] Clock Division Factor Select                                       */
      __IOM uint32_t CCLKSSEL   : 2;            /* [4..3] Counter Clock Source Select                                        */
      __IOM uint32_t CMSEL      : 1;            /* [5..5] CFGTMR Counter Mode Select                                           */
      __IOM uint32_t RPIEN      : 1;            /* [6..6] Reload Point Interrupt Enable                                      */
      __IOM  uint32_t RFLG       : 1;            /* [7..7] Reload Flag                                                       */
      __IOM uint32_t CFGTMROIEN   : 1;            /* [8..8] CFGTMR Overflow Interrupt Enable                                     */
      __IOM  uint32_t CFGTMROFLG   : 1;            /* [9..9] CFGTMR Overflow Flag                                                */
      __IM  uint32_t RESERVED0  : 6;
      __IOM uint32_t PWMOENCH0  : 1;            /* [16..16] PWM Channel 0-7 Output Enable                                    */
      __IOM uint32_t PWMOENCH1  : 1;            /* [17..17] PWM Channel 0-7 Output Enable                                    */
      __IOM uint32_t PWMOENCH2  : 1;            /* [18..18] PWM Channel 0-7 Output Enable                                    */
      __IOM uint32_t PWMOENCH3  : 1;            /* [19..19] PWM Channel 0-7 Output Enable                                    */
      __IOM uint32_t PWMOENCH4  : 1;            /* [20..20] PWM Channel 0-7 Output Enable                                    */
      __IOM uint32_t PWMOENCH5  : 1;            /* [21..21] PWM Channel 0-7 Output Enable                                    */
      __IOM uint32_t PWMOENCH6  : 1;            /* [22..22] PWM Channel 0-7 Output Enable                                    */
      __IOM uint32_t PWMOENCH7  : 1;            /* [23..23] PWM Channel 0-7 Output Enable                                    */
      __IOM uint32_t FPSCSEL    : 4;            /* [27..24] Filter Prescale Select                                           */
      __IM  uint32_t RESERVED1  : 4;
    } bit;
  } CSTS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000004) Counter Register                                           */

