MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
      __IOM uint32_t CNT        : 16;           /* [15..0] Counter Value                                                     */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } CNT;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000008) Modulo Register                                            */

    struct {
      __IOM uint32_t MOD        : 16;           /* [15..0] Modulo Value                                                      */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } MOD;

  struct {
      union {
        __IOM uint32_t reg;                         /* (@ 0x0000000C) Channel (n) Control And Status Register                */

        struct {
          __IOM uint32_t DMAEN      : 1;            /* [0..0] DMA Enable                                                     */
          __IOM uint32_t CRSTCTRL   : 1;            /* [1..1] CFGTMR Counter Reset Control                                     */
          __IOM uint32_t CHMSEL0    : 1;            /* [2..2] Channel (n) Mode Select 0                                      */
          __IOM uint32_t CHMSEL1    : 1;            /* [3..3] Channel (n) Mode Select 1                                      */
          __IOM uint32_t CHMSEL2    : 1;            /* [4..4] Channel (n) Mode Select 2                                      */
          __IOM uint32_t CHMSEL3    : 1;            /* [5..5] Channel (n) Mode Select 3                                      */
          __IOM uint32_t CHIEN      : 1;            /* [6..6] Channel (n) Interrupt Enable                                   */
          __IOM uint32_t CHEVFLG    : 1;            /* [7..7] Channel (n) Event Flag                                        */
          __IOM uint32_t CHOTMCTRL  : 1;            /* [8..8] Channel (n) Output Trigger Mode Control                        */
          __IM  uint32_t CHISTS     : 1;            /* [9..9] Channel (n) Input State                                        */
          __IM  uint32_t CHOLSEL    : 1;            /* [10..10] Channel (n) Output Value Select                              */
        __IM  uint32_t RESERVED0  : 21;
        } bit;
      } CHnCSTS;

      union {
        __IOM uint32_t reg;                         /* (@ 0x00000010) Channel (n) Value Register                             */

        struct {
          __IOM uint32_t CHV        : 16;           /* [15..0] Channel Value                                                 */
          __IM  uint32_t RESERVED0  : 16;
        } bit;
      } CHnV;
  } CONTROLS[8];

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000004C) Initial Value Register                                     */

    struct {
      __IOM uint32_t INITV      : 16;           /* [15..0] Initial Value                                                     */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } INITV;

  union {
    __IOM  uint32_t reg;                         /* (@ 0x00000050) Capture and Compare Status Register                     */

    struct {
      __IOM  uint32_t CHEVFLG0   : 1;            /* [0..0] Channel 0 Flag                                                   */
      __IOM  uint32_t CHEVFLG1   : 1;            /* [1..1] Channel 1 Flag                                                   */
      __IOM  uint32_t CHEVFLG2   : 1;            /* [2..2] Channel 2 Flag                                                   */
      __IOM  uint32_t CHEVFLG3   : 1;            /* [3..3] Channel 3 Flag                                                   */
      __IOM  uint32_t CHEVFLG4   : 1;            /* [4..4] Channel 4 Flag                                                   */
      __IOM  uint32_t CHEVFLG5   : 1;            /* [5..5] Channel 5 Flag                                                   */
      __IOM  uint32_t CHEVFLG6   : 1;            /* [6..6] Channel 6 Flag                                                   */
      __IOM  uint32_t CHEVFLG7   : 1;            /* [7..7] Channel 7 Flag                                                   */
      __IM  uint32_t RESERVED0  : 24;
    } bit;
  } CCSTS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000054) Features Mode Select Register                              */

    struct {
      __IOM uint32_t CFGTMREN     : 1;            /* [0..0] CFGTMR Module Enable                                                 */
      __OM  uint32_t INITSTS    : 1;            /* [1..1] Channels Output Initialization Status                              */
      __IOM uint32_t WPUNLOCK   : 1;            /* [2..2] Write Protection unlock                                            */
      __IOM uint32_t PWMSMCFG   : 1;            /* [3..3] PWM Synchronization Mode Configure                                 */
      __IOM uint32_t CTMEN      : 1;            /* [4..4] Capture Test Mode Enable                                           */
      __IOM uint32_t FCTRLMSEL  : 2;            /* [6..5] Fault Control Mode Select                                          */
      __IOM uint32_t FCTRLIEN   : 1;            /* [7..7] Fault Control Interrupt Enable                                     */
      __IM  uint32_t RESERVED0  : 24;
    } bit;
  } FMSEL;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000058) Synchronization Register                                   */

    struct {
      __IOM uint32_t MINLPEN    : 1;            /* [0..0] Minimum Loading Point Enable                                       */
      __IOM uint32_t MAXLPEN    : 1;            /* [1..1] Maximum Loading Point Enable                                       */
      __IOM uint32_t CFGTMRCRINT  : 1;            /* [2..2] Reinitialization CFGTMR Counter Value Synchronization                */
      __IOM uint32_t OVSMSEL    : 1;            /* [3..3] Output Value Synchronization Mode Select                           */
      __IOM uint32_t HWT0SEL    : 1;            /* [4..4] PWM Synchronization Hardware Trigger 0 Select                      */
      __IOM uint32_t HWT1SEL    : 1;            /* [5..5] PWM Synchronization Hardware Trigger 1 Select                      */
      __IOM uint32_t HWT2SEL    : 1;            /* [6..6] PWM Synchronization Hardware Trigger 2 Select                      */
      __IOM uint32_t SWTSEL     : 1;            /* [7..7] PWM Synchronization Software Trigger Select                        */
      __IM  uint32_t RESERVED0  : 24;
    } bit;
  } SYN;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000005C) Channel Output Initialization Register                 */

