MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
      __IOM uint32_t DTVSEL     : 6;            /* [5..0] Deadtime Value Select                                              */
      __IOM uint32_t DPSCCFG    : 2;            /* [7..6] Deadtime Prescaler Factor Configure                                */
      __IM  uint32_t RESERVED0  : 8;
      __IOM uint32_t EDTV       : 4;            /* [19..16] Extended Deadtime Value                                          */
      __IM  uint32_t RESERVED1  : 12;
    } bit;
  } DCFG;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000006C) External Trigger Register                                  */

    struct {
      __IOM uint32_t EXTTRGENCH2 : 1;           /* [0..0] Channel 2 External Trigger Generation Enable                       */
      __IOM uint32_t EXTTRGENCH3 : 1;           /* [1..1] Channel 3 External Trigger Generation Enable                       */
      __IOM uint32_t EXTTRGENCH4 : 1;           /* [2..2] Channel 4 External Trigger Generation Enable                       */
      __IOM uint32_t EXTTRGENCH5 : 1;           /* [3..3] Channel 5 External Trigger Generation Enable                       */
      __IOM uint32_t EXTTRGENCH0 : 1;           /* [4..4] Channel 0 External Trigger Generation Enable                       */
      __IOM uint32_t EXTTRGENCH1 : 1;           /* [5..5] Channel 1 External Trigger Generation Enable                       */
      __IOM uint32_t INITTRGEN  : 1;            /* [6..6] Initialization Trigger Generate Enable                             */
      __IOM  uint32_t CHTRGFLG   : 1;            /* [7..7] Channel Trigger Flag                                              */
      __IOM uint32_t EXTTRGENCH6 : 1;           /* [8..8] Channel 6 External Trigger Generation Enable                       */
      __IOM uint32_t EXTTRGENCH7 : 1;           /* [9..9] Channel 7 External Trigger Generation Enable                       */
      __IM  uint32_t RESERVED0  : 22;
    } bit;
  } EXTTRG;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000070) Channel Output Polarity Register                         */

    struct {
      __IOM uint32_t CHPOL0     : 1;            /* [0..0] Channel 0-7 Output Polarity                                        */
      __IOM uint32_t CHPOL1     : 1;            /* [1..1] Channel 0-7 Output Polarity                                        */
      __IOM uint32_t CHPOL2     : 1;            /* [2..2] Channel 0-7 Output Polarity                                        */
      __IOM uint32_t CHPOL3     : 1;            /* [3..3] Channel 0-7 Output Polarity                                        */
      __IOM uint32_t CHPOL4     : 1;            /* [4..4] Channel 0-7 Output Polarity                                        */
      __IOM uint32_t CHPOL5     : 1;            /* [5..5] Channel 0-7 Output Polarity                                        */
      __IOM uint32_t CHPOL6     : 1;            /* [6..6] Channel 0-7 Output Polarity                                        */
      __IOM uint32_t CHPOL7     : 1;            /* [7..7] Channel 0-7 Output Polarity                                        */
      __IM  uint32_t RESERVED0  : 24;
    } bit;
  } CHPOL;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000074) Fault module status register                              */

    struct {
      __IOM uint32_t FIDFLG0    : 1;            /* [0..0] Fault Inputs Detection Flag 0                                     */
      __IOM uint32_t FIDFLG1    : 1;            /* [1..1] Fault Inputs Detection Flag 1                                     */
      __IOM uint32_t FIDFLG2    : 1;            /* [2..2] Fault Inputs Detection Flag 2                                     */
      __IOM uint32_t FIDFLG3    : 1;            /* [3..3] Fault Inputs Detection Flag 3                                     */
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t FICTRL     : 1;            /* [5..5] Fault Inputs Control                                              */
      __IOM uint32_t WPEN       : 1;            /* [6..6] Write Protection Enable                                            */
      __IM  uint32_t FCDFLG     : 1;            /* [7..7] Fault Condition Detection Flag                                     */
      __IM  uint32_t RESERVED1  : 24;
    } bit;
  } FMSTS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000078) Input Capture Filter Control Register                      */

    struct {
      __IOM uint32_t IFVSELCH0  : 4;            /* [3..0] Channel 0 Input Filter Value Select                                */
      __IOM uint32_t IFVSELCH1  : 4;            /* [7..4] Channel 1 Input Filter Value Select                                */
      __IOM uint32_t IFVSELCH2  : 4;            /* [11..8] Channel 2 Input Filter Value Select                               */
      __IOM uint32_t IFVSELCH3  : 4;            /* [15..12] Channel 3 Input Filter Value Select                              */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } ICFCTRL;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000007C) Fault Control Register                                     */

    struct {
      __IOM uint32_t FIEN0      : 1;            /* [0..0] Fault Input 0 Enable                                               */
      __IOM uint32_t FIEN1      : 1;            /* [1..1] Fault Input 1 Enable                                               */
      __IOM uint32_t FIEN2      : 1;            /* [2..2] Fault Input 2 Enable                                               */
      __IOM uint32_t FIEN3      : 1;            /* [3..3] Fault Input 3 Enable                                               */
      __IOM uint32_t FIFEN0     : 1;            /* [4..4] Fault Input Filter 0 Enable                                        */
      __IOM uint32_t FIFEN1     : 1;            /* [5..5] Fault Input Filter 1 Enable                                        */
      __IOM uint32_t FIFEN2     : 1;            /* [6..6] Fault Input Filter 2 Enable                                        */
      __IOM uint32_t FIFEN3     : 1;            /* [7..7] Fault Input Filter 3 Enable                                        */
      __IOM uint32_t FIFVSEL    : 4;            /* [11..8] Fault Input Filter Value Select                                   */
      __IM  uint32_t RESERVED0  : 3;
      __IOM uint32_t FEOSTS     : 1;            /* [15..15] Fault Event Output Status                                        */
      __IM  uint32_t RESERVED1  : 16;
    } bit;
  } FCTRL;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000080) Quadrature Decoder Control And Status Register             */

