MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
      __IOM uint32_t QDMEN      : 1;            /* [0..0] Quadrature Decoder Mode Enable                                     */
      __IM  uint32_t TMRODSEL   : 1;            /* [1..1] Timer Overflow Direction Select                                    */
      __IM  uint32_t CNTDIR     : 1;            /* [2..2] CFGTMR Counter Direction                                             */
      __IOM uint32_t EMSEL      : 1;            /* [3..3] Encoding Mode Select                                               */
      __IOM uint32_t PBISPOL    : 1;            /* [4..4] Phase B Input Signal Polarity Select                               */
      __IOM uint32_t PAISPOL    : 1;            /* [5..5] Phase A Input Signal Polarity Select                               */
      __IOM uint32_t PBIFEN     : 1;            /* [6..6] Phase B Input Filter Value Enable                                  */
      __IOM uint32_t PAIFEN     : 1;            /* [7..7] Phase A Input Filter Value Enable                                  */
      __IM  uint32_t RESERVED0  : 24;
    } bit;
  } QDCSTS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000084) Configure Register                                         */

    struct {
      __IOM uint32_t ROCFG      : 5;            /* [4..0] Reload Opportunities Configure                                     */
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t DBG        : 2;            /* [7..6] Debug Mode                                                         */
      __IM  uint32_t RESERVED1  : 1;
      __IOM uint32_t EGTIMBEN   : 1;            /* [9..9] External Global Time Base Enable                                   */
      __IOM uint32_t GTIMBSGEN  : 1;            /* [10..10] Global Time Base Signal Generation Enable                        */
      __IOM uint32_t INITTRGRP  : 1;            /* [11..11] Initialization Trigger on Reload Point                           */
      __IM  uint32_t RESERVED2  : 20;
    } bit;
  } CFG;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000088) Fault Input Polarity Select Register                       */

    struct {
      __IOM uint32_t FIPOLSEL0  : 1;            /* [0..0] Fault Input 0 Polarity Select                                      */
      __IOM uint32_t FIPOLSEL1  : 1;            /* [1..1] Fault Input 1 Polarity Select                                      */
      __IOM uint32_t FIPOLSEL2  : 1;            /* [2..2] Fault Input 2 Polarity Select                                      */
      __IOM uint32_t FIPOLSEL3  : 1;            /* [3..3] Fault Input 3 Polarity Select                                      */
      __IM  uint32_t RESERVED0  : 28;
    } bit;
  } FIPOLSEL;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000008C) Synchronization Configure Register                         */

    struct {
      __IOM uint32_t HWTRGD     : 1;            /* [0..0] Hardware Trigger Detect                                            */
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t INITVSYN   : 1;            /* [2..2] CFGTMR_INITV Register Synchronization                                */
      __IM  uint32_t RESERVED1  : 1;
      __IOM uint32_t ICTRLSYN   : 1;            /* [4..4] CFGTMR_ICTRL Register Synchronization                                */
      __IOM uint32_t SWOCTRLSYN : 1;            /* [5..5] CFGTMR_SWOCTRL Register Synchronization                              */
      __IM  uint32_t RESERVED2  : 1;
      __IOM uint32_t SYNMSEL    : 1;            /* [7..7] Synchronization Mode Select                                        */
      __IOM uint32_t SWTAC      : 1;            /* [8..8] Software Trigger Activates CFGTMR Counter Register Synchronization   */
      __IOM uint32_t SWTAWRBUF  : 1;            /* [9..9] Software Trigger Activates CFGTMR_MOD,CFGTMR_HC,CFGTMR_INITV
                                                     and CFGTMR_CHnV (n=0...7) Register Synchronization                        */
      __IOM uint32_t SWTAOM     : 1;            /* [10..10] Software Trigger Activates CFGTMR_OMASK Register Synchronization   */
      __IOM uint32_t SWTAICTRL  : 1;            /* [11..11] Software Trigger Activates CFGTMR_ICTRL Register Synchronization   */
      __IOM uint32_t SWTASWO    : 1;            /* [12..12] Software Trigger Activates CFGTMR_SWOCTRL Register Synchronization */
      __IM  uint32_t RESERVED3  : 3;
      __IOM uint32_t HWTAC      : 1;            /* [16..16] Hardware Trigger Activates CFGTMR Counter Register Synchronization */
      __IOM uint32_t HWTAWRBUF  : 1;            /* [17..17] Hardware Trigger Activates CFGTMR_MOD,CFGTMR_HC,CFGTMR_INITV
                                                     and CFGTMR_CHnV (n=0...7) Register Synchronization                        */
      __IOM uint32_t HWTAOM     : 1;            /* [18..18] Hardware Trigger Activates CFGTMR_OMASK Register Synchronization   */
      __IOM uint32_t HWTAICTRL  : 1;            /* [19..19] Hardware Trigger Activates CFGTMR_ICTRL Register Synchronization   */
      __IOM uint32_t HWTASWO    : 1;            /* [20..20] Hardware Trigger Activates CFGTMR_SWOCTRL Register Synchronization */
      __IM  uint32_t RESERVED4  : 11;
    } bit;
  } SYNCFG;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000090) Inverting Control Register                                 */

    struct {
      __IOM uint32_t CHPIEN0    : 1;            /* [0..0] Channels Pair 0 Inverting Enable                                   */
      __IOM uint32_t CHPIEN1    : 1;            /* [1..1] Channels Pair 1 Inverting Enable                                   */
      __IOM uint32_t CHPIEN2    : 1;            /* [2..2] Channels Pair 2 Inverting Enable                                   */
      __IOM uint32_t CHPIEN3    : 1;            /* [3..3] Channels Pair 3 Inverting Enable                                   */
      __IM  uint32_t RESERVED5  : 28;
    } bit;
  } ICTRL;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000094) Software Output Control Register                         */

