MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
      __IOM uint32_t DVSEL      : 6;            /* [5..0] Deadtime Value Select                                            */
      __IOM uint32_t PSCCFG     : 2;            /* [7..6] Deadtime Prescaler Factor Configure                              */
      __IM  uint32_t RESERVED0  : 8;
      __IOM uint32_t EDTV       : 4;            /* [19..16] Extended Deadtime Value                                        */
      __IM  uint32_t RESERVED1  : 12;
    } bit;
  } P3DCFG;

} CFGTMR_T;                                   /* Size = 548 (0x224)                                                            */



/* =========================================================================================================================== */
/* ================                                           ADC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Analog-to-Digital Converter (ADC)
  */
/** ADC - Size of Registers Arrays */
#define ADC_DATARESULT_COUNT                       16U
#define ADC_CSTS1_COUNT                            16U
#define ADC_DATA_COUNT                             16U
#define ADC_ACSTS1_COUNT                           24U
#define ADC_ADATA_COUNT                            24U
#define ADC_COMPVAL_COUNT                          2U

typedef struct {                                /*  ADC Structure  (@ 0x4003B000)ADC0 (@ 0x40027000)ADC1                     */

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000000) Control and Status Register 1x                             */

    struct {
      __IOM uint32_t ICHSEL     : 5;            /* [4..0] Input Channel Select                                               */
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t CCIEN      : 1;            /* [6..6] Conversion Complete Interrupt Enable                               */
      __IM  uint32_t CCFLG      : 1;            /* [7..7] Input Clock Source Select                                          */
      __IM  uint32_t RESERVED1  : 24;
    } bit;
  } CSTS1[ADC_CSTS1_COUNT];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000040) Configure Register 1                                       */

    struct {
      __IOM uint32_t ICLKSSEL   : 2;            /* [1..0] Input Clock Source Select                                          */
      __IOM uint32_t CMODSEL    : 2;            /* [3..2] Conversion Mode Select                                             */
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t CLKDIVCFG  : 2;            /* [6..5] Clock Divider Factor Configure                                     */
      __IM  uint32_t RESERVED1  : 1;
      __OM  uint32_t LTRGCLR    : 1;            /* [8..8] Latch Triggers Clear                                               */
      __IM  uint32_t RESERVED2  : 23;
    } bit;
  } CFG1;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000044) Configure Register 2                                       */

    struct {
      __IOM uint32_t SMPTCFG    : 8;            /* [7..0] Sample Time Configure                                              */
      __IM  uint32_t RESERVED0  : 24;
    } bit;
  } CFG2;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000048) Data Result Registers x                                    */

    struct {
      __IM  uint32_t DATA       : 12;           /* [11..0] Conversion Data                                                   */
      __IM  uint32_t RESERVED0  : 20;
    } bit;
  } DATA[ADC_DATARESULT_COUNT];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000088) Compare Value Registers x                                  */

    struct {
      __IOM uint32_t COMPVAL    : 16;           /* [15..0] Compare Value                                                     */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } COMPVAL[ADC_COMPVAL_COUNT];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000090) Status and Control Register 2                              */

    struct {
      __IOM uint32_t VREFSEL    : 2;            /* [1..0] Voltage Reference Source Select                                    */
      __IOM uint32_t DMAEN      : 1;            /* [2..2] DMA Mode Enable                                                    */
      __IOM uint32_t RCOMPEN    : 1;            /* [3..3] Range Compare Function Enable                                      */
      __IOM uint32_t GTCOMPEN   : 1;            /* [4..4] Greater Than Compare Function Enable                               */
      __IOM uint32_t COMPEN     : 1;            /* [5..5] Compare Function Enable                                            */
      __IOM uint32_t CTRGSEL    : 1;            /* [6..6] Software/Hardware Conversion Trigger Select                        */
      __IM  uint32_t CFLAG      : 1;            /* [7..7] Conversion Flag                                                    */
      __IM  uint32_t RESERVED0  : 5;
      __IM  uint32_t TRGNUM     : 2;            /* [14..13] Trigger Number                                                   */
      __IM  uint32_t RESERVED1  : 1;
      __IM  uint32_t TRGSTS     : 4;            /* [19..16] Trigger Status                                                   */
      __IM  uint32_t RESERVED2  : 4;
      __IM  uint32_t TRGEFLG    : 4;            /* [27..24] Trigger Error Occur Flag                                         */
      __IM  uint32_t RESERVED3  : 4;
    } bit;
  } CSTS2;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000094) Status and Control Register 3                              */

    struct {
      __IOM uint32_t HAVGCFG    : 2;            /* [1..0] Hardware Averaged Samples Configure                                */
      __IOM uint32_t HAVGEN     : 1;            /* [2..2] Hardware Average Function Enable                                   */
      __IOM uint32_t CONTCEN    : 1;            /* [3..3] Continuous Conversion Mode Enable                                  */
      __IM  uint32_t RESERVED0  : 3;
      __IOM uint32_t CAL        : 1;            /* [7..7] Calibration                                                        */
      __IM  uint32_t RESERVED1  : 24;
    } bit;
  } CSTS3;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000098) Base Offset Error Correction Register                      */

