MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
      __IOM uint32_t COCVAL     : 4;            /* [3..0] Capacitor Offset Correction Value                                  */
      __IM  uint32_t RESERVED0  : 28;
    } bit;
  } PSGCALOV2;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000DC) Plus-Side General Calibration Offset Value Register
                                                                    x                                                          */

    struct {
      __IOM uint32_t COCVAL     : 4;            /* [3..0] Capacitor Offset Correction Value                                  */
      __IM  uint32_t RESERVED0  : 28;
    } bit;
  } PSGCALOV1;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000E0) Plus-Side General Calibration Offset Value Register
                                                                    x                                                          */

    struct {
      __IOM uint32_t COCVAL     : 4;            /* [3..0] Capacitor Offset Correction Value                                  */
      __IM  uint32_t RESERVED0  : 28;
    } bit;
  } PSGCALOV0;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000E4) Plus-Side General Calibration Offset Value Register
                                                                    x                                                          */

    struct {
      __IOM uint32_t COCVAL     : 12;           /* [11..0] Capacitor Offset Correction Value                                 */
      __IM  uint32_t RESERVED0  : 20;
    } bit;
  } PSGCALOVX;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000E8) Plus-Side General Calibration Offset Value Register
                                                                    x                                                          */

    struct {
      __IOM uint32_t COCVAL     : 12;           /* [11..0] Capacitor Offset Correction Value                                 */
      __IM  uint32_t RESERVED0  : 20;
    } bit;
  } PSGCALOV9;

} ADC_T;                                    /*                                                          */


/* =========================================================================================================================== */
/* ================                                          LPSPI                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief The LPSPI Memory Map/Register Definition can be found here. (LPSPI)
  */

typedef struct {                                /*  LPSPI Structure
                                                   (@ 0x4002C000)LPSPI0 (@ 0x4002D000)LPSPI1 (@ 0x4002E000)LPSPI2            */

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000000) Version ID Register                                        */

    struct {
      __IM  uint32_t FEATURE    : 16;           /* [15..0] Feature Number                                                    */
      __IM  uint32_t MINOR      : 8;            /* [23..16] Minor Version Number                                             */
      __IM  uint32_t MAJOR      : 8;            /* [31..24] Major Version Number                                             */
    } bit;
  } VERID;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000004) Parameter Register                                         */

    struct {
      __IM  uint32_t TXFSSET    : 8;            /* [7..0] Transmit FIFO Size Set                                             */
      __IM  uint32_t RXFSSET    : 8;            /* [15..8] Receive FIFO Size Set                                             */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } PARA;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000010) Control Register                                           */

    struct {
      __IOM uint32_t MEN        : 1;            /* [0..0] Module Enable                                                      */
      __IOM uint32_t SWRST      : 1;            /* [1..1] Software Reset                                                     */
      __IOM uint32_t DOZEDIS    : 1;            /* [2..2] Disable LPSPI in Doze Mode                                         */
      __IOM uint32_t DBGEN      : 1;            /* [3..3] Enable LPSPI in Debug Mode                                         */
      __IM  uint32_t RESERVED0  : 4;
      __OM  uint32_t TXFRST     : 1;            /* [8..8] Transmit FIFO Reset                                                */
      __OM  uint32_t RXFRST     : 1;            /* [9..9] Receive FIFO Reset                                                 */
      __IM  uint32_t RESERVED1  : 22;
    } bit;
  } CTRL;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000014) Status Register                                            */

    struct {
      __IM  uint32_t TXDATAFLG  : 1;            /* [0..0] Transmit Data Flag                                                 */
      __IM  uint32_t RXDATAFLG  : 1;            /* [1..1] Receive Data Flag                                                  */
      __IM  uint32_t RESERVED0  : 6;
      __IOM uint32_t RXWCFLG    : 1;            /* [8..8] Received Word Complete Flag                                        */
      __IOM uint32_t FTXCFLG    : 1;            /* [9..9] Frame Complete Flag                                                */
      __IOM uint32_t TXCFLG     : 1;            /* [10..10] Transfer Complete Flag                                           */
      __IOM uint32_t TXEFLG     : 1;            /* [11..11] Transmit Error Flag                                              */
      __IOM uint32_t RXEFLG     : 1;            /* [12..12] Receive Error Flag                                               */
      __IOM uint32_t RXMFLG     : 1;            /* [13..13] Receive Data Match Flag                                          */
      __IM  uint32_t RESERVED1  : 10;
      __IM  uint32_t BSYFLG     : 1;            /* [24..24] LPSPI Busy Flag                                                  */
      __IM  uint32_t RESERVED2  : 7;
    } bit;
  } STS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000018) Interrupt Enable Register                                  */

