MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
      __IM  uint32_t TXFCNT     : 3;            /* [2..0] Transmit FIFO Count                                                */
      __IM  uint32_t RESERVED0  : 13;
      __IM  uint32_t RXFCNT     : 3;            /* [18..16] Receive FIFO Count                                               */
      __IM  uint32_t RESERVED1  : 13;
    } bit;
  } FSTS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000060) Transmit Command Register                                  */

    struct {
      __IOM uint32_t FSCFG      : 12;           /* [11..0] Frame Size Configure                                              */
      __IM  uint32_t RESERVED0  : 4;
      __IOM uint32_t TXWIDCFG   : 2;            /* [17..16] Transfer Width Configure                                         */
      __IOM uint32_t TXDATAMASK : 1;            /* [18..18] Transmit Data Mask                                               */
      __IOM uint32_t RXDATAMASK : 1;            /* [19..19] Receive Data Mask                                                */
      __IOM uint32_t CTXCMDW    : 1;            /* [20..20] Continuing Transfer Command Word                                 */
      __IOM uint32_t CTXEN      : 1;            /* [21..21] Continuous Transfer Enable                                       */
      __IOM uint32_t BSEN       : 1;            /* [22..22] Byte Swap Enable                                                 */
      __IOM uint32_t DATAFSEL   : 1;            /* [23..23] Data First Select                                                */
      __IOM uint32_t PCSEL      : 2;            /* [25..24] Peripheral Chip Select                                           */
      __IM  uint32_t RESERVED1  : 1;
      __IOM uint32_t PVALCFG    : 3;            /* [29..27] Prescaler Value Configure                                        */
      __IOM uint32_t CLKPHA     : 1;            /* [30..30] Clock Phase Configure                                            */
      __IOM uint32_t CLKPOL     : 1;            /* [31..31] Clock Polarity Configure                                         */
    } bit;
  } TXCMD;

  union {
    __OM  uint32_t reg;                         /* (@ 0x00000064) Transmit Data Register                                     */

    struct {
      __OM  uint32_t TXDATA     : 32;           /* [31..0] Transmit Data                                                     */
    } bit;
  } TXDATA;
  __IM  uint32_t  RESERVED4[2];

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000070) Receive Status Register                                    */

    struct {
      __IM  uint32_t FDATAWCFG  : 1;            /* [0..0] First Data Word Configure                                          */
      __IM  uint32_t RXFE       : 1;            /* [1..1] Receive FIFO Empty                                                 */
      __IM  uint32_t RESERVED0  : 30;
    } bit;
  } RXSTS;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000074) Receive Data Register                                      */

    struct {
      __IM  uint32_t RXDATA     : 32;           /* [31..0] Receive Data                                                      */
    } bit;
  } RXDATA;
} LPSPI_T;                                  /* Size = 120 (0x78)                                                             */



/* =========================================================================================================================== */
/* ================                                           PDU                                            ================ */
/* =========================================================================================================================== */

/** PDU - Size of Registers Arrays */
#define PDU_CH_COUNT                            2u
#define PDU_CH_DELAY_COUNT                      8u
#define PDU_PODLY_COUNT                         1u

/**
  * @brief Programmable Delay Unit (PDU)
  */

typedef struct {                                /*  PDU Structure  (@ 0x40036000)PDU0 (@ 0x40031000)PDU1                     */

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000000) Control and Status register                                */

    struct {
      __IOM uint32_t LDSUS      : 1;            /* [0..0] Load Success                                                       */
      __IOM uint32_t CMODEN     : 1;            /* [1..1] PDU in Continuous Mode Enable                                      */
      __IOM uint32_t MULPSCCFG  : 2;            /* [3..2] Multiplication Factor Prescaler Configure                          */
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t IEN        : 1;            /* [5..5] Interrupt Enable                                                   */
      __IOM uint32_t IFLG       : 1;            /* [6..6] Interrupt Flag                                                     */
      __IOM uint32_t PDUEN      : 1;            /* [7..7] PDU Enable                                                         */
      __IOM uint32_t TRGINTSEL  : 4;            /* [11..8] Trigger Input Source Select                                       */
      __IOM uint32_t PSCDIVCFG  : 3;            /* [14..12] Prescaler Divider Configure                                      */
      __IOM uint32_t DMAEN      : 1;            /* [15..15] DMA Enable                                                       */
      __OM  uint32_t SWTRGSEL   : 1;            /* [16..16] Software Trigger Select                                          */
      __IOM uint32_t SEQEIEN    : 1;            /* [17..17] Sequence Error Interrupt Enable                                  */
      __IOM uint32_t LDMODSEL   : 2;            /* [19..18] Load Mode Select                                                 */
      __IM  uint32_t RESERVED1  : 12;
    } bit;
  } CSTS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000004) Counter Period register                                    */

