MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/** LPITMR - Register Layout Typedef */
typedef struct {                                /*  (@ 0x40037000) LPITMR Structure                                          */
  union {
    __IM  uint32_t reg;                         /* (@ 0x00000000) Version ID Register                                        */

    struct {
      __IM  uint32_t FEATURE    : 16;           /* [15..0] Feature Support Number                                            */
      __IM  uint32_t MINOR      : 8;            /* [23..16] Minor Version Number                                             */
      __IM  uint32_t MAJOR      : 8;            /* [31..24] Major Version Number                                             */
    } bit;
  } VERID;
  union {
    __IM  uint32_t reg;                         /* (@ 0x00000004) Parameter Register                                         */

    struct {
      __IM  uint32_t NUMTMRCH   : 8;            /* [7..0] Number of Timer Channels                                           */
      __IM  uint32_t NUMETRG    : 8;            /* [15..8] Number of External Triggers                                       */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } PARA;
  union {
    __IOM uint32_t reg;                         /* (@ 0x00000008) Module Control Register                                    */

    struct {
      __IOM uint32_t PCLKTMREN  : 1;            /* [0..0] Peripheral Clock Timer Enable                                      */
      __IOM uint32_t SWRET      : 1;            /* [1..1] Software Reset                                                     */
      __IOM uint32_t DOZEEN     : 1;            /* [2..2] Enable timer channels run in doze mode                             */
      __IOM uint32_t DBGEN      : 1;            /* [3..3] Enable timer channels run in Debug Mode                            */
      __IM  uint32_t RESERVED0  : 28;
    } bit;
  } MCTRL;
  union {
    __IOM uint32_t reg;                         /* (@ 0x0000000C) Module Status Register                                     */

    struct {
      __IOM uint32_t TITFLG0    : 1;            /* [0..0] Channel 0 Timer Interrupt Timeout Flag                             */
      __IOM uint32_t TITFLG1    : 1;            /* [1..1] Channel 1 Timer Interrupt Timeout Flag                             */
      __IOM uint32_t TITFLG2    : 1;            /* [2..2] Channel 2 Timer Interrupt Timeout Flag                             */
      __IOM uint32_t TITFLG3    : 1;            /* [3..3] Channel 3 Timer Interrupt Timeout Flag                             */
      __IM  uint32_t RESERVED0  : 28;
    } bit;
  } MSTS;
  union {
    __IOM uint32_t reg;                         /* (@ 0x00000010) Module Interrupt Enable Register                           */

    struct {
      __IOM uint32_t TIEN0      : 1;            /* [0..0] Channel 0 Timer Interrupt Enable                                   */
      __IOM uint32_t TIEN1      : 1;            /* [1..1] Channel 1 Timer Interrupt Enable                                   */
      __IOM uint32_t TIEN2      : 1;            /* [2..2] Channel 2 Timer Interrupt Enable                                   */
      __IOM uint32_t TIEN3      : 1;            /* [3..3] Channel 3 Timer Interrupt Enable                                   */
      __IM  uint32_t RESERVED0  : 28;
    } bit;
  } MIEN;
  union {
    __IOM uint32_t reg;                         /* (@ 0x00000014) Set Timer Enable Register                                  */

    struct {
      __IOM uint32_t TENCH0     : 1;            /* [0..0] Timer Channel 0 Enable                                             */
      __IOM uint32_t TENCH1     : 1;            /* [1..1] Timer Channel 1 Enable                                             */
      __IOM uint32_t TENCH2     : 1;            /* [2..2] Timer Channel 2 Enable                                             */
      __IOM uint32_t TENCH3     : 1;            /* [3..3] Timer Channel 3 Enable                                             */
      __IM  uint32_t RESERVED0  : 28;
    } bit;
  } STMREN;
  union {
    __IOM uint32_t reg;                         /* (@ 0x00000018) Clear Timer Enable Register                                */

    struct {
      __OM  uint32_t CLRTMREN0  : 1;            /* [0..0] Clear Timer Channel 0 Enable                                       */
      __OM  uint32_t CLRTMREN1  : 1;            /* [1..1] Clear Timer Channel 1 Enable                                       */
      __OM  uint32_t CLRTMREN2  : 1;            /* [2..2] Clear Timer Channel 2 Enable                                       */
      __OM  uint32_t CLRTMREN3  : 1;            /* [3..3] Clear Timer Channel 3 Enable                                       */
      __IM  uint32_t RESERVED0  : 28;
    } bit;
  } CLRTMREN;

   uint8_t RESERVED_0[4];

  struct {                                         /* offset: 0x20, array step: 0x10 */
      union {
        __IOM uint32_t reg;                         /* (@ 0x00000020) Timer Value Register 0                                     */

        struct {
          __IOM uint32_t TMRV       : 32;           /* [31..0] Timer Value                                                       */
        } bit;
      } TMRV;

      union {
        __IM  uint32_t reg;                         /* (@ 0x00000024) Current Timer Value 0                                      */

        struct {
          __IM  uint32_t CTMRV      : 32;           /* [31..0] Current Timer Value                                               */
        } bit;
      } CTMRV;

      union {
        __IOM uint32_t reg;                         /* (@ 0x00000028) Timer Control Register 0                                   */

        struct {
          __IOM uint32_t TMREN      : 1;            /* [0..0] Timer Channel Enable                                               */
          __IOM uint32_t CHAINEN    : 1;            /* [1..1] Channel Chain Enable                                               */
          __IOM uint32_t TMROMCFG   : 2;            /* [3..2] Timer Operation Mode Configure                                     */
          __IM  uint32_t RESERVED0  : 12;
          __IOM uint32_t TMRDCTRL   : 1;            /* [16..16] Timer Decrement Control                                          */
          __IOM uint32_t TMRTOSCTRL : 1;            /* [17..17] Timer Timeout Stop Control                                       */
          __IOM uint32_t TMRRCTRL   : 1;            /* [18..18] Timer Reload Control                                             */
          __IM  uint32_t RESERVED1  : 4;
          __IOM uint32_t TRGSSEL    : 1;            /* [23..23] Trigger Source Select                                            */
          __IOM uint32_t TRGSEL     : 4;            /* [27..24] Trigger Select                                                   */
          __IM  uint32_t RESERVED2  : 4;
        } bit;
      } TMRCTRL;
      uint8_t RESERVED_0[4];
  } TMR[LPITMR_TMR_COUNT];

} LPITMR_T;


/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Real-time clock (RTC)
  */

