MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
      __IOM uint32_t LPO1KCLKOEN : 1;           /* [0..0] 1 kHz LPOCLK Output Enable                                        */
      __IOM uint32_t LPO32KCLKOEN : 1;          /* [1..1] 32 kHz LPOCLK Output Enable                                       */
      __IOM uint32_t CLKLPOSSEL : 2;            /* [3..2] Peripherals LPO Clock Source Select                                */
      __IOM uint32_t CLK32KSSEL : 2;            /* [5..4] Peripherals 32 kHz Clock Source Select                             */
      __IM  uint32_t RESERVED0  : 26;
    } bit;
  } LPOCLKSEL;
  __IM  uint32_t  RESERVED2;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000018) ADC Options Register                                       */

    struct {
      __IOM uint32_t ADC0TRGSSEL : 1;           /* [0..0] ADC0 Trigger Source Select                                         */
      __IOM uint32_t ADC0SWPTSEL : 3;           /* [3..1] ADC0 Software Pretrigger Sources Select                            */
      __IOM uint32_t ADC0PTSSEL : 2;            /* [5..4] ADC0 Pretrigger Source Select                                      */
      __IM  uint32_t RESERVED0  : 2;
      __IOM uint32_t ADC1TRGSSEL : 1;           /* [8..8] ADC1 Trigger Source Select                                         */
      __IOM uint32_t ADC1SWPTSEL : 3;           /* [11..9] ADC1 Software Pretrigger Sources Select                           */
      __IOM uint32_t ADC1PTSSEL : 2;            /* [13..12] ADC1 Pretrigger Source Select                                    */
      __IM  uint32_t RESERVED1  : 18;
    } bit;
  } ADCOPT;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000001C) CFGTMR Option Register 1                                     */

    struct {
      __IOM uint32_t CFGTMR0SYNC  : 1;            /* [0..0] CFGTMR0 Synchronization                                              */
      __IOM uint32_t CFGTMR1SYNC  : 1;            /* [1..1] CFGTMR1 Synchronization                                              */
      __IOM uint32_t CFGTMR2SYNC  : 1;            /* [2..2] CFGTMR2 Synchronization                                              */
      __IOM uint32_t CFGTMR3SYNC  : 1;            /* [3..3] CFGTMR3 Synchronization                                              */
      __IOM uint32_t CFGTMR1CH0ISEL : 2;          /* [5..4] CFGTMR1 CH0 Input Select                                             */
      __IOM uint32_t CFGTMR2CH0ISEL : 2;          /* [7..6] CFGTMR2 CH1 Input Select                                             */
      __IOM uint32_t CFGTMR2CH1ISEL : 1;          /* [8..8] CFGTMR2 CH1 Input Select                                             */
      __IM  uint32_t RESERVED0  : 6;
      __IOM uint32_t CFGTMRGLDMEN : 1;            /* [15..15] CFGTMR Global Load Mechanism Enable                                */
      __IOM uint32_t CFGTMR0MEN   : 8;            /* [23..16] CFGTMR0 Modulation with CFGTMR1_CH1 Enable                           */
      __IOM uint32_t CFGTMR3MEN   : 8;            /* [31..24] CFGTMR3 Modulation with CFGTMR2_CH1 Enable                           */
    } bit;
  } CFGTMROPT1;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000020) Miscellaneous control register 0                           */

    struct {
      __IM  uint32_t RESERVED0  : 9;
      __IOM uint32_t STOP1MON   : 1;            /* [9..9] STOP1 Monitor                                                      */
      __IOM uint32_t STOP2MON   : 1;            /* [10..10] STOP2 Monitor                                                    */
      __IM  uint32_t RESERVED1  : 5;
      __IOM uint32_t CFGTMR0OBECTRL : 1;          /* [16..16] CFGTMR0 OBE Control                                                */
      __IOM uint32_t CFGTMR1OBECTRL : 1;          /* [17..17] CFGTMR1 OBE Control                                                */
      __IOM uint32_t CFGTMR2OBECTRL : 1;          /* [18..18] CFGTMR2 OBE Control                                                */
      __IOM uint32_t CFGTMR3OBECTRL : 1;          /* [19..19] CFGTMR3 OBE Control                                                */
      __IM  uint32_t RESERVED2  : 12;
    } bit;
  } MCTRL0;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000024) System Device Identification Register                      */

    struct {
      __IM  uint32_t CFEA       : 8;            /* [7..0] Chip Features                                                      */
      __IM  uint32_t APOC       : 4;            /* [11..8] Available Package Options for Chips                               */
      __IM  uint32_t CSIPNUM    : 4;            /* [15..12] Chip Silicon Implementation Number                               */
      __IM  uint32_t TASYSRAM   : 4;            /* [19..16] Total Available System RAM                                       */
      __IM  uint32_t CDER       : 4;            /* [23..20] Chip Derivate                                                    */
      __IM  uint32_t CSUB       : 4;            /* [27..24] Chip Subseries                                                   */
      __IM  uint32_t CPSG       : 4;            /* [31..28] Chip Product Series Generation                                   */
    } bit;
  } SYSDEVID;
  __IM  uint32_t  RESERVED3[6];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000040) Platform Clock Gating Control Register                     */

    struct {
      __IOM uint32_t MSCCLKEN   : 1;            /* [0..0] MSC Clock Enable                                                   */
      __IOM uint32_t MPUCLKEN   : 1;            /* [1..1] MPU Clock Enable                                                   */
      __IOM uint32_t DMACLKEN   : 1;            /* [2..2] DMA Clock Gating Control                                           */
      __IOM uint32_t EREPCLKEN  : 1;            /* [3..3] EREP Clock Enable                                                  */
      __IOM uint32_t EINJCLKEN  : 1;            /* [4..4] EINJ Clock Enable                                                  */
      __IM  uint32_t RESERVED0  : 27;
    } bit;
  } PCLKGCTRL;
  __IM  uint32_t  RESERVED4[2];

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000004C) Flash Configure Register 1                                 */

