MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
      __IM  uint32_t RESERVED0  : 12;
      __IM  uint32_t CFGNVMP    : 4;            /* [15..12] Configurable NVM Partition                                       */
      __IM  uint32_t ERAMDS     : 4;            /* [19..16] EEPROM SRAM Data Size                                            */
      __IM  uint32_t RESERVED1  : 12;
    } bit;
  } FLASHCFG1;
  __IM  uint32_t  RESERVED5;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000054) Unique Identification127_96 Register                       */

    struct {
      __IM  uint32_t CUID96TO127 : 32;          /* [31..0] Chip Unique Identification127_96                                  */
    } bit;
  } UID127_96;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000058) Unique Identification95_64Register                         */

    struct {
      __IM  uint32_t CUID64TO95 : 32;           /* [31..0] Chip Unique Identification95_64                                   */
    } bit;
  } UID95_64;

  union {
    __IM  uint32_t reg;                         /* (@ 0x0000005C) Unique Identification63_32Register                         */

    struct {
      __IM  uint32_t CUID32TO63 : 32;           /* [31..0] Chip Unique Identification63_32                                   */
    } bit;
  } UID63_32;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000060) Unique Identification31_0Register                          */

    struct {
      __IM  uint32_t CUID0TO31  : 32;           /* [31..0] Chip Unique Identification31_0                                    */
    } bit;
  } UID31_0;
  __IM  uint32_t  RESERVED6;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000068) System Clock Divider Register 4                            */

    struct {
      __IOM uint32_t TCLKDIVNCFG : 1;           /* [0..0] Trace Fractional Clock Division Numerator Factor Configure         */
      __IOM uint32_t TCLKDIVDCFG : 3;           /* [3..1] Trace Fractional Clock Division Denominator Factor Configure       */
      __IM  uint32_t RESERVED0  : 24;
      __IOM uint32_t DTRACEDEN  : 1;            /* [28..28] Debug Trace Divider Enable                                       */
      __IM  uint32_t RESERVED1  : 3;
    } bit;
  } SYSCLKDIV4;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000006C) Miscellaneous Control register 1                           */

    struct {
      __IOM uint32_t TMC_PSWTR      : 1;            /* [0..0] TMC Peripheral Software Trigger                                    */
      __IM  uint32_t RESERVED0  : 31;
    } bit;
  } MCTRL1;
} SIM_T;                                     /* Size = 112 (0x70)                                                            */



/* =========================================================================================================================== */
/* ================                                            PM                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Port Management (PM)
  */

typedef struct {                                /*  PM Structure
                                     (@ 0x40049000)PMA (@ 0x4004A000)PMB (@ 0x4004B000)PMC (@ 0x4004C000)PMD (@ 0x4004D000)PME */

  union {
    __IOM uint32_t reg;                     /* (@ 0x00000000) Pin Control Register x                                          */

    struct {
      __IOM uint32_t RSEL       : 1;            /* [0..0] Pullup or Pulldown Resistor Select                                 */
      __IOM uint32_t IREN       : 1;            /* [1..1] Internal Pullup or Pulldown Resistor Enable                        */
      __IM  uint32_t RESERVED0  : 2;
      __IOM uint32_t PIFEN      : 1;            /* [4..4] Passive Input Filter Enable                                        */
      __IM  uint32_t RESERVED1  : 1;
      __IOM uint32_t DSCFG      : 1;            /* [6..6] Drive Strength Configure                                           */
      __IM  uint32_t RESERVED2  : 1;
      __IOM uint32_t MUXCTRL    : 3;            /* [10..8] Pin Mux Control                                                   */
      __IM  uint32_t RESERVED3  : 4;
      __IOM uint32_t LOCKCTRL   : 1;            /* [15..15] Control Register Lock                                            */
      __IOM uint32_t INTREQCFG  : 4;            /* [19..16] Interrupt Request Configure                                      */
      __IM  uint32_t RESERVED4  : 4;
      __IOM uint32_t INTFLG     : 1;            /* [24..24] Interrupt Flag                                                   */
      __IM  uint32_t RESERVED5  : 7;
    } bit;
  } PINCTRL[18];
  __IM  uint32_t  RESERVED[14];

  union {
    __OM  uint32_t reg;                         /* (@ 0x00000080) Global Pin Control Low Register                            */

    struct {
      __OM  uint32_t PINW       : 16;           /* [15..0] Global Pin Value Write                                            */
      __OM  uint32_t PINEN      : 16;           /* [31..16] Global Pin Enable                                                */
    } bit;
  } GPINCTRLL;

  union {
    __OM  uint32_t reg;                         /* (@ 0x00000084) Global Pin Control High Register                           */

    struct {
      __OM  uint32_t PINW       : 16;           /* [15..0] Global Pin Value Write                                            */
      __OM  uint32_t PINEN      : 16;           /* [31..16] Global Interrupt Enable                                          */
    } bit;
  } GPINCTRLH;

  union {
    __OM  uint32_t reg;                         /* (@ 0x00000088) Global Interrupt Control Low Register                      */

    struct {
      __OM  uint32_t INTEN     : 16;           /* [15..0] Global Interrupt Enable                                           */
      __OM  uint32_t INTW      : 16;           /* [31..16] Global Interrupt Value Write                                     */
    } bit;
  } GINTCTRLL;

  union {
    __OM  uint32_t reg;                         /* (@ 0x0000008C) Global Interrupt Control High Register                     */

