MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
      __IM  uint32_t FEATURE    : 16;           /* [15..0] Feature Number                                                    */
      __IM  uint32_t MINOR      : 8;            /* [23..16] Minor Version Number                                             */
      __IM  uint32_t MAJOR      : 8;            /* [31..24] Major Version Number                                             */
    } bit;
  } VERID;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000004) Parameter Register                                         */

    struct {
      __IM  uint32_t SHINUMI    : 8;            /* [7..0] Shifter Number Implemented                                         */
      __IM  uint32_t TMRNUMI    : 8;            /* [15..8] Timer Number Implemented                                          */
      __IM  uint32_t PNUMI      : 8;            /* [23..16] Pin Number Implemented                                           */
      __IM  uint32_t TRGNUMI    : 8;            /* [31..24] Trigger Number Implemented                                       */
    } bit;
  } PARA;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000008) Control Register                                           */

    struct {
      __IOM uint32_t CFGIOEN       : 1;         /* [0..0] CFGIO Module Enable                                              */
      __IOM uint32_t SWRSTEN    : 1;            /* [1..1] Software Reset Enable                                              */
      __IOM uint32_t FRACCEN    : 1;            /* [2..2] Fast Register Access Enable                                        */
      __IM  uint32_t RESERVED0  : 27;
      __IOM uint32_t DBGEN      : 1;            /* [30..30] In Debug Mode CFGIO Enable                                     */
      __IOM uint32_t DOZEEN     : 1;            /* [31..31] In Doze Mode CFGIO Enable                                      */
    } bit;
  } CTRL;

  union {
    __IM  uint32_t reg;                         /* (@ 0x0000000C) Pin Input Data Register                                    */

    struct {
      __IM  uint32_t PIDATA     : 8;            /* [7..0] Pin Input Data                                                     */
      __IM  uint32_t RESERVED0  : 24;
    } bit;
  } PIDATA;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000010) Shifter Status Register                                    */

    struct {
      __IOM uint32_t SSTS       : 4;            /* [3..0] Shifter Status                                                     */
      __IM  uint32_t RESERVED0  : 28;
    } bit;
  } SSTS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000014) Shifter Error Flags Register                               */

    struct {
      __IOM uint32_t SERRFLG    : 4;            /* [3..0] Shifter Error Flag                                                 */
      __IM  uint32_t RESERVED0  : 28;
    } bit;
  } SERRFLG;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000018) Timer Status Register                                      */

    struct {
      __IOM uint32_t TMRSTS     : 4;            /* [3..0] Timer Status                                                       */
      __IM  uint32_t RESERVED0  : 28;
    } bit;
  } TMRSTS;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000020) Shifter Status Interrupt Enable Register                   */

    struct {
      __IOM uint32_t SSTSIEN    : 4;            /* [3..0] Shifter Status Interrupt Enable                                    */
      __IM  uint32_t RESERVED0  : 28;
    } bit;
  } SSTSIEN;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000024) Shifter Error Flag Interrupt Enable Register               */

    struct {
      __IOM uint32_t SEFIEN     : 4;            /* [3..0] Shifter Error Flag Interrupt Enable                                */
      __IM  uint32_t RESERVED0  : 28;
    } bit;
  } SEFIEN;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000028) Timer Status Interrupt Enable Register                     */

    struct {
      __IOM uint32_t TMRSTSIEN  : 4;            /* [3..0] Timer Status Interrupt Enable                                      */
      __IM  uint32_t RESERVED0  : 28;
    } bit;
  } TMRSTSIEN;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000030) Shifter Status DMA request Enable Register                 */

    struct {
      __IOM uint32_t DMAREQEN   : 4;            /* [3..0] Shifter Status DMA Request Enable                                  */
      __IM  uint32_t RESERVED0  : 28;
    } bit;
  } DMAREQEN;
  __IM  uint32_t  RESERVED2[19];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000080) Shifter Control Register 0                                 */

    struct {
      __IOM uint32_t SMCFG      : 3;            /* [2..0] Shifter Mode Configure                                             */
      __IM  uint32_t RESERVED0  : 4;
      __IOM uint32_t SPPOLCFG   : 1;            /* [7..7] Shifter Pin Polarity Configure                                     */
      __IOM uint32_t SUPSEL     : 3;            /* [10..8] Shifter Use Pin Select                                            */
      __IM  uint32_t RESERVED1  : 5;
      __IOM uint32_t SOPCFG     : 2;            /* [17..16] Shifter Output Pin Configure                                     */
      __IM  uint32_t RESERVED2  : 5;
      __IOM uint32_t SCLKLCFG   : 1;            /* [23..23] Shift clock location Configure                                   */
      __IOM uint32_t TMRSEL     : 2;            /* [25..24] (Timer Select)                                                   */
      __IM  uint32_t RESERVED3  : 6;
    } bit;
  } SCTRL[4];

  __IM  uint32_t  RESERVED3[28];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000100) Shifter Configure Register 0                               */

