MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
      __IM  uint32_t RESERVED0  : 24;
      __IOM uint32_t SYSCLKOSEL : 4;            /* [27..24] System Clock Output Select                                       */
      __IM  uint32_t RESERVED1  : 4;
    } bit;
  } SYSCLKOSEL;
  __IM  uint32_t  RESERVED1[55];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000100) System OSC Control Status Register                         */

    struct {
      __IOM uint32_t SYSOSCEN   : 1;            /* [0..0] System OSC Enable                                                  */
      __IM  uint32_t RESERVED0  : 15;
      __IOM uint32_t SYSOSCMEN  : 1;            /* [16..16] System OSC Clock Monitor Enable                                  */
      __IOM uint32_t SYSOSCMRSTEN : 1;          /* [17..17] System OSC Clock Monitor Reset Enable                            */
      __IM  uint32_t RESERVED1  : 5;
      __IOM uint32_t LOCK       : 1;            /* [23..23] Register Lock                                                    */
      __IM  uint32_t SYSOSCVLDFLG : 1;          /* [24..24] System OSC Valid Flag                                            */
      __IM  uint32_t SYSOSCSEL  : 1;            /* [25..25] System OSC Select                                                */
      __IOM uint32_t SYSOSCCLKEFLG : 1;         /* [26..26] System OSC Clock Error Flag                                      */
      __IM  uint32_t RESERVED2  : 5;
    } bit;
  } SYSOSCCSTS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000104) System OSC Divide Configure Register                       */

    struct {
      __IOM uint32_t SYSOSCDCFG1 : 3;           /* [2..0] System Clock Divide 1 Configure                                    */
      __IM  uint32_t RESERVED0  : 5;
      __IOM uint32_t SYSOSCDCFG2 : 3;           /* [10..8] System OSC Clock Divide 2 Configure                               */
      __IM  uint32_t RESERVED1  : 21;
    } bit;
  } SYSOSCDIVCFG;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000108) System Oscillator Configure Register                       */

    struct {
      __IM  uint32_t RESERVED0  : 2;
      __IOM uint32_t ERCLKSEL   : 1;            /* [2..2] External Reference Clock Select                                    */
      __IOM uint32_t GOSCSEL    : 1;            /* [3..3] Gain Oscillator Select                                             */
      __IOM uint32_t SYSOSCFSEL : 2;            /* [5..4] System OSC Frequency Select                                        */
      __IM  uint32_t RESERVED1  : 26;
    } bit;
  } SYSOSCCFG;
  __IM  uint32_t  RESERVED2[61];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000200) LSI Control Status Register                                */

    struct {
      __IOM uint32_t LSIEN      : 1;            /* [0..0] LSI Enable                                                         */
      __IOM uint32_t LSIEN_STOP : 1;            /* [1..1] LSI in STOP Mode Enable                                            */
      __IOM uint32_t LSIEN_LP   : 1;            /* [2..2] LSI Low Power Enable                                               */
      __IM  uint32_t RESERVED0  : 20;
      __IOM uint32_t LOCK       : 1;            /* [23..23] Register Lock                                                    */
      __IM  uint32_t LSIVLDFLG  : 1;            /* [24..24] LSI Valid Flag                                                   */
      __IM  uint32_t LSISEL     : 1;            /* [25..25] LSI Select                                                       */
      __IM  uint32_t RESERVED1  : 6;
    } bit;
  } LSICSTS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000204) LSICLK Divide Register                                     */

    struct {
      __IOM uint32_t LSIDIVCFG1 : 3;            /* [2..0] LSI Divide 1 Configure                                             */
      __IM  uint32_t RESERVED0  : 5;
      __IOM uint32_t LSIDIVCFG2 : 3;            /* [10..8] LSI Divide 2 Configure                                            */
      __IM  uint32_t RESERVED1  : 21;
    } bit;
  } LSIDIV;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000208) LSICLK Frequency Select Register                           */

    struct {
      __IOM uint32_t LSIFSEL    : 1;            /* [0..0] LSICLK Frequency Select                                            */
      __IM  uint32_t RESERVED0  : 31;
    } bit;
  } LSIFSEL;
  __IM  uint32_t  RESERVED3[61];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000300) HSI Control Status Register                                */

    struct {
      __IOM uint32_t HSIEN      : 1;            /* [0..0] HSI Enable                                                         */
      __IM  uint32_t RESERVED0  : 2;
      __IOM uint32_t HSIREN     : 1;            /* [3..3] HSI Regulator Enable                                               */
      __IM  uint32_t RESERVED1  : 19;
      __IOM uint32_t LOCK       : 1;            /* [23..23] Register Lock                                                    */
      __IM  uint32_t HSIVLDFLG  : 1;            /* [24..24] HSI Valid Flag                                                   */
      __IM  uint32_t HSISEL     : 1;            /* [25..25] HSI Select                                                       */
      __IOM uint32_t HSIEFLG    : 1;            /* [26..26] HSI Error Flag                                                   */
      __IM  uint32_t RESERVED2  : 5;
    } bit;
  } HSICSTS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000304) HSI Divide Register                                        */

    struct {
      __IOM uint32_t HSIDIVCFG1 : 3;            /* [2..0] HSI Divide 1 Configure                                             */
      __IM  uint32_t RESERVED0  : 5;
      __IOM uint32_t HSIDIVCFG2 : 3;            /* [10..8] HSI Divide 2 Configure                                            */
      __IM  uint32_t RESERVED1  : 21;
    } bit;
  } HSIDIV;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000308) HSI Frequency Select Register                              */

