MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
      __IOM uint32_t HSIFSEL    : 2;            /* [1..0] HSI Frequency Select                                               */
      __IM  uint32_t RESERVED0  : 30;
    } bit;
  } HSIFSEL;
  __IM  uint32_t  RESERVED4[189];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000600) System PLL Control Status Register                         */

    struct {
      __IOM uint32_t SYSPLLEN   : 1;            /* [0..0] System PLL Enable                                                  */
      __IM  uint32_t RESERVED0  : 15;
      __IOM uint32_t SYSPLLMEN  : 1;            /* [16..16] System PLL Clock Monitor Enable                                  */
      __IOM uint32_t SYSPLLMRSTEN : 1;          /* [17..17] System PLL Clock Monitor Reset Enable                            */
      __IM  uint32_t RESERVED1  : 5;
      __IOM uint32_t LOCK       : 1;            /* [23..23] Register Lock                                                    */
      __IM  uint32_t SYSPLLVLDFLG : 1;          /* [24..24] System PLL Valid Flag                                            */
      __IM  uint32_t SYSPLLSEL  : 1;            /* [25..25] System PLL Select                                                */
      __IOM uint32_t SYSPLLCLKEFLG : 1;         /* [26..26] System PLL Clock Error Flag                                      */
      __IM  uint32_t RESERVED2  : 5;
    } bit;
  } SYSPLLCSTS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000604) System PLL Divide Register                                 */

    struct {
      __IOM uint32_t SYSPLLDIVCFG1 : 3;         /* [2..0] System PLL Clock Divide 1 Configuration                            */
      __IM  uint32_t RESERVED0  : 5;
      __IOM uint32_t SYSPLLDIVCFG2 : 3;         /* [10..8] System PLL Clock Divide 2 Configuration                           */
      __IM  uint32_t RESERVED1  : 21;
    } bit;
  } SYSPLLDIV;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000608) System PLL Configuration Register                          */

    struct {
      __IM  uint32_t RESERVED0  : 8;
      __IOM uint32_t PLLRDIVCFG : 3;            /* [10..8] PLL Reference Clock Divider Configure                             */
      __IM  uint32_t RESERVED1  : 5;
      __IOM uint32_t SYSPLLMULCFG : 5;          /* [20..16] System PLL Multiply Factor Configuration                         */
      __IM  uint32_t RESERVED2  : 11;
    } bit;
  } SYSPLLCFG;
} SCG_T;                                     /* Size = 1548 (0x60c)                                                          */



/* =========================================================================================================================== */
/* ================                                            PCM                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Peripheral Clock management (PCM)
  */

typedef struct {                                /* (@ 0x40065000) PCM Structure                                              */
  __IM  uint32_t  RESERVED[32];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000080) FLASH Clock Register                                       */

    struct {
      __IM  uint32_t RESERVED0  : 30;
      __IOM uint32_t FLASHEN    : 1;            /* [30..30] Flash Clock Enable                                               */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } FLASHCLK;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000084) DMACHM Clock Register                                      */

    struct {
      __IM  uint32_t RESERVED0  : 30;
      __IOM uint32_t DMACHMEN   : 1;            /* [30..30] DMACHM Clock Enable                                              */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } DMACHMCLK;
  __IM  uint32_t  RESERVED1[2];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000090) CAN0 Clock Register                                        */

    struct {
      __IM  uint32_t RESERVED0  : 30;
      __IOM uint32_t CAN0EN     : 1;            /* [30..30] CAN0 Clock Enable                                                */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } CAN0CLK;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000094) CAN1 Clock Register                                        */

    struct {
      __IM  uint32_t RESERVED0  : 30;
      __IOM uint32_t CAN1EN     : 1;            /* [30..30] CAN1 Clock Enable                                                */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } CAN1CLK;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000098) CFGTMR3 Clock Register                                       */

    struct {
      __IM  uint32_t RESERVED0  : 24;
      __IOM uint32_t CFGTMR3CSSEL : 3;            /* [26..24] CFGTMR3 Clock Source Select                                        */
      __IM  uint32_t RESERVED1  : 3;
      __IOM uint32_t CFGTMR3EN    : 1;            /* [30..30] CFGTMR3 Clock Enable                                               */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } CFGTMR3CLK;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000009C) ADC1 Clock Register                                        */

    struct {
      __IM  uint32_t RESERVED0  : 24;
      __IOM uint32_t ADC1CSSEL  : 3;            /* [26..24] ADC1 Clock Source Select                                         */
      __IM  uint32_t RESERVED1  : 3;
      __IOM uint32_t ADC1EN     : 1;            /* [30..30] ADC1 Clock Enable                                                */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } ADC1CLK;
  __IM  uint32_t  RESERVED2[3];

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000AC) CAN2 Clock Register                                        */

