MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
      __IM  uint32_t RESERVED0  : 30;
      __IOM uint32_t CAN2EN     : 1;            /* [30..30] CAN2 Clock Enable                                                */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } CAN2CLK;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000B0) LPSPI0 Clock Register                                      */

    struct {
      __IM  uint32_t RESERVED0  : 24;
      __IOM uint32_t SPI0CSSEL  : 3;            /* [26..24] LPSPI0 Clock Source Select                                       */
      __IM  uint32_t RESERVED1  : 3;
      __IOM uint32_t LPSPI0EN   : 1;            /* [30..30] LPSPI0 Clock Enable                                              */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } LPSPI0CLK;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000B4) LPSPI1 Clock Register                                      */

    struct {
      __IM  uint32_t RESERVED0  : 24;
      __IOM uint32_t SPI1CSSEL  : 3;            /* [26..24] LPSPI1 Clock Source Select                                       */
      __IM  uint32_t RESERVED1  : 3;
      __IOM uint32_t LPSPI1EN   : 1;            /* [30..30] LPSPI1 Clock Enable                                              */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } LPSPI1CLK;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000B8) LPSPI2 Clock Register                                      */

    struct {
      __IM  uint32_t RESERVED0  : 24;
      __IOM uint32_t SPI2CSSEL  : 3;            /* [26..24] LPSPI2 Clock Source Select                                       */
      __IM  uint32_t RESERVED1  : 3;
      __IOM uint32_t LPSPI2EN   : 1;            /* [30..30] LPSPI2 Clock Enable                                              */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } LPSPI2CLK;
  __IM  uint32_t  RESERVED3[2];

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000C4) PDU1 Clock Register                                        */

    struct {
      __IM  uint32_t RESERVED0  : 30;
      __IOM uint32_t PDU1EN     : 1;            /* [30..30] PDU1 Clock Enable                                                */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } PDU1CLK;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000C8) CRC Clock Register                                         */

    struct {
      __IM  uint32_t RESERVED0  : 30;
      __IOM uint32_t CRCEN      : 1;            /* [30..30] CRC Clock Enable                                                 */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } CRCCLK;
  __IM  uint32_t  RESERVED4[3];

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000D8) PDU0 Clock Register                                        */

    struct {
      __IM  uint32_t RESERVED0  : 30;
      __IOM uint32_t PDU0EN     : 1;            /* [30..30] PDU0 Clock Enable                                                */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } PDU0CLK;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000DC) PCC LPIT Clock Register                                    */

    struct {
      __IM  uint32_t RESERVED0  : 24;
      __IOM uint32_t LPITMRCSSEL : 3;           /* [26..24] LPITMR Clock Source Select                                       */
      __IM  uint32_t RESERVED1  : 3;
      __IOM uint32_t LPITMREN   : 1;            /* [30..30] LPITMR Clock Enable                                              */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } LPITMRCLK;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000E0) CFGTMR0 Clock Register                                        */

    struct {
      __IM  uint32_t RESERVED0  : 24;
      __IOM uint32_t CFGTMR0CSSEL : 3;            /* [26..24] CFGTMR0 Clock Source Select                                        */
      __IM  uint32_t RESERVED1  : 3;
      __IOM uint32_t CFGTMR0EN    : 1;            /* [30..30] CFGTMR0 Clock Enable                                               */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } CFGTMR0CLK;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000E4) CFGTMR1 Clock Register                                        */

    struct {
      __IM  uint32_t RESERVED0  : 24;
      __IOM uint32_t CFGTMR1CSSEL : 3;            /* [26..24] CFGTMR1 Clock Source Select                                        */
      __IM  uint32_t RESERVED1  : 3;
      __IOM uint32_t CFGTMR1EN    : 1;            /* [30..30] CFGTMR1 Clock Enable                                               */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } CFGTMR1CLK;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000E8) CFGTMR2 Clock Register                                        */

    struct {
      __IM  uint32_t RESERVED0  : 24;
      __IOM uint32_t CFGTMR2CSSEL : 3;            /* [26..24] CFGTMR2 Clock Source Select                                        */
      __IM  uint32_t RESERVED1  : 3;
      __IOM uint32_t CFGTMR2EN    : 1;            /* [30..30] CFGTMR2 Clock Enable                                               */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } CFGTMR2CLK;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000EC) ADC0 Clock Register                                        */

