MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
      __IM  uint32_t RESERVED0  : 24;
      __IOM uint32_t LPUART0CSSEL : 3;          /* [26..24] LPUART0 Clock Source Select                                      */
      __IM  uint32_t RESERVED1  : 3;
      __IOM uint32_t LPUART0EN  : 1;            /* [30..30] LPUART0 Clock Enable                                             */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } LPUART0CLK;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000001AC) LPUART1 Clock Register                                     */

    struct {
      __IM  uint32_t RESERVED0  : 24;
      __IOM uint32_t LPUART1CSSEL : 3;          /* [26..24] LPUART1 Clock Source Select                                      */
      __IM  uint32_t RESERVED1  : 3;
      __IOM uint32_t LPUART1EN  : 1;            /* [30..30] LPUART1 Clock Enable                                             */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } LPUART1CLK;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000001B0) LPUART2 Clock Register                                     */

    struct {
      __IM  uint32_t RESERVED0  : 24;
      __IOM uint32_t LPUART2CSSEL : 3;          /* [26..24] LPUART2 Clock Source Select                                      */
      __IM  uint32_t RESERVED1  : 3;
      __IOM uint32_t LPUART2EN  : 1;            /* [30..30] LPUART2 Clock Enable                                             */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } LPUART2CLK;
  __IM  uint32_t  RESERVED12[6];

  union {
    __IOM uint32_t reg;                         /* (@ 0x000001CC) COMP0 Clock Register                                       */

    struct {
      __IM  uint32_t RESERVED0  : 30;
      __IOM uint32_t COMP0EN    : 1;            /* [30..30] COMP0 Clock Enable                                               */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } COMP0CLK;
} PCM_T;                                     /* Size = 464 (0x1d0)                                                           */



/* =========================================================================================================================== */
/* ================                                           LPI2C                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief The LPI2C Memory Map/Register Definition can be found here. (LPI2C)
  */

typedef struct {                                /* (@ 0x40066000) LPI2C Structure                                            */

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000000) Version ID Register                                        */

    struct {
      __IM  uint32_t FEATURE    : 16;           /* [15..0] Feature Number                                                    */
      __IM  uint32_t MINOR      : 8;            /* [23..16] Minor Version Number                                             */
      __IM  uint32_t MAJOR      : 8;            /* [31..24] Major Version Number                                             */
    } bit;
  } VERID;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000004) Parameter Register                                         */

    struct {
      __IM  uint32_t MTXFS      : 4;            /* [3..0] Master Transmit FIFO Size                                          */
      __IM  uint32_t RESERVED0  : 4;
      __IM  uint32_t MRXFS      : 4;            /* [11..8] Master Receive FIFO Size                                          */
      __IM  uint32_t RESERVED1  : 20;
    } bit;
  } PARA;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000010) Master Control Register                                    */

    struct {
      __IOM uint32_t MMEN       : 1;            /* [0..0] Master Mode Enable                                                 */
      __IOM uint32_t MRST       : 1;            /* [1..1] Master Logic Software Reset                                        */
      __IOM uint32_t DOZEDIS    : 1;            /* [2..2] Master Disabled in Doze Mode                                       */
      __IOM uint32_t DBGEN      : 1;            /* [3..3] Master Enabled in Debug Mode                                       */
      __IM  uint32_t RESERVED0  : 4;
      __OM  uint32_t TXFRST     : 1;            /* [8..8] Transmit FIFO Reset                                                */
      __OM  uint32_t RXFRST     : 1;            /* [9..9] Receive FIFO Reset                                                 */
      __IM  uint32_t RESERVED1  : 22;
    } bit;
  } MCTRL;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000014) Master Status Register                                     */

    struct {
      __IM  uint32_t TXFLG      : 1;            /* [0..0] Transmit Data Flag                                                 */
      __IM  uint32_t RXFLG      : 1;            /* [1..1] Receive Data Flag                                                  */
      __IM  uint32_t RESERVED0  : 6;
      __IOM uint32_t ENDFLG     : 1;            /* [8..8] End Flag                                                           */
      __IOM uint32_t STOPFLG    : 1;            /* [9..9] STOP Flag                                                          */
      __IOM uint32_t NACKFLG    : 1;            /* [10..10] Unexpected NACK Detect Flag                                      */
      __IOM uint32_t MALFLG     : 1;            /* [11..11] Master Arbitration Lost Flag                                     */
      __IOM uint32_t FEFLG      : 1;            /* [12..12] FIFO Error Flag                                                  */
      __IOM uint32_t PLTFLG     : 1;            /* [13..13] Pin Low Timeout Flag                                             */
      __IOM uint32_t RXMFLG     : 1;            /* [14..14] Received Data Match Flag                                         */
      __IM  uint32_t RESERVED1  : 9;
      __IM  uint32_t MBSYFLG    : 1;            /* [24..24] LPI2C Master Busy Flag                                             */
      __IM  uint32_t BBSYFLG    : 1;            /* [25..25] LPI2C Bus Busy Flag                                                */
      __IM  uint32_t RESERVED2  : 6;
    } bit;
  } MSTS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000018) Master Interrupt Enable Register                           */

