MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
      __IOM uint32_t TXDIEN     : 1;            /* [0..0] Transmit Data Interrupt Enable                                     */
      __IOM uint32_t RXDIEN     : 1;            /* [1..1] Receive Data Interrupt Enable                                      */
      __IM  uint32_t RESERVED0  : 6;
      __IOM uint32_t ENDIEN     : 1;            /* [8..8] End Packet Interrupt Enable                                        */
      __IOM uint32_t STOPIEN    : 1;            /* [9..9] STOP Detect Interrupt Enable                                       */
      __IOM uint32_t NACKIEN    : 1;            /* [10..10] Unexpected NACK Detect Interrupt Enable                          */
      __IOM uint32_t MALIEN     : 1;            /* [11..11] Master Arbitration Lost Interrupt Enable                         */
      __IOM uint32_t FEIEN      : 1;            /* [12..12] FIFO Error Interrupt Enable                                      */
      __IOM uint32_t PLTIEN     : 1;            /* [13..13] Pin Low Timeout Interrupt Enable                                 */
      __IOM uint32_t RXMIEN     : 1;            /* [14..14] Received Data Match Interrupt Enable                             */
      __IM  uint32_t RESERVED1  : 17;
    } bit;
  } MINTEN;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000001C) Master DMA Enable Register                                 */

    struct {
      __IOM uint32_t TXDMAEN    : 1;            /* [0..0] Transmit Data DMA Enable                                           */
      __IOM uint32_t RXDMAEN    : 1;            /* [1..1] Receive Data DMA Enable                                            */
      __IM  uint32_t RESERVED0  : 30;
    } bit;
  } MDMAEN;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000020) Master Configure Register 0                                */

    struct {
      __IOM uint32_t HRIEN      : 1;            /* [0..0] Host Request Input Enable                                          */
      __IOM uint32_t HRPCFG     : 1;            /* [1..1] Host Request Polarity Configure                                    */
      __IOM uint32_t HRISRC     : 1;            /* [2..2] Host Request Input Source Select                                   */
      __IM  uint32_t RESERVED0  : 5;
      __IOM uint32_t CFEN       : 1;            /* [8..8] Circular FIFO Enable                                               */
      __IOM uint32_t RXMEN      : 1;            /* [9..9] Receive Data Match Enable                                          */
      __IM  uint32_t RESERVED1  : 22;
    } bit;
  } MCFG0;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000024) Master Configure Register 1                                */

    struct {
      __IOM uint32_t CLKPS      : 3;            /* [2..0] Clock Prescaler Configure                                          */
      __IM  uint32_t RESERVED0  : 5;
      __IOM uint32_t ASGEN      : 1;            /* [8..8] Automatic STOP Condition Generation                                */
      __IOM uint32_t INACK      : 1;            /* [9..9] Ignore NACK                                                        */
      __IOM uint32_t PINLTOCFG  : 1;            /* [10..10] Pin Low Timeout Configure                                        */
      __IM  uint32_t RESERVED1  : 5;
      __IOM uint32_t MCCFG      : 3;            /* [18..16] Match Condition Configure                                        */
      __IM  uint32_t RESERVED2  : 5;
      __IOM uint32_t PINMCFG    : 3;            /* [26..24] Pin Mode Configure                                               */
      __IM  uint32_t RESERVED3  : 5;
    } bit;
  } MCFG1;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000028) Master Configure Register 2                                */

    struct {
      __IOM uint32_t BITO       : 12;           /* [11..0] Bus Idle Timeout Value                                            */
      __IM  uint32_t RESERVED0  : 4;
      __IOM uint32_t FILSCLCFG  : 4;            /* [19..16] Filter SCL Configure                                             */
      __IM  uint32_t RESERVED1  : 4;
      __IOM uint32_t FILSDACFG  : 4;            /* [27..24] Filter SDA Configure                                             */
      __IM  uint32_t RESERVED2  : 4;
    } bit;
  } MCFG2;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000002C) Master Configure Register 3                                */

    struct {
      __IM  uint32_t RESERVED0  : 8;
      __IOM uint32_t PLTO       : 12;           /* [19..8] Pin Low Timeout Flag Configure                                    */
      __IM  uint32_t RESERVED1  : 12;
    } bit;
  } MCFG3;
  __IM  uint32_t  RESERVED1[4];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000040) Master Data Match Register                                 */

    struct {
      __IOM uint32_t VAL0       : 8;            /* [7..0] Compare Match 0 Value                                              */
      __IM  uint32_t RESERVED0  : 8;
      __IOM uint32_t VAL1       : 8;            /* [23..16] Compare Match 1 Value                                            */
      __IM  uint32_t RESERVED1  : 8;
    } bit;
  } MDATAM;
  __IM  uint32_t  RESERVED2;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000048) Master Clock Configure Register 0                          */

    struct {
      __IOM uint32_t SCLLC      : 6;            /* [5..0] SCL Low Cycles                                                     */
      __IM  uint32_t RESERVED0  : 2;
      __IOM uint32_t SCLHC      : 6;            /* [13..8] SCL High Cycles                                                   */
      __IM  uint32_t RESERVED1  : 2;
      __IOM uint32_t SETUPT     : 6;            /* [21..16] Minimum Number of Cycles of Setup Time                           */
      __IM  uint32_t RESERVED2  : 2;
      __IOM uint32_t SDAHT      : 6;            /* [29..24] Minimum Cycle of SDA Hold Time                                   */
      __IM  uint32_t RESERVED3  : 2;
    } bit;
  } MCLKCFG0;
  __IM  uint32_t  RESERVED3;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000050) Master Clock Configure Register 1                          */

