MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
      __IOM uint32_t SCLLC      : 6;            /* [5..0] SCL Low Cycles                                                     */
      __IM  uint32_t RESERVED0  : 2;
      __IOM uint32_t SCLHC      : 6;            /* [13..8] SCL High Cycles                                                   */
      __IM  uint32_t RESERVED1  : 2;
      __IOM uint32_t SETUPT     : 6;            /* [21..16] Minimum Number of Cycles of Setup Time                           */
      __IM  uint32_t RESERVED2  : 2;
      __IOM uint32_t SDAHT      : 6;            /* [29..24] Minimum Cycle of SDA Hold Time                                   */
      __IM  uint32_t RESERVED3  : 2;
    } bit;
  } MCLKCFG1;
  __IM  uint32_t  RESERVED4;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000058) Master FIFO Control Register                               */

    struct {
      __IOM uint32_t TXFW       : 2;            /* [1..0] Transmit FIFO Watermark                                            */
      __IM  uint32_t RESERVED0  : 14;
      __IOM uint32_t RXFW       : 2;            /* [17..16] Receive FIFO Watermark                                           */
      __IM  uint32_t RESERVED1  : 14;
    } bit;
  } MFCTRL;

  union {
    __IM  uint32_t reg;                         /* (@ 0x0000005C) Master FIFO Status Register                                */

    struct {
      __IM  uint32_t TXCNT      : 3;            /* [2..0] Transmit FIFO Count                                                */
      __IM  uint32_t RESERVED0  : 13;
      __IM  uint32_t RXCNT      : 3;            /* [18..16] Receive FIFO Count                                               */
      __IM  uint32_t RESERVED1  : 13;
    } bit;
  } MFSTS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000060) Master Transmit Data Register                              */

    struct {
      __OM  uint32_t TXDATA     : 8;            /* [7..0] Transmit Data                                                      */
      __OM  uint32_t CMD        : 3;            /* [10..8] Command                                                           */
      __IM  uint32_t RESERVED0  : 21;
    } bit;
  } MTXDATA;
  __IM  uint32_t  RESERVED5[3];

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000070) Master Receive Data Register                               */

    struct {
      __IM  uint32_t RXDATA     : 8;            /* [7..0] Read Undiscarded Received Data                                     */
      __IM  uint32_t RESERVED0  : 6;
      __IM  uint32_t RXFE       : 1;            /* [14..14] Receive FIFO Empty                                               */
      __IM  uint32_t RESERVED1  : 17;
    } bit;
  } MRXDATA;
  __IM  uint32_t  RESERVED6[39];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000110) Slave Control Register                                     */

    struct {
      __IOM uint32_t SMEN       : 1;            /* [0..0] Slave Mode Enable                                                  */
      __IOM uint32_t SRST       : 1;            /* [1..1] Slave Logic Software Reset                                         */
      __IM  uint32_t RESERVED0  : 2;
      __IOM uint32_t SMFEN      : 1;            /* [4..4] Slave Mode Filter Enable                                           */
      __IOM uint32_t FDDM       : 1;            /* [5..5] Filter Disabled in Doze Mode                                       */
      __IM  uint32_t RESERVED1  : 2;
      __OM  uint32_t TXFRST     : 1;            /* [8..8] Transmit FIFO Reset                                                */
      __OM  uint32_t RXFRST     : 1;            /* [9..9] Receive FIFO Reset                                                 */
      __IM  uint32_t RESERVED2  : 22;
    } bit;
  } SCTRL;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000114) Slave Status Register                                      */

    struct {
      __IM  uint32_t TXFLG      : 1;            /* [0..0] Transmit Data Flag                                                 */
      __IM  uint32_t RXFLG      : 1;            /* [1..1] Receive Data Flag                                                  */
      __IM  uint32_t AVFLG      : 1;            /* [2..2] Address Status Register Valid Flag                                 */
      __IM  uint32_t TAFLG      : 1;            /* [3..3] Transmit ACK/NACK Flag                                             */
      __IM  uint32_t RESERVED0  : 4;
      __IOM uint32_t RSFLG      : 1;            /* [8..8] Repeated Start Flag                                                */
      __IOM uint32_t STOPFLG    : 1;            /* [9..9] STOP Detect Flag                                                   */
      __IOM uint32_t BEFLG      : 1;            /* [10..10] Bit Error Flag                                                   */
      __IOM uint32_t FEFLG      : 1;            /* [11..11] FIFO Error Flag                                                  */
      __IM  uint32_t A0MFLG     : 1;            /* [12..12] Address 0 Match Address Flag                                     */
      __IM  uint32_t A1MFLG     : 1;            /* [13..13] Address 1 Match Address Flag                                     */
      __IM  uint32_t GCAFLG     : 1;            /* [14..14] General Call Address Flag                                        */
      __IM  uint32_t SARFLG     : 1;            /* [15..15] SMBus Alert Response Flag                                        */
      __IM  uint32_t RESERVED1  : 8;
      __IM  uint32_t SBSYFLG    : 1;            /* [24..24] LPI2C Slave Busy Flag                                              */
      __IM  uint32_t BBSYFLG    : 1;            /* [25..25] LPI2C Bus Busy Flag                                                */
      __IM  uint32_t RESERVED2  : 6;
    } bit;
  } SSTS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000118) Slave Interrupt Enable Register                            */

