MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
      __IOM uint32_t TXNACK     : 1;            /* [0..0] Write a Transmit NACK                                              */
      __IM  uint32_t RESERVED0  : 31;
    } bit;
  } STXACK;
  __IM  uint32_t  RESERVED10[2];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000160) Slave Transmit Data Register                               */

    struct {
      __OM  uint32_t TXDATA     : 8;            /* [7..0] Slave Transmit Data                                                */
      __IM  uint32_t RESERVED0  : 24;
    } bit;
  } STXDATA;
  __IM  uint32_t  RESERVED11[3];

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000170) Slave Receive Data Register                                */

    struct {
      __IM  uint32_t RXDATA     : 8;            /* [7..0] Slave Received Data                                                */
      __IM  uint32_t RESERVED0  : 6;
      __IM  uint32_t RXDE       : 1;            /* [14..14] Receive Data Register Empty                                      */
      __IM  uint32_t FDW        : 1;            /* [15..15] First Data Word                                                  */
      __IM  uint32_t RESERVED1  : 16;
    } bit;
  } SRXDATA;
} LPI2C_T;                                   /* Size = 372 (0x174)                                                        */



/* =========================================================================================================================== */
/* ================                                          LPUART                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Low-power Universal asynchronous receiver/transmitters (LPUART)
  */

typedef struct {                                /*  LPUART Structure
                                                    (@ 0x4006A000)LPUART0 (@ 0x4006B000)LPUART1 (@ 0x4006C000)LPUART2        */

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000000) Version ID Register                                        */

    struct {
      __IM  uint32_t FEATURE    : 16;           /* [15..0] Feature Number                                                    */
      __IM  uint32_t MINOR      : 8;            /* [23..16] Minor Version Number                                             */
      __IM  uint32_t MAJOR      : 8;            /* [31..24] Major Version Number                                             */
    } bit;
  } VERID;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000004) Parameter Register                                         */

    struct {
      __IM  uint32_t TXFSSET    : 8;            /* [7..0] Transmit FIFO Size Set                                             */
      __IM  uint32_t RXFSSET    : 8;            /* [15..8] Receive FIFO Size Set                                             */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } PARA;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000008) LPUART Software Reset Register                             */

    struct {
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t SWRSTEN    : 1;            /* [1..1] Software Reset Enable                                              */
      __IM  uint32_t RESERVED1  : 30;
    } bit;
  } SWRST;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000000C) LPUART Pin Configuration Register                          */

    struct {
      __IOM uint32_t ITRGCFG    : 2;            /* [1..0] Input Trigger Configure                                            */
      __IM  uint32_t RESERVED0  : 30;
    } bit;
  } PCFG;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000010) LPUART Baud Rate Register                                  */

    struct {
      __IOM uint32_t BRMD       : 13;           /* [12..0] Baud Rate Modulo Divisor                                          */
      __IOM uint32_t STOPBSEL   : 1;            /* [13..13] Stop Bit Select                                                  */
      __IOM uint32_t RXIAEIEN   : 1;            /* [14..14] Receive Input Active Edge Interrupt Enable                       */
      __IOM uint32_t LBDFIEN    : 1;            /* [15..15] LIN Break Detect Flag Interrupt Enable                           */
      __IOM uint32_t RXDWRDIS   : 1;            /* [16..16] Received Data Word Resynchronization Disable                     */
      __IOM uint32_t BEDSMPSEL  : 1;            /* [17..17] Both Edge Sampling Mode Select                                   */
      __IOM uint32_t MADDRMCFG  : 2;            /* [19..18] Match Addressing Mode Configure                                  */
      __IOM uint32_t RXIDMAREN  : 1;            /* [20..20] Receiver Idle DMA Request Enable                                 */
      __IOM uint32_t RXFDMAREN  : 1;            /* [21..21] Receiver Full DMA Request Enable                                 */
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t TXDMAREN   : 1;            /* [23..23] Transmitter DMA Request Enable                                   */
      __IOM uint32_t OSRCFG     : 5;            /* [28..24] Oversampling Ratio Configure                                     */
      __IOM uint32_t SELM10     : 1;            /* [29..29] 10-bit Mode Select                                               */
      __IOM uint32_t MADDREN2   : 1;            /* [30..30] Match Address 2 Mode Enable                                      */
      __IOM uint32_t MADDREN1   : 1;            /* [31..31] Match Address 1 Mode Enable                                      */
    } bit;
  } BR;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000014) LPUART Status Register                                     */

    struct {
      __IM  uint32_t RESERVED0  : 14;
      __IOM uint32_t RXDMFLG2   : 1;            /* [14..14] Received Data Match 2 Flag                                       */
      __IOM uint32_t RXDMFLG1   : 1;            /* [15..15] Received Data Match 1 Flag                                       */
      __IOM uint32_t PEFLG      : 1;            /* [16..16] Parity Error Flag                                                */
      __IOM uint32_t FEFLG      : 1;            /* [17..17] Fram Error Flag                                                  */
      __IOM uint32_t NEFLG      : 1;            /* [18..18] Noise Flag                                                       */
      __IOM uint32_t OVREFLG    : 1;            /* [19..19] Overrun Error Flag                                               */
      __IOM uint32_t IDLEFLG    : 1;            /* [20..20] Idle Line Detected Flag                                          */
      __IM  uint32_t RXBFFLG    : 1;            /* [21..21] Receive Data Buffer full Flag                                    */
      __IM  uint32_t TXCFLG     : 1;            /* [22..22] Transmission data Complete Flag                                  */
      __IM  uint32_t TXBEFLG    : 1;            /* [23..23] Transmit Data Buffer Empty Flag                                  */
      __IM  uint32_t RXDINIFLG  : 1;            /* [24..24] RXD Input Not Idle Flag                                          */
      __IOM uint32_t LBDEN      : 1;            /* [25..25] LIN Break Detection Enable                                       */
      __IOM uint32_t BCTXLEN    : 1;            /* [26..26] Break Character Transmission Length                              */
      __IOM uint32_t RXWUPID    : 1;            /* [27..27] Receive Wake Up Idle Detect                                      */
      __IOM uint32_t RXDIPINV   : 1;            /* [28..28] Received Data Input Polarity Inversion                           */
      __IOM uint32_t MSBFSET    : 1;            /* [29..29] MSB First Set                                                    */
      __IOM uint32_t AERXPFLG   : 1;            /* [30..30] Active Edge on Receive Pin Flag                                  */
      __IOM uint32_t LBDFLG     : 1;            /* [31..31] LIN Break Detected Flag                                          */
    } bit;
  } STS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000018) LPUART Control Register                                    */

