MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
      __IOM uint32_t PTCFG      : 1;            /* [0..0] Parity Type Configure                                              */
      __IOM uint32_t PENCFG      : 1;            /* [1..1] Parity Enable Configure                                            */
      __IOM uint32_t ITSEL      : 1;            /* [2..2] Idle Type Select                                                   */
      __IOM uint32_t RXWAKESEL  : 1;            /* [3..3] Receiver Wakeup Method Select                                      */
      __IOM uint32_t RXTXCSEL   : 1;            /* [4..4] Receiver and Transmit Character Select                             */
      __IOM uint32_t RXISRCSEL  : 1;            /* [5..5] Receiver Input Source Select                                       */
      __IOM uint32_t DOZEMODEEN : 1;            /* [6..6] Doze Mode Enable                                                   */
      __IOM uint32_t LSWSEL     : 1;            /* [7..7] Loop Mode or Single-wire Mode Select                               */
      __IOM uint32_t IDLECCFG   : 3;            /* [10..8] Idle Character Configure                                          */
      __IOM uint32_t RXTXSELM7  : 1;            /* [11..11] Receiver and Transmit Select 7-bit Mode                          */
      __IM  uint32_t RESERVED0  : 2;
      __IOM uint32_t FIENM2     : 1;            /* [14..14] Match 2 Flag Interrupt Enable                                    */
      __IOM uint32_t FIENM1     : 1;            /* [15..15] Match 1 Flag Interrupt Enable                                    */
      __IOM uint32_t TXBK       : 1;            /* [16..16] Transmit Break                                                   */
      __IOM uint32_t RXWUPCTRL  : 1;            /* [17..17] Receiver Wakeup Control                                          */
      __IOM uint32_t RXEN       : 1;            /* [18..18] LPUART Receiver Enable                                           */
      __IOM uint32_t TXEN       : 1;            /* [19..19] LPUART Transmitter Enable                                        */
      __IOM uint32_t IDLEIEN    : 1;            /* [20..20] Idle Line Interrupt Enable                                       */
      __IOM uint32_t RXIEN      : 1;            /* [21..21] Receiver Interrupt Enable                                        */
      __IOM uint32_t TXCIEN     : 1;            /* [22..22] Transmission Complete Interrupt Enable                           */
      __IOM uint32_t TXIEN      : 1;            /* [23..23] Transmit Interrupt Enable                                        */
      __IOM uint32_t PEIEN      : 1;            /* [24..24] Parity Error Interrupt Enable                                    */
      __IOM uint32_t FEIEN      : 1;            /* [25..25] Framing Error Interrupt Enable                                   */
      __IOM uint32_t NEIEN      : 1;            /* [26..26] Noise Error Interrupt Enable                                     */
      __IOM uint32_t OVRIEN     : 1;            /* [27..27] Overrun Interrupt Enable                                         */
      __IOM uint32_t TXDOPINV   : 1;            /* [28..28] Transmit Data Output Polarity Inversion                          */
      __IOM uint32_t TXDPDIRSEL : 1;            /* [29..29] TXD Pin Direction in Single-Wire Mode Select                     */
      __IOM uint32_t RX9TX8     : 1;            /* [30..30] Receive Data Bit 9 / Transmit Data Bit 8                         */
      __IOM uint32_t RX8TX9     : 1;            /* [31..31] Receive Data Bit 8 / Transmit Data Bit 9                         */
    } bit;
  } CTRL;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000001C) LPUART Data Register                                       */

    struct {
      __IOM uint32_t RX0TX0     : 1;            /* [0..0] Rx Buffer 0 or Tx Buffer 0                                         */
      __IOM uint32_t RX1TX1     : 1;            /* [1..1] Rx Buffer 1 or Tx Buffer 1                                         */
      __IOM uint32_t RX2TX2     : 1;            /* [2..2] Rx Buffer 2 or Tx Buffer 2                                         */
      __IOM uint32_t RX3TX3     : 1;            /* [3..3] Rx Buffer 3 or Tx Buffer 3                                         */
      __IOM uint32_t RX4TX4     : 1;            /* [4..4] Rx Buffer 4 or Tx Buffer 4                                         */
      __IOM uint32_t RX5TX5     : 1;            /* [5..5] Rx Buffer 5 or Tx Buffer 5                                         */
      __IOM uint32_t RX6TX6     : 1;            /* [6..6] Rx Buffer 6 or Tx Buffer 6                                         */
      __IOM uint32_t RX7TX7     : 1;            /* [7..7] Rx Buffer 7 or Tx Buffer 7                                         */
      __IOM uint32_t RX8TX8     : 1;            /* [8..8] Rx Buffer 8 or Tx Buffer 8                                         */
      __IOM uint32_t RX9TX9     : 1;            /* [9..9] Rx Buffer 9 or Tx Buffer 9                                         */
      __IM  uint32_t RESERVED0  : 1;
      __IM  uint32_t RXIDLE     : 1;            /* [11..11] Receiver Idle Line                                               */
      __IM  uint32_t RXBE       : 1;            /* [12..12] Receive Buffer Empty                                             */
      __IOM uint32_t FETXSC     : 1;            /* [13..13] Frame Error or Transmit Special Character                        */
      __IM  uint32_t PE         : 1;            /* [14..14] Parity Error                                                     */
      __IM  uint32_t NE         : 1;            /* [15..15] Noise Error                                                      */
      __IM  uint32_t RESERVED1  : 16;
    } bit;
  } DATA;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000020) LPUART Match Address Register                              */

    struct {
      __IOM uint32_t MADDR1     : 10;           /* [9..0] Match Address 1                                                    */
      __IM  uint32_t RESERVED0  : 6;
      __IOM uint32_t MADDR2     : 10;           /* [25..16] Match Address 2                                                  */
      __IM  uint32_t RESERVED1  : 6;
    } bit;
  } MADDR;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000024) LPUART Modem IrDA Register                                 */

