MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
      __IOM uint32_t TXCSEN     : 1;            /* [0..0] Transmitter Clear-to-Send Enable                                   */
      __IOM uint32_t TXRSEN     : 1;            /* [1..1] Transmitter Request-to-Send Enable                                 */
      __IOM uint32_t TXRSPCFG   : 1;            /* [2..2] Transmitter Request-to-Send Polarity Configure                     */
      __IOM uint32_t RXRSEN     : 1;            /* [3..3] Receiver Request-to-Send Enable                                    */
      __IOM uint32_t TXCSCFG    : 1;            /* [4..4] Transmit CTS Sample Configure                                      */
      __IOM uint32_t TXCSRCSEL  : 1;            /* [5..5] Transmit CTS Source Select                                         */
      __IM  uint32_t RESERVED0  : 2;
      __IOM uint32_t RXROCFG    : 2;            /* [9..8] Receive RTS Output Configure                                       */
      __IM  uint32_t RESERVED1  : 6;
      __IOM uint32_t TXNPCFG    : 2;            /* [17..16] Transmitter Narrow Pulse Configure                               */
      __IOM uint32_t IRMODEEN   : 1;            /* [18..18] Infrared Modulation/Demodulation Enable                          */
      __IM  uint32_t RESERVED2  : 13;
    } bit;
  } MIR;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000028) LPUART FIFO Register                                       */

    struct {
      __IM  uint32_t RXFBDCFG   : 3;            /* [2..0] Receive FIFO Buffer Depth Configure                                */
      __IOM uint32_t RXBFEN     : 1;            /* [3..3] Receive Buffer FIFO Enable                                         */
      __IM  uint32_t TXFBDCFG   : 3;            /* [6..4] Transmit FIFO Buffer Depth Configure                               */
      __IOM uint32_t TXBFEN     : 1;            /* [7..7] Transmit Buffer FIFO Enable                                        */
      __IOM uint32_t RXUFGINT   : 1;            /* [8..8] RX Buffer Underflow Flag Generate Interrupt                        */
      __IOM uint32_t TXOFGINT   : 1;            /* [9..9] TX Buffer Overflow Flag Generate Interrupt                         */
      __IOM uint32_t CFGRXIEEN  : 3;            /* [12..10] Configures when the Receiver is Idle Empty Enable                */
      __IM  uint32_t RESERVED0  : 1;
      __OM  uint32_t RXFBDFLU   : 1;            /* [14..14] Receive FIFO/Buffer Data Flush                                   */
      __OM  uint32_t TXFBDFLU   : 1;            /* [15..15] Transmit FIFO/Buffer Data Flush                                  */
      __IOM uint32_t RXBUFLG    : 1;            /* [16..16] Receiver Buffer Underflow Occured Flag                           */
      __IOM uint32_t TXBOFLG    : 1;            /* [17..17] Transmitter Buffer Overflow Occured Flag                         */
      __IM  uint32_t RESERVED1  : 4;
      __IM  uint32_t RXBE       : 1;            /* [22..22] Receive Buffer Empty                                             */
      __IM  uint32_t TXBE       : 1;            /* [23..23] Transmit Buffer Empty                                            */
      __IM  uint32_t RESERVED2  : 8;
    } bit;
  } FIFO;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000002C) LPUART Watermark Register                                  */

    struct {
      __IOM uint32_t TXWAT      : 2;            /* [1..0] Transmit Watermark                                                 */
      __IM  uint32_t RESERVED0  : 6;
      __IM  uint32_t TXFBUFCNT  : 3;            /* [10..8] Transmit FIFO/Buffer Counter                                      */
      __IM  uint32_t RESERVED1  : 5;
      __IOM uint32_t RXWAT      : 2;            /* [17..16] Receive Watermark                                                */
      __IM  uint32_t RESERVED2  : 6;
      __IM  uint32_t RXFBUFCNT  : 3;            /* [26..24] Receive FIFO/Buffer Counter                                      */
      __IM  uint32_t RESERVED3  : 5;
    } bit;
  } WMKR;
} LPUART_T;                                 /* Size = 48 (0x30)                                                              */



/* =========================================================================================================================== */
/* ================                                           COMP                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Analog Comparators (COMP)
  */

typedef struct {                                /* (@ 0x40073000) COMP Structure                                             */

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000000) COMP Control Register 0                                    */

    struct {
      __IOM uint32_t HBHLSEL    : 2;            /* [1..0] Hard Block Hysteresis Level Select                                 */
      __IOM uint32_t HBOLSEL    : 1;            /* [2..2] Hard Block Offset Level Select                                     */
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t FOSMPCNT   : 3;            /* [6..4] Filter Output Sample Count                                         */
      __IM  uint32_t RESERVED1  : 1;
      __IOM uint32_t ACEN       : 1;            /* [8..8] Analog Comparator Enable                                           */
      __IOM uint32_t COPCFG     : 1;            /* [9..9] Comparator Output Pin Configure                                    */
      __IOM uint32_t COCFG      : 1;            /* [10..10] Comparator Output Configure                                      */
      __IOM uint32_t INVEN      : 1;            /* [11..11] Invert Enable                                                    */
      __IOM uint32_t PMSEL      : 1;            /* [12..12] Power Mode Select                                                */
      __IM  uint32_t RESERVED2  : 1;
      __IOM uint32_t WINMEN     : 1;            /* [14..14] Windowing Mode Enable                                            */
      __IOM uint32_t SMPMEN     : 1;            /* [15..15] Sample Mode Enable                                               */
      __IOM uint32_t FSMPPCFG   : 8;            /* [23..16] Filter Sample Period Configure                                   */
      __IM  uint32_t ACO        : 1;            /* [24..24] Analog Comparator Output                                         */
      __IOM uint32_t ACFFLG     : 1;            /* [25..25] Analog Comparator Falling Flag                                   */
      __IOM uint32_t ACRFLG     : 1;            /* [26..26] Analog Comparator Rising Flag                                    */
      __IOM uint32_t ACFIEN     : 1;            /* [27..27] Analog Comparator Falling Interrupt Enable                       */
      __IOM uint32_t ACRIEN     : 1;            /* [28..28] Analog Comparator Rising Interrupt Enable                        */
      __IM  uint32_t RESERVED3  : 1;
      __IOM uint32_t DMAEN      : 1;            /* [30..30] DMA Enable                                                       */
      __IM  uint32_t RESERVED4  : 1;
    } bit;
  } CTRL0;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000004) COMP Control Register 1                                    */

