MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
      __IM  uint32_t RESERVED0  : 1;
      __IM  uint32_t LVDRSTSTS  : 1;            /* [1..1] Low Voltage Detection Reset Function Status                        */
      __IM  uint32_t CLKLRSTSTS : 1;            /* [2..2] Clock Loss Reset Function Status                                   */
      __IM  uint32_t LOCKLRSTSTS : 1;           /* [3..3] Lock Loss Reset Function Status                                    */
      __IM  uint32_t RESERVED1  : 1;
      __IM  uint32_t WDTRSTSTS  : 1;            /* [5..5] Watchdog Timer Reset Function Status                               */
      __IM  uint32_t ERSTSTS    : 1;            /* [6..6] External Pin Reset Function Status                                 */
      __IM  uint32_t PORRSTSTS  : 1;            /* [7..7] POR Reset Function Status                                          */
      __IM  uint32_t JTAGRSTSTS : 1;            /* [8..8] JTAG Reset Function Status                                         */
      __IM  uint32_t CLOCKRSTSTS : 1;           /* [9..9] Core Lockup Reset Function Status                                  */
      __IM  uint32_t SWRSTSTS   : 1;            /* [10..10] Software Reset Function Status                                   */
      __IM  uint32_t SRSTSTS    : 1;            /* [11..11] System Reset Function Status                                     */
      __IM  uint32_t RESERVED2  : 1;
      __IM  uint32_t STOPACKERSTSTS : 1;        /* [13..13] Stop Acknowledge Error Reset Function Status                     */
      __IM  uint32_t RESERVED3  : 18;
    } bit;
  } PARA;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000008) Reset Status Register                                      */

    struct {
      __IM  uint32_t RESERVED0  : 1;
      __IM  uint32_t LVDRSTFLG  : 1;            /* [1..1] Low Voltage Detection Reset Flag                                   */
      __IM  uint32_t CLKLRSTFLG : 1;            /* [2..2] Clock Loss Reset Flag                                              */
      __IM  uint32_t LOCKLRSTFLG : 1;           /* [3..3] Lock Loss Reset Flag                                               */
      __IM  uint32_t RESERVED1  : 1;
      __IM  uint32_t WDTTOFFLG  : 1;            /* [5..5] Watchdog Timer Timeout Flag                                        */
      __IM  uint32_t ERSTPFLG   : 1;            /* [6..6] External Reset Pin Flag                                            */
      __IM  uint32_t PORFLG     : 1;            /* [7..7] POR Flag                                                           */
      __IM  uint32_t JTAGRSTFLG : 1;            /* [8..8] JTAG Reset Flag                                                    */
      __IM  uint32_t CLOCKEFLG  : 1;            /* [9..9] Core Lockup Event Flag                                             */
      __IM  uint32_t SWSETFLG   : 1;            /* [10..10] Software Set Flag                                                */
      __IM  uint32_t SRSTREQFLG : 1;            /* [11..11] System Reset Request Flag                                        */
      __IM  uint32_t RESERVED2  : 1;
      __IM  uint32_t STOPACKEFLG : 1;           /* [13..13] Stop Acknowledge Error Flag                                      */
      __IM  uint32_t RESERVED3  : 18;
    } bit;
  } RSTFLG;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000000C) Reset Pin Control register                                 */

    struct {
      __IOM uint32_t RSTPFSEL   : 2;            /* [1..0] Reset Pin Filter Select in Run and Wait Modes                      */
      __IOM uint32_t RSTPFEN    : 1;            /* [2..2] Reset Pin Filter Enable in Stop Mode                               */
      __IM  uint32_t RESERVED0  : 5;
      __IOM uint32_t RSTPBCLKWSEL : 5;          /* [12..8] Reset Pin Bus Clock Filter Width Select                           */
      __IM  uint32_t RESERVED1  : 19;
    } bit;
  } RSTPCTRL;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000018) Sticky Reset Flag Register                                 */

    struct {
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t LVDRSTRCD  : 1;            /* [1..1] LVD Reset Record                                                   */
      __IOM uint32_t ECLKLRSTRCD : 1;           /* [2..2] Clock Loss Reset Record                                            */
      __IOM uint32_t LOCKLRSTRCD : 1;           /* [3..3] Lock Loss Reset Record                                             */
      __IM  uint32_t RESERVED1  : 1;
      __IOM uint32_t WDTRSTRCD  : 1;            /* [5..5] Watchdog Timer Reset Record                                        */
      __IOM uint32_t EPRSTRCD   : 1;            /* [6..6] External Pin Reset Record                                          */
      __IOM uint32_t PORRCD     : 1;            /* [7..7] Power-On Reset Record                                              */
      __IOM uint32_t JTAGRSTRCD : 1;            /* [8..8] JTAG Reset Record                                                  */
      __IOM uint32_t CLOCKRCD   : 1;            /* [9..9] Core Lockup Reset Record                                           */
      __IOM uint32_t SWRSTRCD   : 1;            /* [10..10] Software Reset Record                                            */
      __IOM uint32_t SRSTREGRCD : 1;            /* [11..11] System Reset Request Record                                      */
      __IM  uint32_t RESERVED2  : 1;
      __IOM uint32_t STOPACKERSTRCD : 1;        /* [13..13] Stop Acknowledge Error Reset Record                              */
      __IM  uint32_t RESERVED3  : 18;
    } bit;
  } SRSTFLG;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000001C) Reset Interrupt Enable Register                            */

    struct {
      __IOM uint32_t RSTDTIMCFG : 2;            /* [1..0] Reset Delay Time Configure                                         */
      __IOM uint32_t CLKLIEN    : 1;            /* [2..2] Clock Loss Interrupt Enable                                        */
      __IOM uint32_t LOCKLIEN   : 1;            /* [3..3] Lock Loss Interrupt Enable                                         */
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t WDTIEN     : 1;            /* [5..5] Watchdog Timer Interrupt Enable                                    */
      __IOM uint32_t EXTPIEN    : 1;            /* [6..6] External Reset Pin Interrupt Enable                                */
      __IOM uint32_t GIEN       : 1;            /* [7..7] Global Interrupt Enable                                            */
      __IOM uint32_t JTAGIEN    : 1;            /* [8..8] JTAG Interrupt Enable                                              */
      __IOM uint32_t CLOCKIEN   : 1;            /* [9..9] Core Lockup Interrupt Enable                                       */
      __IOM uint32_t SWIEN      : 1;            /* [10..10] Software Interrupt Enable                                        */
      __IOM uint32_t SRSTREQEN  : 1;            /* [11..11] System Reset Request Enable                                      */
      __IM  uint32_t RESERVED1  : 1;
      __IOM uint32_t SACKEIEN   : 1;            /* [13..13] Stop Acknowledge Error Interrupt Enable                          */
      __IM  uint32_t RESERVED2  : 18;
    } bit;
  } RSTIEN;
} RMU_T;                                     /* Size = 32 (0x20)                                                          */



/* =========================================================================================================================== */
/* ================                                           GPIO                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief General Purpose Input/Output (GPIO)
  */

typedef struct {                                /*  GPIO Structure  (@ 0x400FF000)GPIOA (@ 0x400FF040)GPIOB (@ 0x400FF080)GPIOC (@ 0x400FF0C0)GPIOD (@ 0x400FF100)GPIOE */

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000000) Port Logic Level Output Register                           */

