MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
      __IOM uint32_t IACCVIOL   : 1;            /* [0..0] Instruction access violation flag                                  */
      __IOM uint32_t DACCVIOL   : 1;            /* [1..1] Data access violation flag                                         */
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t MUNSTKERR  : 1;            /* [3..3] MemManage fault on unstacking for a return from exception          */
      __IOM uint32_t MSTKERR    : 1;            /* [4..4] MemManage fault on stacking for exception entry                    */
      __IOM uint32_t MLSPERR    : 1;            /* [5..5] Indicates whether MemManage fault occured during floating-point
                                                     lazy state preservation                                                   */
      __IM  uint32_t RESERVED1  : 1;
      __IOM uint32_t MMARVALID  : 1;            /* [7..7] MemManage Fault Address Register (MMFAR) valid flag                */
      __IOM uint32_t IBUSERR    : 1;            /* [8..8] Instruction bus error                                              */
      __IOM uint32_t PRECISERR  : 1;            /* [9..9] Precise data bus error                                             */
      __IOM uint32_t IMPRECISERR : 1;           /* [10..10] Imprecise data bus error                                         */
      __IOM uint32_t UNSTKERR   : 1;            /* [11..11] BusFault on unstacking for a return from exception               */
      __IOM uint32_t STKERR     : 1;            /* [12..12] BusFault on stacking for exception entry                         */
      __IOM uint32_t LSPERR     : 1;            /* [13..13] Indicates whether bus fault fault occured during floating-point
                                                     lazy state preservation                                                   */
      __IM  uint32_t RESERVED2  : 1;
      __IOM uint32_t BFARVALID  : 1;            /* [15..15] BusFault Address Register (BFAR) valid flag                      */
      __IOM uint32_t UNDEFINSTR : 1;            /* [16..16] Undefined instruction UsageFault                                 */
      __IOM uint32_t INVSTATE   : 1;            /* [17..17] Invalid state UsageFault                                         */
      __IOM uint32_t INVPC      : 1;            /* [18..18] Invalid PC load UsageFault, caused by an invalid PC
                                                     load by EXC_RETURN                                                        */
      __IOM uint32_t NOCP       : 1;            /* [19..19] No coprocessor UsageFault. The processor does not support
                                                     coprocessor instructions                                                  */
      __IM  uint32_t RESERVED3  : 4;
      __IOM uint32_t UNALIGNED  : 1;            /* [24..24] Unaligned access UsageFault                                      */
      __IOM uint32_t DIVBYZERO  : 1;            /* [25..25] Divide by zero UsageFault                                        */
      __IM  uint32_t RESERVED4  : 6;
    } bit;
  } CFSR;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000D2C) HardFault Status register                                  */

    struct {
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t VECTTBL    : 1;            /* [1..1] Indicates a BusFault on a vector table read during exception
                                                     processing                                                              */
      __IM  uint32_t RESERVED1  : 28;
      __IOM uint32_t FORCED     : 1;            /* [30..30] Indicates a forced hard fault, generated by escalation
                                                     of a fault with configurable priority that cannot be handles,
                                                     either because of priority or because it is disabled                    */
      __IOM uint32_t DEBUGEVT   : 1;            /* [31..31] Reserved for Debug use. When writing to the register
                                                     you must write 0 to this bit, otherwise behavior is Unpredictable.      */
    } bit;
  } HFSR;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000D30) Debug Fault Status Register                                */

    struct {
      __IOM uint32_t HALTED     : 1;            /* [0..0] HALTED                                                             */
      __IOM uint32_t BKPT       : 1;            /* [1..1] BKPT                                                               */
      __IOM uint32_t DWTTRAP    : 1;            /* [2..2] DWTTRAP                                                            */
      __IOM uint32_t VCATCH     : 1;            /* [3..3] VCATCH                                                             */
      __IOM uint32_t EXTERNAL   : 1;            /* [4..4] EXTERNAL                                                           */
      __IM  uint32_t RESERVED0  : 27;
    } bit;
  } DFSR;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000D34) MemManage Address Register                                 */

    struct {
      __IOM uint32_t ADDRESS    : 32;           /* [31..0] Address of MemManage fault location                               */
    } bit;
  } MMFAR;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000D38) BusFault Address Register                                  */

    struct {
      __IOM uint32_t ADDRESS    : 32;           /* [31..0] Address of the BusFault location                                  */
    } bit;
  } BFAR;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000D3C) Auxiliary Fault Status Register                            */

    struct {
      __IOM uint32_t AUXFAULT   : 32;           /* [31..0] Latched version of the AUXFAULT inputs                            */
    } bit;
  } AFSR;
  __IM  uint32_t  RESERVED2[18];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000D88) Coprocessor Access Control Register                        */

