MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
      __IM  uint32_t RESERVED0  : 20;
      __IOM uint32_t CP10       : 2;            /* [21..20] Access privileges for coprocessor 10.                            */
      __IOM uint32_t CP11       : 2;            /* [23..22] Access privileges for coprocessor 11.                            */
      __IM  uint32_t RESERVED1  : 8;
    } bit;
  } CPACR;
  __IM  uint32_t  RESERVED3[106];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000F34) Floating-point Context Control Register                    */

    struct {
      __IOM uint32_t LSPACT     : 1;            /* [0..0] Lazy state preservation.                                           */
      __IOM uint32_t USER       : 1;            /* [1..1] Privilege level when the floating-point stack frame was
                                                     allocated.                                                              */
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t THREAD     : 1;            /* [3..3] Mode when the floating-point stack frame was allocated.            */
      __IOM uint32_t HFRDY      : 1;            /* [4..4] Permission to set the HardFault handler to the pending
                                                     state when the floating-point stack frame was allocated.                */
      __IOM uint32_t MMRDY      : 1;            /* [5..5] Permission to set the MemManage handler to the pending
                                                     state when the floating-point stack frame was allocated.                */
      __IOM uint32_t BFRDY      : 1;            /* [6..6] Permission to set the BusFault handler to the pending
                                                     state when the floating-point stack frame was allocated.                */
      __IM  uint32_t RESERVED1  : 1;
      __IOM uint32_t MONRDY     : 1;            /* [8..8] Permission to set the MON_PEND when the floating-point
                                                     stack frame was allocated.                                              */
      __IM  uint32_t RESERVED2  : 21;
      __IOM uint32_t LSPEN      : 1;            /* [30..30] Lazy state preservation for floating-point context.              */
      __IOM uint32_t ASPEN      : 1;            /* [31..31] Enables CONTROL2 setting on execution of a floating-point
                                                     instruction. This results in automatic hardware state preservation
                                                     and restoration, for floating-point context, on exception
                                                     entry and exit.                                                         */
    } bit;
  } FPCCR;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000F38) Floating-point Context Address Register                    */

    struct {
      __IM  uint32_t RESERVED0  : 3;
      __IOM uint32_t ADDRESS    : 29;           /* [31..3] The location of the unpopulated floating-point register
                                                     space allocated on an exception stack frame.                            */
    } bit;
  } FPCAR;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000F3C) Floating-point Default Status Control Register             */

    struct {
      __IM  uint32_t RESERVED0  : 22;
      __IOM uint32_t RMode      : 2;            /* [23..22] Default value for FPSCR.RMode (Rounding Mode control
                                                     field).                                                                 */
      __IOM uint32_t FZ         : 1;            /* [24..24] Default value for FPSCR.FZ (Flush-to-zero mode control
                                                     bit).                                                                   */
      __IOM uint32_t DN         : 1;            /* [25..25] Default value for FPSCR.DN (Default NaN mode control
                                                     bit).                                                                   */
      __IOM uint32_t AHP        : 1;            /* [26..26] Default value for FPSCR.AHP (Alternative half-precision
                                                     control bit).                                                           */
      __IM  uint32_t RESERVED1  : 5;
    } bit;
  } FPDSCR;
} APM32_SCB_T;                                 /* Size = 3904 (0xf40)                                                          */



/* =========================================================================================================================== */
/* ================                                        APM32_SysTick                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief System timer (APM32_SysTick)
  */

typedef struct {                                /* (@ 0xE000E010) APM32_SysTick Structure                                      */

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000000) SysTick Control and Status Register                        */

    struct {
      __IOM uint32_t ENABLE     : 1;            /* [0..0] Enables the counter                                                */
      __IOM uint32_t TICKINT    : 1;            /* [1..1] Enables SysTick exception request                                  */
      __IOM uint32_t CLKSOURCE  : 1;            /* [2..2] Indicates the clock source                                         */
      __IM  uint32_t RESERVED0  : 13;
      __IOM uint32_t COUNTFLAG  : 1;            /* [16..16] Returns 1 if timer counted to 0 since last time this
                                                     was read                                                                */
      __IM  uint32_t RESERVED1  : 15;
    } bit;
  } CSR;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000004) SysTick Reload Value Register                              */

