MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
      __IOM uint32_t RELOAD     : 24;           /* [23..0] Value to load into the SysTick Current Value Register
                                                     when the counter reaches 0                                              */
      __IM  uint32_t RESERVED0  : 8;
    } bit;
  } RVR;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000008) SysTick Current Value Register                             */

    struct {
      __IOM uint32_t CURRENT    : 24;           /* [23..0] Current value at the time the register is accessed                */
      __IM  uint32_t RESERVED0  : 8;
    } bit;
  } CVR;

  union {
    __IM  uint32_t reg;                         /* (@ 0x0000000C) SysTick Calibration Value Register                         */

    struct {
      __IM  uint32_t TENMS      : 24;           /* [23..0] Reload value to use for 10ms timing                               */
      __IM  uint32_t RESERVED0  : 6;
      __IM  uint32_t SKEW       : 1;            /* [30..30] Indicates whether the TENMS value is exact                       */
      __IM  uint32_t NOREF      : 1;            /* [31..31] Indicates whether the device provides a reference clock
                                                     to the processor                                                        */
    } bit;
  } CALIB;
} APM32_SysTick_T;                             /* Size = 16 (0x10)                                                             */



/* =========================================================================================================================== */
/* ================                                         APM32_NVIC                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Nested Vectored Interrupt Controller (APM32_NVIC)
  */

typedef struct {                                /* (@ 0xE000E100) APM32_NVIC Structure                                         */

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000000) Interrupt Set Enable Register n                            */

    struct {
      __IOM uint32_t SETENA     : 32;           /* [31..0] Interrupt set enable bits                                         */
    } bit;
  } NVICISER[8];

  __IM  uint32_t  RESERVED[24];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000080) Interrupt Clear Enable Register n                          */

    struct {
      __IOM uint32_t CLRENA     : 32;           /* [31..0] Interrupt clear-enable bits                                       */
    } bit;
  } NVICICER[8];

  __IM  uint32_t  RESERVED1[24];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000100) Interrupt Set Pending Register n                           */

    struct {
      __IOM uint32_t SETPEND    : 32;           /* [31..0] Interrupt set-pending bits                                        */
    } bit;
  } NVICISPR[8];

  __IM  uint32_t  RESERVED2[24];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000180) Interrupt Clear Pending Register n                         */

    struct {
      __IOM uint32_t CLRPEND    : 32;           /* [31..0] Interrupt clear-pending bits                                      */
    } bit;
  } NVICICPR[8];

  __IM  uint32_t  RESERVED3[24];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000200) Interrupt Active bit Register n                            */

    struct {
      __IOM uint32_t ACTIVE     : 32;           /* [31..0] Interrupt active flags                                            */
    } bit;
  } NVICIABR[8];

  __IM  uint32_t  RESERVED4[56];

  union {
    __IOM uint8_t reg;                          /* (@ 0x00000300) Interrupt Priority Register n                              */

    struct {
      __IOM uint8_t PRI        : 8;            /* [7..0] Priority of interrupt 0                                             */
    } bit;
  } NVICIP[240];

  __IM  uint32_t  RESERVED5[644];

  union {
    __OM  uint32_t reg;                         /* (@ 0x00000E00) Software Trigger Interrupt Register                        */

    struct {
      __OM  uint32_t INTID      : 9;            /* [8..0] Interrupt ID of the interrupt to trigger, in the range
                                                     0-239. For example, a value of 0x03 specifies interrupt
                                                     IRQ3.                                                                   */
      __IM  uint32_t RESERVED0  : 23;
    } bit;
  } NVICSTIR;
} APM32_NVIC_T;                                /* Size = 3588 (0xe04)                                                          */



/* =========================================================================================================================== */
/* ================                                            MC                                             ================ */
/* =========================================================================================================================== */


/**
  * @brief Core Platform Miscellaneous Control Module (MC)
  */

typedef struct {                                /* (@ 0xE0080000) MC Structure                                               */
  __IM  uint32_t  RESERVED[2];

  union {
    __IM  uint16_t reg;                         /* (@ 0x00000008) XBARSW Slave Input Port Connection Status                  */

    struct {
      __IM  uint16_t SINCFLG    : 8;            /* [7..0] XBARSW Slave Input Port Connection Flag                            */
            uint16_t            : 8;
    } bit;
  } SINCSTS;

  union {
    __IM  uint16_t reg;                         /* (@ 0x0000000A) XBARSW Master Input Port Connection Status                 */

    struct {
      __IM  uint16_t MINCFLG    : 8;            /* [7..0] XBARSW Master Input Port Connection Flag                           */
            uint16_t            : 8;
    } bit;
  } MINCSTS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000000C) Core Platform Control Register                             */

