MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
      __IM  uint32_t HMSTS      : 2;            /* [1..0] XBARSW Halt Machine Status                                         */
      __IM  uint32_t RXHREQFLG  : 1;            /* [2..2] XBARSW Receive Halt Request Flag                                   */
      __IM  uint32_t HSTS       : 1;            /* [3..3] XBARSW Halt Status                                                 */
      __IM  uint32_t FMCPGISTS  : 1;            /* [4..4] Flash Memory Controller Program Idle Status                        */
      __IM  uint32_t RESERVED0  : 1;
      __IM  uint32_t ACISTS     : 1;            /* [6..6] AC Idle Status                                                     */
      __IM  uint32_t RESERVED1  : 2;
      __IOM uint32_t CASEL      : 1;            /* [9..9] Crossbar Arbitration Select                                        */
      __IM  uint32_t RESERVED2  : 14;
      __IOM uint32_t SHAPCFG    : 2;            /* [25..24] SRAM_H Arbitration Priority Configure                            */
      __IOM uint32_t SHWPRO     : 1;            /* [26..26] SRAM_H Write Protect                                             */
      __IM  uint32_t RESERVED3  : 1;
      __IOM uint32_t SLAPCFG    : 2;            /* [29..28] SRAM_L Arbitration Priority Configure                            */
      __IOM uint32_t SLWPRO     : 1;            /* [30..30] SRAM_L Write Protect                                             */
      __IM  uint32_t RESERVED4  : 1;
    } bit;
  } CPCTRL;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000010) FPU Interrupt Control and Status Register                  */

    struct {
      __IM  uint32_t RESERVED0  : 8;
      __IM  uint32_t INVALIDIFLG : 1;           /* [8..8] FPU Invalid Operation Interrupt Flag                               */
      __IM  uint32_t ZEROIFLG   : 1;            /* [9..9] FPU Divide-by-Zero Interrupt Flag                                  */
      __IM  uint32_t OVRIFLG    : 1;            /* [10..10] FPU Overflow Interrupt Flag                                      */
      __IM  uint32_t UDRIFLG    : 1;            /* [11..11] FPU Underflow Interrupt Flag                                     */
      __IM  uint32_t INEXACTIFLG : 1;           /* [12..12] FPU Inexact Interrupt Flag                                       */
      __IM  uint32_t RESERVED1  : 2;
      __IM  uint32_t INDIFLG    : 1;            /* [15..15] FPU Input Denormal Interrupt Flag                                */
      __IM  uint32_t RESERVED2  : 8;
      __IOM uint32_t INVALIDEN  : 1;            /* [24..24] FPU Invalid Operation Enable                                     */
      __IOM uint32_t ZEROEN     : 1;            /* [25..25] FPU Divide-by-Zero Enable                                        */
      __IOM uint32_t OVRIEN     : 1;            /* [26..26] FPU Overflow Enable                                              */
      __IOM uint32_t UDRIEN     : 1;            /* [27..27] FPU Underflow Enable                                             */
      __IOM uint32_t INEXACTIEN : 1;            /* [28..28] FPU Inexact Enable                                               */
      __IM  uint32_t RESERVED3  : 2;
      __IOM uint32_t INDIEN     : 1;            /* [31..31] FPU Input Denormal Enable                                        */
    } bit;
  } FPU_INTCSTS;
  __IM  uint32_t  RESERVED1[7];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000030) Process ID Register                                        */

    struct {
      __IOM uint32_t PID        : 8;            /* [7..0] M0_PID and M1_PID Values in the MPU Drive                          */
      __IM  uint32_t RESERVED0  : 24;
    } bit;
  } PID;
  __IM  uint32_t  RESERVED2[3];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000040) Compute Operation Control Register                         */

    struct {
      __IOM uint32_t COREQ      : 1;            /* [0..0] Compute Operation Request                                          */
      __IM  uint32_t COACK      : 1;            /* [1..1] Compute Operation Acknowledge                                      */
      __IOM uint32_t COWBI      : 1;            /* [2..2] Compute Operation Wakeup By Interrupt                              */
      __IM  uint32_t RESERVED0  : 29;
    } bit;
  } COCTRL;
  __IM  uint32_t  RESERVED3[239];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000400) Local Memory Descriptor Register0                          */

    struct {
      __IOM uint32_t ECCCTRL    : 4;            /* [3..0] TCM ECC Control                                                    */
      __IM  uint32_t RESERVED0  : 9;
      __IM  uint32_t TSEL       : 3;            /* [15..13] Local Memory Type Select                                         */
      __IOM uint32_t LOCK       : 1;            /* [16..16] LOCK                                                             */
      __IM  uint32_t DPWSEL     : 3;            /* [19..17] LMC Data Path Width Select                                       */
      __IM  uint32_t CWCFG      : 4;            /* [23..20] Level 1 Cache Ways Configure                                     */
      __IM  uint32_t SIZE       : 4;            /* [27..24] LMC Size                                                         */
      __IM  uint32_t SIZEH      : 1;            /* [28..28] LMC Size Hole                                                    */
      __IM  uint32_t RESERVED1  : 2;
      __IM  uint32_t VALID      : 1;            /* [31..31] Local Memory Valid                                               */
    } bit;
  } LMDES0;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000404) Local Memory Descriptor Register1                          */

    struct {
      __IOM uint32_t ECCCTRL    : 4;            /* [3..0] TCM ECC Control                                                    */
      __IM  uint32_t RESERVED0  : 9;
      __IM  uint32_t TSEL       : 3;            /* [15..13] Local Memory Type Select                                         */
      __IOM uint32_t LOCK       : 1;            /* [16..16] LOCK                                                             */
      __IM  uint32_t DPWSEL     : 3;            /* [19..17] LMC Data Path Width Select                                       */
      __IM  uint32_t CWCFG      : 4;            /* [23..20] Level 1 Cache Ways Configure                                     */
      __IM  uint32_t SIZE       : 4;            /* [27..24] LMC Size                                                         */
      __IM  uint32_t SIZEH      : 1;            /* [28..28] LMC Size Hole                                                    */
      __IM  uint32_t RESERVED1  : 2;
      __IM  uint32_t VALID      : 1;            /* [31..31] Local Memory Valid                                               */
    } bit;
  } LMDES1;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000408) Local Memory Descriptor Register2                          */

