MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
      __IM  uint32_t RESERVED0  : 4;
      __IOM uint32_t CPFCTRL    : 4;            /* [7..4] Cache Parity Functions Control                                     */
      __IM  uint32_t RESERVED1  : 5;
      __IM  uint32_t TSEL       : 3;            /* [15..13] Local Memory Type Select                                         */
      __IOM uint32_t LOCK       : 1;            /* [16..16] LOCK                                                             */
      __IM  uint32_t DPWSEL     : 3;            /* [19..17] LMC Data Path Width Select                                       */
      __IM  uint32_t CWCFG      : 4;            /* [23..20] Level 1 Cache Ways Configure                                     */
      __IM  uint32_t SIZE       : 4;            /* [27..24] LMC Size                                                         */
      __IM  uint32_t SIZEH      : 1;            /* [28..28] LMC Size Hole                                                    */
      __IM  uint32_t RESERVED2  : 2;
      __IM  uint32_t VALID      : 1;            /* [31..31] Local Memory Valid                                               */
    } bit;
  } LMDES2;
  __IM  uint32_t  RESERVED4[29];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000480) LMC Parity and ECC Control Register                        */

    struct {
      __IOM uint32_t NCREN      : 1;            /* [0..0] RAM ECC Noncorrectable Reporting Enable                            */
      __IM  uint32_t RESERVED0  : 7;
      __IOM uint32_t R1BREN     : 1;            /* [8..8] RAM ECC 1 Bit Reporting Enable                                     */
      __IM  uint32_t RESERVED1  : 11;
      __IOM uint32_t CPREN      : 1;            /* [20..20] Cache Parity Reporting Enable                                    */
      __IM  uint32_t RESERVED2  : 11;
    } bit;
  } LMPECTRL;
  __IM  uint32_t  RESERVED5;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000488) LMC Parity and ECC Interrupt Register                      */

    struct {
      __IOM uint32_t NCERRFLG   : 8;            /* [7..0] ECC Noncorrectable Error Flag                                      */
      __IOM uint32_t E1BERRFLG  : 8;            /* [15..8] ECC 1-bit Error Flag                                              */
      __IOM uint32_t CPERR      : 8;            /* [23..16] Cache Parity Error                                               */
      __IM  uint32_t PEERRL     : 5;            /* [28..24] Parity or ECC Error Location                                     */
      __IM  uint32_t RESERVED0  : 2;
      __IM  uint32_t VALID      : 1;            /* [31..31] Valid                                                            */
    } bit;
  } LMPEINT;
  __IM  uint32_t  RESERVED6;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000490) LMC Fault Address Register                                 */

    struct {
      __IM  uint32_t EFADDR     : 32;           /* [31..0] ECC Fault Address                                                 */
    } bit;
  } LMFADDR;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000494) LMC Fault Attribute Register                               */

    struct {
      __IM  uint32_t PEFPRO     : 4;            /* [3..0] Parity/ECC Fault Master Size                                        */
      __IM  uint32_t PEFMSIZE   : 3;            /* [6..4] Parity/ECC Fault Protection                                        */
      __IM  uint32_t PEFW       : 1;            /* [7..7] Parity/ECC Fault Write                                             */
      __IM  uint32_t PEFMNUM    : 8;            /* [15..8] Parity/ECC Fault Master Number                                    */
      __IM  uint32_t RESERVED0  : 15;
      __IM  uint32_t OVR        : 1;            /* [31..31] Overrun                                                          */
    } bit;
  } LMFAT;
  __IM  uint32_t  RESERVED7[2];

  union {
    __IM  uint32_t reg;                         /* (@ 0x000004A0) LMC Fault Data High Register                               */

    struct {
      __IM  uint32_t PEFH       : 32;           /* [31..0] Parity/ ECC Fault Data High                                       */
    } bit;
  } LMFDATAH;

  union {
    __IM  uint32_t reg;                         /* (@ 0x000004A4) LMC Fault Data Low Register                                */

    struct {
      __IM  uint32_t PEFL       : 32;           /* [31..0] Parity/ ECC Fault Data Low                                        */
    } bit;
  } LMFDATAL;
} MC_T;                                      /* Size = 1192 (0x4a8)                                                       */



/* =========================================================================================================================== */
/* ================                                            LMC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Local Memory Controller (LMC)
  */

typedef struct {                                /* (@ 0xE0082000) LMC Structure                                              */

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000000) Cache Control Register                                     */

    struct {
      __IOM uint32_t CEN        : 1;            /* [0..0] Cache Enable                                                       */
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t FWCS       : 1;            /* [2..2] Force Write to Cacheable Space                                     */
      __IOM uint32_t FCHA       : 1;            /* [3..3] Force Cache Hit Allocation                                         */
      __IM  uint32_t RESERVED1  : 20;
      __IOM uint32_t IW0        : 1;            /* [24..24] Invalidate Way 0                                                 */
      __IOM uint32_t PW0        : 1;            /* [25..25] Push Way 0                                                       */
      __IOM uint32_t IW1        : 1;            /* [26..26] Invalidate Way 1                                                 */
      __IOM uint32_t PW1        : 1;            /* [27..27] Push Way 1                                                       */
      __IM  uint32_t RESERVED2  : 3;
      __IOM uint32_t ICCMD      : 1;            /* [31..31] Initiate Cache Command                                           */
    } bit;
  } CCTRL;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000004) Cache Line Control Register                                */

