MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
    struct {
      __IOM uint32_t ICLCMD     : 1;            /* [0..0] Initiate Cache Line Command                                        */
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t CADDR      : 12;           /* [13..2] Cache Address                                                     */
      __IOM uint32_t LCMDWSEL   : 1;            /* [14..14] Line Command Way Select                                          */
      __IM  uint32_t RESERVED1  : 1;
      __IOM uint32_t TAG_DATASEL : 1;           /* [16..16] Tag/Data Select                                                  */
      __IM  uint32_t RESERVED2  : 3;
      __IOM uint32_t LCMDVISTS  : 1;            /* [20..20] Line Command Valid Bit Initial State                             */
      __IOM uint32_t LCMDMISTS  : 1;            /* [21..21] Line Command Modified Bit Initial State                          */
      __IOM uint32_t LCWSTS     : 1;            /* [22..22] Line Command Way Statue                                          */
      __IM  uint32_t RESERVED3  : 1;
      __IOM uint32_t LCMDCFG    : 2;            /* [25..24] Line Command Configure                                           */
      __IOM uint32_t LADDRSEL   : 1;            /* [26..26] Line Address Select                                              */
      __IOM uint32_t LACCTSEL   : 1;            /* [27..27] Line Access Type Select                                          */
      __IM  uint32_t RESERVED4  : 4;
    } bit;
  } CLCTRL;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000008) Cache Search Address Register                              */

    struct {
      __IOM uint32_t CLCMDI     : 1;            /* [0..0] Cache Line Command Initiate                                        */
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t PHYADDR    : 30;           /* [31..2] Physical Address                                                  */
    } bit;
  } CSADDR;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000000C) Cache Data Register                                        */

    struct {
      __IOM uint32_t CDATA      : 32;           /* [31..0] Cache Data                                                        */
    } bit;
  } CDATA;
  __IM  uint32_t  RESERVED[4];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000020) Region Cache Mode Configure Register                       */

    struct {
      __IOM uint32_t CMCFGR15   : 2;            /* [1..0] Region 0-15 mode                                                   */
      __IOM uint32_t CMCFGR14   : 2;            /* [3..2] Region 0-15 mode                                                   */
      __IOM uint32_t CMCFGR13   : 2;            /* [5..4] Region 0-15 mode                                                   */
      __IOM uint32_t CMCFGR12   : 2;            /* [7..6] Region 0-15 mode                                                   */
      __IOM uint32_t CMCFGR11   : 2;            /* [9..8] Region 0-15 mode                                                   */
      __IOM uint32_t CMCFGR10   : 2;            /* [11..10] Region 0-15 mode                                                 */
      __IOM uint32_t CMCFGR9    : 2;            /* [13..12] Region 0-15 mode                                                 */
      __IOM uint32_t CMCFGR8    : 2;            /* [15..14] Region 0-15 mode                                                 */
      __IOM uint32_t CMCFGR7    : 2;            /* [17..16] Region 0-15 mode                                                 */
      __IOM uint32_t CMCFGR6    : 2;            /* [19..18] Region 0-15 mode                                                 */
      __IOM uint32_t CMCFGR5    : 2;            /* [21..20] Region 0-15 mode                                                 */
      __IOM uint32_t CMCFGR4    : 2;            /* [23..22] Region 0-15 mode                                                 */
      __IOM uint32_t CMCFGR3    : 2;            /* [25..24] Region 0-15 mode                                                 */
      __IOM uint32_t CMCFGR2    : 2;            /* [27..26] Region 0-15 mode                                                 */
      __IOM uint32_t CMCFGR1    : 2;            /* [29..28] Region 0-15 mode                                                 */
      __IOM uint32_t CMCFGR0    : 2;            /* [31..30] Region 0-15 mode                                                 */
    } bit;
  } RCMCFG;
} LMC_T;                                     /* Size = 36 (0x24)                                                             */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define CSE_PRAM_BASE               0x14001000UL
#define AC_BASE                     0x40000000UL
#define MSC_BASE                    0x40001000UL
#define DMA_BASE                    0x40008000UL
#define MPU_BASE                    0x4000D000UL
#define EREP_BASE                   0x40018000UL
#define EINJ_BASE                   0x40019000UL
#define FLASH_BASE                  0x40020000UL
#define DMACHM_BASE                 0x40021000UL
#define CAN0_BASE               0x40024000UL
#define CAN1_BASE               0x40025000UL
#define CAN2_BASE               0x4002B000UL
#define CFGTMR0_BASE                  0x40038000UL
#define CFGTMR1_BASE                  0x40039000UL
#define CFGTMR2_BASE                  0x4003A000UL
#define CFGTMR3_BASE                  0x40026000UL
#define CFGTMR4_BASE                  0x4006E000UL
#define CFGTMR5_BASE                  0x4006F000UL
#define ADC0_BASE                   0x4003B000UL
#define ADC1_BASE                   0x40027000UL
#define LPSPI0_BASE                 0x4002C000UL
#define LPSPI1_BASE                 0x4002D000UL
#define LPSPI2_BASE                 0x4002E000UL
#define PDU0_BASE                   0x40036000UL
#define PDU1_BASE                   0x40031000UL
#define CRC_BASE                    0x40032000UL
#define LPITMR_BASE                 0x40037000UL
#define RTC_BASE                    0x4003D000UL
#define LPTMR_BASE                  0x40040000UL
#define SIM_BASE                    0x40048000UL
#define PMA_BASE                    0x40049000UL
#define PMB_BASE                    0x4004A000UL
#define PMC_BASE                    0x4004B000UL
#define PMD_BASE                    0x4004C000UL
#define PME_BASE                    0x4004D000UL
#define WDT_BASE                    0x40052000UL
#define CFGIO_BASE                0x4005A000UL
#define EWDT_BASE                   0x40061000UL
#define TMC_BASE                    0x40063000UL
#define SCG_BASE                    0x40064000UL
#define PCM_BASE                    0x40065000UL
#define LPI2C_BASE                  0x40066000UL
#define LPUART0_BASE                0x4006A000UL
#define LPUART1_BASE                0x4006B000UL
#define LPUART2_BASE                0x4006C000UL
#define COMP_BASE                   0x40073000UL
#define PMU_BASE                    0x4007D000UL
#define SYSMC_BASE                  0x4007E000UL
#define RMU_BASE                    0x4007F000UL
#define GPIOA_BASE                  0x400FF000UL
#define GPIOB_BASE                  0x400FF040UL
#define GPIOC_BASE                  0x400FF080UL
#define GPIOD_BASE                  0x400FF0C0UL
#define GPIOE_BASE                  0x400FF100UL
#define APM32_SCB_BASE                0xE000E000UL
#define APM32_SysTick_BASE            0xE000E010UL
#define APM32_NVIC_BASE               0xE000E100UL
#define MC_BASE                     0xE0080000UL
#define LMC_BASE                    0xE0082000UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

