MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/*                                                 AC PACCTRLA TPCFG0 [28..28]                                                 */
/* AC_PACCTRLA_TPCFG0*/
#define  AC_PACCTRLA_TPCFG0_0                        0U     /* 0 : Accesses from an untrusted master are allowed.               */
#define  AC_PACCTRLA_TPCFG0_1                        1U     /* 1 : Accesses from an untrusted master are not allowed.           */


/*                                                 AC PACCTRLA WPCFG0 [29..29]                                                 */
/* AC_PACCTRLA_WPCFG0 */
#define  AC_PACCTRLA_WPCFG0_0                        0U     /* 0 : This peripheral allows write accesses.                      */
#define  AC_PACCTRLA_WPCFG0_1                        1U     /* 1 : This peripheral is write protected.                         */


/*                                                 AC PACCTRLA SPCFG0 [30..30]                                                 */
/* AC_PACCTRLA_SPCFG0*/
#define  AC_PACCTRLA_SPCFG0_0                        0U     /* 0 : This peripheral does not require supervisor privilege level
                                                            for accesses.                                                      */
#define AC_PACCTRLA_SPCFG0_1                        1U     /* 1 : This peripheral requires supervisor privilege level for
                                                            accesses.                                                          */


/*                                                          PACCTRLB                                                           */
/*                                                  AC PACCTRLB TPCFG5 [8..8]                                                  */
/* AC_PACCTRLB_TPCFG5*/
#define  AC_PACCTRLB_TPCFG5_0                        0U     /* 0 : Accesses from an untrusted master are allowed.               */
#define  AC_PACCTRLB_TPCFG5_1                        1U     /* 1 : Accesses from an untrusted master are not allowed.          */


/*                                                  AC PACCTRLB WPCFG5 [9..9]                                                  */
/* AC_PACCTRLB_WPCFG5*/
#define  AC_PACCTRLB_WPCFG5_0                        0U     /* 0 : This peripheral allows write accesses.                      */
#define  AC_PACCTRLB_WPCFG5_1                        1U     /* 1 : This peripheral is write protected.                         */


/*                                                 AC PACCTRLB SPCFG5 [10..10]                                                 */
/* AC_PACCTRLB_SPCFG5  */
#define  AC_PACCTRLB_SPCFG5_0                        0U     /* 0 : This peripheral does not require supervisor privilege level
                                                    for accesses.       */
#define  AC_PACCTRLB_SPCFG5_1                        1U     /* 1 : This peripheral requires supervisor privilege level for
                                                     accesses.           */


/*                                                 AC PACCTRLB TPCFG1 [24..24]                                                 */
/* AC_PACCTRLB_TPCFG1  */
#define  AC_PACCTRLB_TPCFG1_0                        0U     /* 0 : Accesses from an untrusted master are allowed.                        */
#define  AC_PACCTRLB_TPCFG1_1                        1U     /* 1 : Accesses from an untrusted master are not allowed.                    */


/*                                                 AC PACCTRLB WPCFG1 [25..25]                                                 */
/* AC_PACCTRLB_WPCFG1  */
#define  AC_PACCTRLB_WPCFG1_0                        0U     /* 0 : This peripheral allows write accesses.                                */
#define  AC_PACCTRLB_WPCFG1_1                        1U     /* 1 : This peripheral is write protected.                                   */


/*                                                 AC PACCTRLB SPCFG1 [26..26]                                                 */
 /* AC_PACCTRLB_SPCFG1  */
#define  AC_PACCTRLB_SPCFG1_0                        0U     /* 0 : This peripheral does not require supervisor privilege level
                                                    for accesses.       */
#define  AC_PACCTRLB_SPCFG1_1                        1U     /* 1 : This peripheral requires supervisor privilege level for
                                                     accesses.           */


/*                                                 AC PACCTRLB TPCFG0 [28..28]                                                 */
/* AC_PACCTRLB_TPCFG0  */
#define  AC_PACCTRLB_TPCFG0_0                        0U     /* 0 : Accesses from an untrusted master are allowed.                        */
#define  AC_PACCTRLB_TPCFG0_1                        1U     /* 1 : Accesses from an untrusted master are not allowed.                    */


/*                                                 AC PACCTRLB WPCFG0 [29..29]                                                 */
/* AC_PACCTRLB_WPCFG0  */
#define  AC_PACCTRLB_WPCFG0_0                        0U     /* 0 : This peripheral allows write accesses.                                */
#define  AC_PACCTRLB_WPCFG0_1                        1U     /* 1 : This peripheral is write protected.                                   */


/*                                                 AC PACCTRLB SPCFG0 [30..30]                                                 */
/* AC_PACCTRLB_SPCFG0  */
#define  AC_PACCTRLB_SPCFG0_0                        0U     /* 0 : This peripheral does not require supervisor privilege level
                                                        for accesses.       */
#define  AC_PACCTRLB_SPCFG0_1                        1U     /* 1 : This peripheral requires supervisor privilege level for
                                                         accesses.           */


/*                                                          PACCTRLD     */
/*                                                 AC PACCTRLD TPCFG1 [24..24]                                                 */
 /* AC_PACCTRLD_TPCFG1  */
#define  AC_PACCTRLD_TPCFG1_0                   0U     /* 0 : Accesses from an untrusted master are allowed.                        */
#define  AC_PACCTRLD_TPCFG1_1                   1U     /* 1 : Accesses from an untrusted master are not allowed.                    */


/*                                                 AC PACCTRLD WPCFG1 [25..25]                                                 */
/* AC_PACCTRLD_WPCFG1  */
#define  AC_PACCTRLD_WPCFG1_0                   0U     /* 0 : This peripheral allows write accesses.                                */
#define  AC_PACCTRLD_WPCFG1_1                   1U     /* 1 : This peripheral is write protected.                                   */


/*                                                 AC PACCTRLD SPCFG1 [26..26]                                                 */
/* AC_PACCTRLD_SPCFG1  */
#define  AC_PACCTRLD_SPCFG1_0                   0U     /* 0 : This peripheral does not require supervisor privilege level
                                                        for accesses.       */
#define  AC_PACCTRLD_SPCFG1_1                   1U     /* 1 : This peripheral requires supervisor privilege level for
                                                         accesses.           */


/*                                                 AC PACCTRLD TPCFG0 [28..28]                                                 */
/* AC_PACCTRLD_TPCFG0  */
#define  AC_PACCTRLD_TPCFG0_0                   0U     /* 0 : Accesses from an untrusted master are allowed.                        */
#define  AC_PACCTRLD_TPCFG0_1                   1U     /* 1 : Accesses from an untrusted master are not allowed.                    */


/*                                                 AC PACCTRLD WPCFG0 [29..29]                                                 */
/* AC_PACCTRLD_WPCFG0  */
#define  AC_PACCTRLD_WPCFG0_0                   0U     /* 0 : This peripheral allows write accesses.                                */
#define  AC_PACCTRLD_WPCFG0_1                   1U     /* 1 : This peripheral is write protected.                                   */


