MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/*                                                 AC PACCTRLD SPCFG0 [30..30]                                                 */
/* AC_PACCTRLD_SPCFG0  */
 #define AC_PACCTRLD_SPCFG0_0                   0U     /* 0 : This peripheral does not require supervisor privilege level
                                                       for accesses.       */
 #define AC_PACCTRLD_SPCFG0_1                   1U     /* 1 : This peripheral requires supervisor privilege level for
                                                        accesses.           */


/*                                                          OPACCTRLA    */
/*                                                 AC OPACCTRLA TPCFG7 [0..0]                                                  */
/* AC_OPACCTRLA_TPCFG7 */
#define  AC_OPACCTRLA_TPCFG7_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                        */
#define  AC_OPACCTRLA_TPCFG7_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.                    */


/*                                                 AC OPACCTRLA WPCFG7 [1..1]                                                  */
/* AC_OPACCTRLA_WPCFG7 */
#define  AC_OPACCTRLA_WPCFG7_0                  0U     /* 0 : This peripheral allows write accesses.                                */
#define  AC_OPACCTRLA_WPCFG7_1                  1U     /* 1 : This peripheral is write protected.                                   */


/*                                                 AC OPACCTRLA SPCFG7 [2..2]                                                  */
/* AC_OPACCTRLA_SPCFG7 */
 #define AC_OPACCTRLA_SPCFG7_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                       for accesses.       */
 #define AC_OPACCTRLA_SPCFG7_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                       accesses.           */


/*                                                 AC OPACCTRLA TPCFG6 [4..4]                                                  */
/* AC_OPACCTRLA_TPCFG6 */
#define  AC_OPACCTRLA_TPCFG6_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                        */
#define  AC_OPACCTRLA_TPCFG6_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.                    */


/*                                                 AC OPACCTRLA WPCFG6 [5..5]                                                  */
/* AC_OPACCTRLA_WPCFG6 */
#define  AC_OPACCTRLA_WPCFG6_0                  0U     /* 0 : This peripheral allows write accesses.                                */
#define  AC_OPACCTRLA_WPCFG6_1                  1U     /* 1 : This peripheral is write protected.                                   */


/*                                                 AC OPACCTRLA SPCFG6 [6..6]                                                  */
/* AC_OPACCTRLA_SPCFG6 */
 #define AC_OPACCTRLA_SPCFG6_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                        for accesses.       */
 #define AC_OPACCTRLA_SPCFG6_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                        accesses.           */


/*                                                 AC OPACCTRLA TPCFG5 [8..8]                                                  */
 /* AC_OPACCTRLA_TPCFG5 */
 #define AC_OPACCTRLA_TPCFG5_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                        */
 #define AC_OPACCTRLA_TPCFG5_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.                    */


/*                                                 AC OPACCTRLA WPCFG5 [9..9]                                                  */
/* AC_OPACCTRLA_WPCFG5 */
 #define AC_OPACCTRLA_WPCFG5_0                  0U     /* 0 : This peripheral allows write accesses.                                */
 #define AC_OPACCTRLA_WPCFG5_1                  1U     /* 1 : This peripheral is write protected.                                   */


/*                                                AC OPACCTRLA SPCFG5 [10..10]                                                 */
/* AC_OPACCTRLA_SPCFG5 */
 #define AC_OPACCTRLA_SPCFG5_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                        for accesses.       */
 #define AC_OPACCTRLA_SPCFG5_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                        accesses.           */


/*                                                AC OPACCTRLA TPCFG4 [12..12]                                                 */
   /* AC_OPACCTRLA_TPCFG4 */
#define  AC_OPACCTRLA_TPCFG4_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                        */
#define  AC_OPACCTRLA_TPCFG4_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.                    */


/*                                                AC OPACCTRLA WPCFG4 [13..13]                                                 */
 /* AC_OPACCTRLA_WPCFG4 */
#define  AC_OPACCTRLA_WPCFG4_0                  0U     /* 0 : This peripheral allows write accesses.                                */
#define  AC_OPACCTRLA_WPCFG4_1                  1U     /* 1 : This peripheral is write protected.                                   */


/*                                                AC OPACCTRLA SPCFG4 [14..14]                                                 */
   /* AC_OPACCTRLA_SPCFG4 */
 #define AC_OPACCTRLA_SPCFG4_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                        for accesses.       */
 #define AC_OPACCTRLA_SPCFG4_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                        accesses.           */


/*                                                AC OPACCTRLA TPCFG1 [24..24]                                                 */
/* AC_OPACCTRLA_TPCFG1 */
 #define AC_OPACCTRLA_TPCFG1_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                        */
 #define AC_OPACCTRLA_TPCFG1_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.                    */


/*                                                AC OPACCTRLA WPCFG1 [25..25]                                                 */
   /* AC_OPACCTRLA_WPCFG1 */
 #define AC_OPACCTRLA_WPCFG1_0                  0U     /* 0 : This peripheral allows write accesses.                                */
 #define AC_OPACCTRLA_WPCFG1_1                  1U     /* 1 : This peripheral is write protected.                                   */


