MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/*                                                AC OPACCTRLA SPCFG1 [26..26]                                                 */
  /* AC_OPACCTRLA_SPCFG1 */
 #define AC_OPACCTRLA_SPCFG1_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                        for accesses.       */
#define  AC_OPACCTRLA_SPCFG1_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
#define                                                     accesses.           */


/*                                                AC OPACCTRLA TPCFG0 [28..28]                                                 */
   /* AC_OPACCTRLA_TPCFG0 */
#define  AC_OPACCTRLA_TPCFG0_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                        */
#define  AC_OPACCTRLA_TPCFG0_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.                    */


/*                                                AC OPACCTRLA WPCFG0 [29..29]                                                 */
  /* AC_OPACCTRLA_WPCFG0 */
#define  AC_OPACCTRLA_WPCFG0_0                  0U     /* 0 : This peripheral allows write accesses.                                */
#define  AC_OPACCTRLA_WPCFG0_1                  1U     /* 1 : This peripheral is write protected.                                   */


/*                                                AC OPACCTRLA SPCFG0 [30..30]                                                 */
/* AC_OPACCTRLA_SPCFG0 */
 #define AC_OPACCTRLA_SPCFG0_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                        for accesses.       */
#define  AC_OPACCTRLA_SPCFG0_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                       accesses.           */


/*                                                          OPACCTRLB    */
/*                                                 AC OPACCTRLB TPCFG6 [4..4]                                                  */
 /* AC_OPACCTRLB_TPCFG6 */
#define  AC_OPACCTRLB_TPCFG6_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                        */
#define  AC_OPACCTRLB_TPCFG6_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.                    */


/*                                                 AC OPACCTRLB WPCFG6 [5..5]                                                  */
/* AC_OPACCTRLB_WPCFG6 */
#define  AC_OPACCTRLB_WPCFG6_0                  0U     /* 0 : This peripheral allows write accesses.                                */
#define  AC_OPACCTRLB_WPCFG6_1                  1U     /* 1 : This peripheral is write protected.                                   */


/*                                                 AC OPACCTRLB SPCFG6 [6..6]                                                  */
/* AC_OPACCTRLB_SPCFG6 */
 #define AC_OPACCTRLB_SPCFG6_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                      for accesses.       */
 #define AC_OPACCTRLB_SPCFG6_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                       accesses.           */


/*                                                 AC OPACCTRLB TPCFG5 [8..8]                                                  */
  /* AC_OPACCTRLB_TPCFG5 */
 #define AC_OPACCTRLB_TPCFG5_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                        */
 #define AC_OPACCTRLB_TPCFG5_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.                    */


/*                                                 AC OPACCTRLB WPCFG5 [9..9]                                                  */
 /* AC_OPACCTRLB_WPCFG5 */
 #define AC_OPACCTRLB_WPCFG5_0                  0U     /* 0 : This peripheral allows write accesses.                                */
 #define AC_OPACCTRLB_WPCFG5_1                  1U     /* 1 : This peripheral is write protected.                                   */


/*                                                AC OPACCTRLB SPCFG5 [10..10]                                                 */
/* AC_OPACCTRLB_SPCFG5 */
#define  AC_OPACCTRLB_SPCFG5_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                        for accesses.       */
#define AC_OPACCTRLB_SPCFG5_1                   1U     /* 1 : This peripheral requires supervisor privilege level for
                                                        accesses.           */


/*                                                AC OPACCTRLB TPCFG4 [12..12]                                                 */
   /* AC_OPACCTRLB_TPCFG4 */
#define  AC_OPACCTRLB_TPCFG4_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                        */
#define  AC_OPACCTRLB_TPCFG4_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.                    */


/*                                                AC OPACCTRLB WPCFG4 [13..13]                                                 */
 /* AC_OPACCTRLB_WPCFG4 */
#define  AC_OPACCTRLB_WPCFG4_0                  0U     /* 0 : This peripheral allows write accesses.                                */
#define  AC_OPACCTRLB_WPCFG4_1                  1U     /* 1 : This peripheral is write protected.                                   */


/*                                                AC OPACCTRLB SPCFG4 [14..14]                                                 */
 /* AC_OPACCTRLB_SPCFG4 */
#define  AC_OPACCTRLB_SPCFG4_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                        for accesses.       */
#define  AC_OPACCTRLB_SPCFG4_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                        accesses.           */


/*                                                AC OPACCTRLB TPCFG3 [16..16]                                                 */
   /* AC_OPACCTRLB_TPCFG3 */
#define  AC_OPACCTRLB_TPCFG3_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                        */
#define  AC_OPACCTRLB_TPCFG3_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.                    */


/*                                                AC OPACCTRLB WPCFG3 [17..17]                                                 */
/* AC_OPACCTRLB_WPCFG3 */
#define  AC_OPACCTRLB_WPCFG3_0                  0U     /* 0 : This peripheral allows write accesses.                                */
#define  AC_OPACCTRLB_WPCFG3_1                  1U     /* 1 : This peripheral is write protected.                                   */


/*                                                AC OPACCTRLB SPCFG3 [18..18]                                                 */
 /* AC_OPACCTRLB_SPCFG3 */
#define  AC_OPACCTRLB_SPCFG3_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                        for accesses.       */
#define  AC_OPACCTRLB_SPCFG3_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                       accesses.           */


