MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/*                                                          OPACCTRLC    */
/*                                                 AC OPACCTRLC TPCFG7 [0..0]                                                  */
/* AC_OPACCTRLC_TPCFG7 */
#define  AC_OPACCTRLC_TPCFG7_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                        */
#define  AC_OPACCTRLC_TPCFG7_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.                    */


/*                                                 AC OPACCTRLC WPCFG7 [1..1]                                                  */
 /* AC_OPACCTRLC_WPCFG7 */
 #define AC_OPACCTRLC_WPCFG7_0                  0U     /* 0 : This peripheral allows write accesses.                                */
 #define AC_OPACCTRLC_WPCFG7_1                  1U     /* 1 : This peripheral is write protected.                                   */


/*                                                 AC OPACCTRLC SPCFG7 [2..2]                                                  */
 /* AC_OPACCTRLC_SPCFG7 */
#define  AC_OPACCTRLC_SPCFG7_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                        for accesses.       */
#define AC_OPACCTRLC_SPCFG7_1                   1U     /* 1 : This peripheral requires supervisor privilege level for
                                                      accesses.           */


/*                                                 AC OPACCTRLC TPCFG6 [4..4]                                                  */
/* AC_OPACCTRLC_TPCFG6 */
#define  AC_OPACCTRLC_TPCFG6_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                        */
#define  AC_OPACCTRLC_TPCFG6_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.                    */


/*                                                 AC OPACCTRLC WPCFG6 [5..5]                                                  */
 /* AC_OPACCTRLC_WPCFG6 */
#define  AC_OPACCTRLC_WPCFG6_0                  0U     /* 0 : This peripheral allows write accesses.                                */
#define  AC_OPACCTRLC_WPCFG6_1                  1U     /* 1 : This peripheral is write protected.                                   */


/*                                                 AC OPACCTRLC SPCFG6 [6..6]                                                  */
 /* AC_OPACCTRLC_SPCFG6 */
#define  AC_OPACCTRLC_SPCFG6_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                         for accesses.       */
#define  AC_OPACCTRLC_SPCFG6_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                        accesses.           */


/*                                                AC OPACCTRLC TPCFG2 [20..20]                                                 */
  /* AC_OPACCTRLC_TPCFG2 */
#define  AC_OPACCTRLC_TPCFG2_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                        */
#define  AC_OPACCTRLC_TPCFG2_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.                    */


/*                                                AC OPACCTRLC WPCFG2 [21..21]                                                 */
   /* AC_OPACCTRLC_WPCFG2 */
#define  AC_OPACCTRLC_WPCFG2_0                  0U     /* 0 : This peripheral allows write accesses.                                */
#define  AC_OPACCTRLC_WPCFG2_1                  1U     /* 1 : This peripheral is write protected.                                   */


/*                                                AC OPACCTRLC SPCFG2 [22..22]                                                 */
   /* AC_OPACCTRLC_SPCFG2 */
 #define AC_OPACCTRLC_SPCFG2_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                       for accesses.       */
 #define AC_OPACCTRLC_SPCFG2_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                       accesses.           */


/*                                                AC OPACCTRLC TPCFG1 [24..24]                                                 */
   /* AC_OPACCTRLC_TPCFG1 */
#define  AC_OPACCTRLC_TPCFG1_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                        */
#define  AC_OPACCTRLC_TPCFG1_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.                    */


/*                                                AC OPACCTRLC WPCFG1 [25..25]                                                 */
   /* AC_OPACCTRLC_WPCFG1 */
#define  AC_OPACCTRLC_WPCFG1_0                  0U     /* 0 : This peripheral allows write accesses.                                */
#define  AC_OPACCTRLC_WPCFG1_1                  1U     /* 1 : This peripheral is write protected.                                   */


/*                                                AC OPACCTRLC SPCFG1 [26..26]                                                 */
  /* AC_OPACCTRLC_SPCFG1 */
#define  AC_OPACCTRLC_SPCFG1_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                         for accesses.       */
#define  AC_OPACCTRLC_SPCFG1_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                        accesses.           */


/*                                                          OPACCTRLD    */
/*                                                 AC OPACCTRLD TPCFG5 [8..8]                                                  */
  /* AC_OPACCTRLD_TPCFG5 */
 #define AC_OPACCTRLD_TPCFG5_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                        */
 #define AC_OPACCTRLD_TPCFG5_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.                    */


/*                                                 AC OPACCTRLD WPCFG5 [9..9]                                                  */
  /* AC_OPACCTRLD_WPCFG5 */
#define  AC_OPACCTRLD_WPCFG5_0                  0U     /* 0 : This peripheral allows write accesses.                                */
#define  AC_OPACCTRLD_WPCFG5_1                  1U     /* 1 : This peripheral is write protected.                                   */


/*                                                AC OPACCTRLD SPCFG5 [10..10]                                                 */
  /* AC_OPACCTRLD_SPCFG5 */
#define  AC_OPACCTRLD_SPCFG5_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                      for accesses.       */
#define  AC_OPACCTRLD_SPCFG5_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                        accesses.           */


/*                                                AC OPACCTRLD TPCFG3 [16..16]                                                 */
  /* AC_OPACCTRLD_TPCFG3 */
 #define AC_OPACCTRLD_TPCFG3_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                        */
 #define AC_OPACCTRLD_TPCFG3_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.                    */


/*                                                AC OPACCTRLD WPCFG3 [17..17]                                                 */
 /* AC_OPACCTRLD_WPCFG3 */
#define  AC_OPACCTRLD_WPCFG3_0                  0U     /* 0 : This peripheral allows write accesses.                                */
#define  AC_OPACCTRLD_WPCFG3_1                  1U     /* 1 : This peripheral is write protected.                                   */


/*                                                AC OPACCTRLD SPCFG3 [18..18]                                                 */
 /* AC_OPACCTRLD_SPCFG3 */
#define  AC_OPACCTRLD_SPCFG3_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                       for accesses.       */
#define  AC_OPACCTRLD_SPCFG3_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                        accesses.           */


/*                                                AC OPACCTRLD TPCFG2 [20..20]                                                 */
   /* AC_OPACCTRLD_TPCFG2 */
#define  AC_OPACCTRLD_TPCFG2_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                        */
#define  AC_OPACCTRLD_TPCFG2_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.                    */


/*                                                AC OPACCTRLD WPCFG2 [21..21]                                                 */
   /* AC_OPACCTRLD_WPCFG2 */
#define  AC_OPACCTRLD_WPCFG2_0                  0U     /* 0 : This peripheral allows write accesses.                                */
#define  AC_OPACCTRLD_WPCFG2_1                  1U     /* 1 : This peripheral is write protected.                                   */


/*                                                AC OPACCTRLD SPCFG2 [22..22]                                                 */
   /* AC_OPACCTRLD_SPCFG2 */
#define  AC_OPACCTRLD_SPCFG2_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                         for accesses.       */
#define  AC_OPACCTRLD_SPCFG2_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                        accesses.           */


/*                                                AC OPACCTRLD TPCFG1 [24..24]                                                 */
   /* AC_OPACCTRLD_TPCFG1 */
#define  AC_OPACCTRLD_TPCFG1_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                        */
#define  AC_OPACCTRLD_TPCFG1_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.                    */


/*                                                AC OPACCTRLD WPCFG1 [25..25]                                                 */
   /* AC_OPACCTRLD_WPCFG1 */
#define  AC_OPACCTRLD_WPCFG1_0                  0U     /* 0 : This peripheral allows write accesses.                                */
#define  AC_OPACCTRLD_WPCFG1_1                  1U     /* 1 : This peripheral is write protected.                                   */


/*                                                AC OPACCTRLD SPCFG1 [26..26]                                                 */
  /* AC_OPACCTRLD_SPCFG1 */
#define  AC_OPACCTRLD_SPCFG1_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                        for accesses.       */
#define  AC_OPACCTRLD_SPCFG1_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                        accesses.           */


/*                                                AC OPACCTRLD TPCFG0 [28..28]                                                 */
  /* AC_OPACCTRLD_TPCFG0 */
#define  AC_OPACCTRLD_TPCFG0_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                   */
#define  AC_OPACCTRLD_TPCFG0_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.              */


/*                                                AC OPACCTRLD WPCFG0 [29..29]                                                 */
/* AC_OPACCTRLD_WPCFG0 */
#define  AC_OPACCTRLD_WPCFG0_0                  0U     /* 0 : This peripheral allows write accesses.                           */
#define  AC_OPACCTRLD_WPCFG0_1                  1U     /* 1 : This peripheral is write protected.                              */


/*                                                AC OPACCTRLD SPCFG0 [30..30]                                                 */
  /* AC_OPACCTRLD_SPCFG0 */
 #define AC_OPACCTRLD_SPCFG0_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                      for accesses.       */
 #define AC_OPACCTRLD_SPCFG0_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                       accesses.           */


/*                                                          OPACCTRLE    */
/*                                                 AC OPACCTRLE TPCFG6 [4..4]                                                  */
 /* AC_OPACCTRLE_TPCFG6 */
#define  AC_OPACCTRLE_TPCFG6_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                   */
#define  AC_OPACCTRLE_TPCFG6_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.               */


/*                                                 AC OPACCTRLE WPCFG6 [5..5]                                                  */
  /* AC_OPACCTRLE_WPCFG6 */
#define  AC_OPACCTRLE_WPCFG6_0                  0U     /* 0 : This peripheral allows write accesses.                           */
#define  AC_OPACCTRLE_WPCFG6_1                  1U     /* 1 : This peripheral is write protected.                              */


