MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/*                                                AC OPACCTRLG TPCFG5 [10..10]                                                 */
  /* AC_OPACCTRLG_SPCFG5 */
#define  AC_OPACCTRLG_SPCFG5_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                        for accesses.       */
#define  AC_OPACCTRLG_SPCFG5_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                       accesses.           */

/*                                                AC OPACCTRLG TPCFG4 [12..12]                                                 */
  /* AC_OPACCTRLG_TPCFG4 */
#define  AC_OPACCTRLG_TPCFG4_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                   */
#define  AC_OPACCTRLG_TPCFG4_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.               */


/*                                                AC OPACCTRLG WPCFG2 [13..13]                                                 */
   /* AC_OPACCTRLG_WPCFG4 */
#define  AC_OPACCTRLG_WPCFG4_0                  0U     /* 0 : This peripheral allows write accesses.                           */
#define  AC_OPACCTRLG_WPCFG4_1                  1U     /* 1 : This peripheral is write protected.                              */


/*                                                AC OPACCTRLG SPCFG4 [14..14]                                                 */
  /* AC_OPACCTRLG_SPCFG4 */
#define  AC_OPACCTRLG_SPCFG4_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                        for accesses.       */
#define  AC_OPACCTRLG_SPCFG4_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                       accesses.           */

/*                                                AC OPACCTRLG TPCFG2 [20..20]                                                 */
  /* AC_OPACCTRLG_TPCFG2 */
#define  AC_OPACCTRLG_TPCFG2_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                   */
#define  AC_OPACCTRLG_TPCFG2_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.               */


/*                                                AC OPACCTRLG WPCFG2 [21..21]                                                 */
   /* AC_OPACCTRLG_WPCFG2 */
#define  AC_OPACCTRLG_WPCFG2_0                  0U     /* 0 : This peripheral allows write accesses.                           */
#define  AC_OPACCTRLG_WPCFG2_1                  1U     /* 1 : This peripheral is write protected.                              */


/*                                                AC OPACCTRLG SPCFG2 [22..22]                                                 */
  /* AC_OPACCTRLG_SPCFG2 */
#define  AC_OPACCTRLG_SPCFG2_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                        for accesses.       */
#define  AC_OPACCTRLG_SPCFG2_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                       accesses.           */


/*                                                          OPACCTRLH    */
/*                                                AC OPACCTRLH TPCFG2 [20..20]                                                 */
  /* AC_OPACCTRLH_TPCFG2 */
#define  AC_OPACCTRLH_TPCFG2_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                   */
#define  AC_OPACCTRLH_TPCFG2_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.               */


/*                                                AC OPACCTRLH WPCFG2 [21..21]                                                 */
 /* AC_OPACCTRLH_WPCFG2 */
#define  AC_OPACCTRLH_WPCFG2_0                  0U     /* 0 : This peripheral allows write accesses.                           */
#define  AC_OPACCTRLH_WPCFG2_1                  1U     /* 1 : This peripheral is write protected.                              */


/*                                                AC OPACCTRLH SPCFG2 [22..22]                                                 */
 /* AC_OPACCTRLH_SPCFG2 */
#define  AC_OPACCTRLH_SPCFG2_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                         for accesses.       */
#define  AC_OPACCTRLH_SPCFG2_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                       accesses.           */


/*                                                          OPACCTRLI    */
/*                                                 AC OPACCTRLI TPCFG7 [0..0]                                                  */
 /* AC_OPACCTRLI_TPCFG7 */
#define  AC_OPACCTRLI_TPCFG7_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                   */
#define  AC_OPACCTRLI_TPCFG7_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.               */


/*                                                 AC OPACCTRLI WPCFG6 [1..1]                                                  */
/* AC_OPACCTRLI_WPCFG7 */
#define  AC_OPACCTRLI_WPCFG7_0                  0U     /* 0 : This peripheral allows write accesses.                           */
#define  AC_OPACCTRLI_WPCFG7_1                  1U     /* 1 : This peripheral is write protected.                              */


/*                                                 AC OPACCTRLI SPCFG6 [2..2]                                                  */
/* AC_OPACCTRLI_SPCFG7 */
#define  AC_OPACCTRLI_SPCFG7_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                       for accesses.       */
#define  AC_OPACCTRLI_SPCFG7_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                        accesses.           */

/*                                                 AC OPACCTRLI TPCFG6 [4..4]                                                  */
 /* AC_OPACCTRLI_TPCFG6 */
#define  AC_OPACCTRLI_TPCFG6_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                   */
#define  AC_OPACCTRLI_TPCFG6_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.               */


