MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/*                                                AC OPACCTRLL SPCFG5 [10..10]                                                 */
/* AC_OPACCTRLL_SPCFG5 */
#define  AC_OPACCTRLL_SPCFG5_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                         for accesses.    */
#define  AC_OPACCTRLL_SPCFG5_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                        accesses.         */




/* =========================================================================================================================== */
/* ================                                            MSC                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  PCxTYPE  ======================================================== */
/* =======================================================  CPUxLPNUM  ======================================================= */
/* ======================================================  CPUxPBMNUM  ======================================================= */
/* ========================================================  CPUxCNT  ======================================================== */
/* ========================================================  PCxINF0  ======================================================== */
/* ========================================================  PCxINF1  ======================================================== */
/* ========================================================  PCxINF2  ======================================================== */
/* ========================================================  PCxINF3  ======================================================== */
/* ===============================================  MSC PCxINF3 FPUFLG [0..0]  =============================================== */
                                   /* MSC_PCxINF3_FPUFLG                                                        */
#define  MSC_PCxINF3_FPUFLG_0                   0U     /* 0 : FPU support is not included.                                          */
#define  MSC_PCxINF3_FPUFLG_1                   1U     /* 1 : FPU support is included.                                              */


/*                                                  MSC PCxINF3 ISEFLG [1..1]                                                  */
                                      /* MSC_PCxINF3_ISEFLG                                                        */
#define  MSC_PCxINF3_ISEFLG_0                   0U     /* 0 : SIMD/NEON support is not included.                                    */
#define  MSC_PCxINF3_ISEFLG_1                   1U     /* 1 : SIMD/NEON support is included.                                        */


/*                                                  MSC PCxINF3 JHWFLG [2..2]                                                  */
                                    /* MSC_PCxINF3_JHWFLG                                                        */
#define  MSC_PCxINF3_JHWFLG_0                   0U     /* 0 : Jazelle support is not included.                                      */
#define  MSC_PCxINF3_JHWFLG_1                   1U     /* 1 : Jazelle support is included.                                          */


/*                                                  MSC PCxINF3 MMFLG [3..3]                                                   */
                                    /* MSC_PCxINF3_MMFLG                                                         */
#define  MSC_PCxINF3_MMFLG_0                    0U     /* 0 : MMU support is not included.                                          */
#define  MSC_PCxINF3_MMFLG_1                    1U     /* 1 : MMU support is included.                                              */


/*                                                  MSC PCxINF3 TZFFLG [4..4]                                                  */
                                    /* MSC_PCxINF3_TZFFLG                                                        */
#define  MSC_PCxINF3_TZFFLG_0                   0U     /* 0 : Trust Zone support is not included.                                   */
#define  MSC_PCxINF3_TZFFLG_1                   1U     /* 1 : Trust Zone support is included.                                       */


/*                                                 MSC PCxINF3 CMPHWFLG [5..5]                                                 */
                                      /* MSC_PCxINF3_CMPHWFLG                                                      */
#define  MSC_PCxINF3_CMPHWFLG_0                 0U     /* 0 : Core Memory Protection is not included.                               */
#define  MSC_PCxINF3_CMPHWFLG_1                 1U     /* 1 : Core Memory Protection is included.                                   */


/*                                                  MSC PCxINF3 BBFLG [6..6]                                                   */
                                   /* MSC_PCxINF3_BBFLG                                                         */
#define  MSC_PCxINF3_BBFLG_0                    0U     /* 0 : Bit Banding is not supported.                                         */
#define  MSC_PCxINF3_BBFLG_1                    1U     /* 1 : Bit Banding is supported.                                             */


/* ========================================================  PC0TYPE  ======================================================== */
/* =======================================================  CPU0LPNUM  ======================================================= */
/* =======================================================  CPU0PBNUM  ======================================================= */
/* ========================================================  CPU0CNT  ======================================================== */
/* ========================================================  PC0INF0  ======================================================== */
/* ========================================================  PC0INF1  ======================================================== */
/* ========================================================  PC0INF2  ======================================================== */
/* ========================================================  PC0INF3  ======================================================== */
/* ===============================================  MSC PC0INF3 FPUFLG [0..0]  =============================================== */
                                   /* MSC_PC0INF3_FPUFLG                                                        */
#define  MSC_PC0INF3_FPUFLG_0                   0U     /* 0 : FPU support is not included.                                          */
#define  MSC_PC0INF3_FPUFLG_1                   1U     /* 1 : FPU support is included.                                              */


/*                                                  MSC PC0INF3 ISEFLG [1..1]                                                  */
                                      /* MSC_PC0INF3_ISEFLG                                                        */
#define  MSC_PC0INF3_ISEFLG_0                   0U     /* 0 : SIMD/NEON support is not included.                                    */
#define  MSC_PC0INF3_ISEFLG_1                   1U     /* 1 : SIMD/NEON support is included.                                        */


