MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/*                                                  MSC PC0INF3 JHWFLG [2..2]                                                  */
                                   /* MSC_PC0INF3_JHWFLG                                                        */
 #define MSC_PC0INF3_JHWFLG_0                   0U     /* 0 : Jazelle support is not included.                                      */
 #define MSC_PC0INF3_JHWFLG_1                   1U     /* 1 : Jazelle support is included.                                          */


/*                                                  MSC PC0INF3 MMFLG [3..3]                                                   */
                                     /* MSC_PC0INF3_MMFLG                                                         */
#define  MSC_PC0INF3_MMFLG_0                    0U     /* 0 : MMU support is not included.                                          */
#define  MSC_PC0INF3_MMFLG_1                    1U     /* 1 : MMU support is included.                                              */


/*                                                  MSC PC0INF3 TZFFLG [4..4]                                                  */
                                    /* MSC_PC0INF3_TZFFLG                                                        */
#define  MSC_PC0INF3_TZFFLG_0                   0U     /* 0 : Trust Zone support is not included.                                   */
#define  MSC_PC0INF3_TZFFLG_1                   1U     /* 1 : Trust Zone support is included.                                       */


/*                                                 MSC PC0INF3 CMPHWFLG [5..5]                                                 */
                                    /* MSC_PC0INF3_CMPHWFLG                                                      */
#define  MSC_PC0INF3_CMPHWFLG_0                 0U     /* 0 : Core Memory Protection is not included.                               */
#define  MSC_PC0INF3_CMPHWFLG_1                 1U     /* 1 : Core Memory Protection is included.                                   */


/*                                                  MSC PC0INF3 BBFLG [6..6]                                                   */
                                     /* MSC_PC0INF3_BBFLG                                                         */
#define  MSC_PC0INF3_BBFLG_0                    0U     /* 0 : Bit Banding is not supported.                                         */
#define  MSC_PC0INF3_BBFLG_1                    1U     /* 1 : Bit Banding is supported.                                             */


/*                                                            OCMD0                                                            */
/*                                                 MSC OCMD0 OCMTYPE [13..15]                                                  */
                                    /* MSC_OCMD0_OCMTYPE                                                         */
#define  MSC_OCMD0_OCMTYPE_100                  4U     /* 100 : OCMEMn is a Program Flash.                                          */
#define  MSC_OCMD0_OCMTYPE_101                  5U     /* 101 : OCMEMn is a Data Flash.                                             */
#define  MSC_OCMD0_OCMTYPE_110                  6U     /* 110 : OCMEMn is an EEE.                                                   */


/*                                                  MSC OCMD0 RONLY [16..16]                                                   */
                                     /* MSC_OCMD0_RONLY                                                           */
#define  MSC_OCMD0_RONLY_0                      0U     /* 0 : Writes to the OCMDRn[11:0] are allowed                                */
#define  MSC_OCMD0_RONLY_1                      1U     /* 1 : Writes to the OCMDRn[11:0] are ignored                                */


/*                                                 MSC OCMD0 OCMDPWID [17..19]                                                 */
                                  /* MSC_OCMD0_OCMDPWID                                                        */
#define  MSC_OCMD0_OCMDPWID_010                 2U     /* 010 : OCMEMn 32-bits wide                                                 */
#define  MSC_OCMD0_OCMDPWID_011                 3U     /* 011 : OCMEMn 64-bits wide                                                 */
#define  MSC_OCMD0_OCMDPWID_100                 4U     /* 100 : OCMEMn 128-bits wide                                                */
#define  MSC_OCMD0_OCMDPWID_101                 5U     /* 101 : OCMEMn 256-bits wide                                                */


/*                                                 MSC OCMD0 OCMSIZE [24..27]                                                  */
                                  /* MSC_OCMD0_OCMSIZE                                                         */
#define  MSC_OCMD0_OCMSIZE_0000                 0U     /* 0000 : no OCMEMn                                                          */
#define  MSC_OCMD0_OCMSIZE_0001                 1U     /* 0001 : 1KB OCMEMn                                                         */
#define  MSC_OCMD0_OCMSIZE_0010                 2U     /* 0010 : 2KB OCMEMn                                                         */
#define  MSC_OCMD0_OCMSIZE_0011                 3U     /* 0011 : 4KB OCMEMn                                                         */
#define  MSC_OCMD0_OCMSIZE_0100                 4U     /* 0100 : 8KB OCMEMn                                                         */
#define  MSC_OCMD0_OCMSIZE_0101                 5U     /* 0101 : 16KB OCMEMn                                                        */
#define  MSC_OCMD0_OCMSIZE_0110                 6U     /* 0110 : 32KB OCMEMn                                                        */
#define  MSC_OCMD0_OCMSIZE_0111                 7U     /* 0111 : 64KB OCMEMn                                                        */
#define  MSC_OCMD0_OCMSIZE_1000                 8U     /* 1000 : 128KB OCMEMn                                                       */
#define  MSC_OCMD0_OCMSIZE_1001                 9U     /* 1001 : 256KB OCMEMn                                                       */
#define  MSC_OCMD0_OCMSIZE_1010                 10U    /* 1010 : 512KB OCMEMn                                                       */
#define  MSC_OCMD0_OCMSIZE_1011                 11U    /* 1011 : 1MB OCMEMn                                                         */
#define  MSC_OCMD0_OCMSIZE_1100                 12U    /* 1100 : 2MB OCMEMn                                                         */
#define  MSC_OCMD0_OCMSIZE_1101                 13U    /* 1101 : 4MB OCMEMn                                                         */
#define  MSC_OCMD0_OCMSIZE_1110                 14U    /* 1110 : 8MB OCMEMn                                                         */
#define  MSC_OCMD0_OCMSIZE_1111                 15U    /* 1111 : 16MB OCMEMn                                                        */


/*                                                  MSC OCMD0 IFOCM [28..28]                                                   */
                                /* MSC_OCMD0_IFOCM                                                           */
#define  MSC_OCMD0_IFOCM_0                      0U     /* 0 : OCMEMn is a power-of-2 capacity.                                      */
#define  MSC_OCMD0_IFOCM_1                      1U     /* 1 : OCMEMn is not a power-of-2U with a capacity is 0.75 * OCMSZ.          */


/*                                                MSC OCMD0 OCMVLDFLG [31..31]                                                 */
                                   /* MSC_OCMD0_OCMVLDFLG                                                       */
#define  MSC_OCMD0_OCMVLDFLG_0                  0U     /* 0 : OCMEMn is not present.                                                */
#define  MSC_OCMD0_OCMVLDFLG_1                  1U     /* 1 : OCMEMn is present.                                                    */


/*                                                            OCMD1                                                            */
/*                                                 MSC OCMD1 OCMTYPE [13..15]                                                  */
                                    /* MSC_OCMD1_OCMTYPE                                                         */
#define  MSC_OCMD1_OCMTYPE_100                  4U     /* 100 : OCMEMn is a Program Flash.                                          */
#define  MSC_OCMD1_OCMTYPE_101                  5U     /* 101 : OCMEMn is a Data Flash.                                             */
#define  MSC_OCMD1_OCMTYPE_110                  6U     /* 110 : OCMEMn is an EEE.                                                   */


/*                                                  MSC OCMD1 RONLY [16..16]                                                   */
                                    /* MSC_OCMD1_RONLY                                                           */
#define  MSC_OCMD1_RONLY_0                      0U     /* 0 : Writes to the OCMDRn[11:0] are allowed                                */
#define  MSC_OCMD1_RONLY_1                      1U     /* 1 : Writes to the OCMDRn[11:0] are ignored                                */


