MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/*                                                   DMA CTRL MINLMEN [7..7]                                                   */
                                    /* DMA_CTRL_MINLMEN                                                          */
#define  DMA_CTRL_MINLMEN_0                     0U     /* 0 : Disabled. TCDn.word2 is defined as a 32-bit NBYTES field.             */
#define  DMA_CTRL_MINLMEN_1                     1U     /* 1 : Enabled. TCDn.word2 is redefined to include individual enable
                                                     fieldsU an offset fieldU and the NBYTES field. The individual
                                                     enable fields allow the minor loop offset to be applied
                                                     to the source addressU the destination addressU or both.
                                                     The NBYTES field is reduced when either offset is enabled.                */


/*                                                 DMA CTRL TXCNLERR [16..16]                                                  */
                                   /* DMA_CTRL_TXCNLERR                                                         */
#define  DMA_CTRL_TXCNLERR_0                    0U     /* 0 : Normal operation                                                      */
#define  DMA_CTRL_TXCNLERR_1                    1U     /* 1 : Cancel the remaining data transfer in the same fashion as
                                                     the CX bit. Stop the executing channel and force the minor
                                                     loop to finish. The cancel takes effect after the last
                                                     write of the current read/write sequence. The ECX bit clears
                                                     itself after the cancel is honored. In addition to cancelling
                                                     the transferU ECX treats the cancel as an error conditionU
                                                     thus updating the Error Status register (DMAx_ES) and generating
                                                     an optional error interrupt.                                              */


/*                                                   DMA CTRL TXCNL [17..17]                                                   */
                                     /* DMA_CTRL_TXCNL                                                            */
#define  DMA_CTRL_TXCNL_0                       0U     /* 0 : Normal operation                                                      */
#define  DMA_CTRL_TXCNL_1                       1U     /* 1 : Cancel the remaining data transfer. Stop the executing channel
                                                     and force the minor loop to finish. The cancel takes effect
                                                     after the last write of the current read/write sequence.
                                                     The CX bit clears itself after the cancel has been honored.
                                                     This cancel retires the channel normally as if the minor
                                                     loop was completed.                                                       */


/*                                                  DMA CTRL ACTFLG [31..31]                                                   */
                                     /* DMA_CTRL_ACTFLG                                                           */
#define  DMA_CTRL_ACTFLG_0                      0U     /* 0 : eDMA is idle.                                                         */
#define  DMA_CTRL_ACTFLG_1                      1U     /* 1 : eDMA is executing a channel.                                          */


/*                                                            ESTS                                                             */
/*                                                   DMA ESTS DBEFLG [0..0]                                                    */
                                   /* DMA_ESTS_DBEFLG                                                           */
#define  DMA_ESTS_DBEFLG_0                      0U     /* 0 : No destination bus error                                              */
#define  DMA_ESTS_DBEFLG_1                      1U     /* 1 : The last recorded error was a bus error on a destination
                                                     write                                                                     */


/*                                                   DMA ESTS SBEFLG [1..1]                                                    */
                                    /* DMA_ESTS_SBEFLG                                                           */
#define  DMA_ESTS_SBEFLG_0                      0U     /* 0 : No source bus error                                                   */
#define  DMA_ESTS_SBEFLG_1                      1U     /* 1 : The last recorded error was a bus error on a source read              */


/*                                                  DMA ESTS SGCFGEFLG [2..2]                                                  */
                                   /* DMA_ESTS_SGCFGEFLG                                                        */
#define  DMA_ESTS_SGCFGEFLG_0                   0U     /* 0 : No scatter/gather configuration error                                 */
#define  DMA_ESTS_SGCFGEFLG_1                   1U     /* 1 : The last recorded error was a configuration error detected
                                                     in the TCDn_DLASTSGA field. This field is checked at the
                                                     beginning of a scatter/gather operation after major loop
                                                     completion if TCDn_CSTS[SGFEN] is enabled. TCDn_DLASTSGA
                                                     is not on a 32 byte boundary.                                             */


/*                                                  DMA ESTS MCCFGEFLG [3..3]                                                  */
                                     /* DMA_ESTS_NCCFGEFLG                                                        */
#define  DMA_ESTS_NCCFGEFLG_0                   0U     /* 0 : No NBYTES/CITER configuration error                                   */


/*                                                 DMA ESTS DOFCFGEFLG [4..4]                                                  */
                                    /* DMA_ESTS_DOFCFGEFLG                                                       */
#define  DMA_ESTS_DOFCFGEFLG_0                  0U     /* 0 : No destination offset configuration error                             */
#define  DMA_ESTS_DOFCFGEFLG_1                  1U     /* 1 : The last recorded error was a configuration error detected
                                                     in the TCDn_DOFF field. TCDn_DOFF is inconsistent with
                                                     TCDn_ATTR[DSIZE].                                                         */


/*                                                DMA ESTS DADDRCFGEFLG [5..5]                                                 */
                               /* DMA_ESTS_DADDRCFGEFLG                                                     */
#define  DMA_ESTS_DADDRCFGEFLG_0                0U     /* 0 : No destination address configuration error                            */
#define  DMA_ESTS_DADDRCFGEFLG_1                1U     /* 1 : The last recorded error was a configuration error detected
                                                     in the TCDn_DADDR field. TCDn_DADDR is inconsistent with
                                                     TCDn_ATTR[DSIZE].                                                         */


