MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/*                                                 DMA ESTS SOFCFGEFLG [6..6]                                                  */
                                   /* DMA_ESTS_SOFCFGEFLG                                                       */
#define  DMA_ESTS_SOFCFGEFLG_0                  0U     /* 0 : No source offset configuration error                                  */
#define  DMA_ESTS_SOFCFGEFLG_1                  1U     /* 1 : The last recorded error was a configuration error detected
                                                     in the TCDn_SOFF field. TCDn_SOFF is inconsistent with
                                                     TCDn_ATTR[SSIZE].                                                         */


/*                                                DMA ESTS SADDRCFGEFLG [7..7]                                                 */
                              /* DMA_ESTS_SADDRCFGEFLG                                                     */
#define  DMA_ESTS_SADDRCFGEFLG_0                0U     /* 0 : No source address configuration error.                                */
#define  DMA_ESTS_SADDRCFGEFLG_1                1U     /* 1 : The last recorded error was a configuration error detected
                                                     in the TCDn_SADDR field. TCDn_SADDR is inconsistent with
                                                     TCDn_ATTR[SSIZE].                                                         */


/*                                                 DMA ESTS CPCFGEFLG [14..14]                                                 */
                                   /* DMA_ESTS_CPCFGEFLG                                                        */
#define  DMA_ESTS_CPCFGEFLG_0                   0U     /* 0 : No channel priority error                                             */


/*                                                   DMA ESTS TCFLG [16..16]                                                   */
                                  /* DMA_ESTS_TCFLG                                                            */
#define  DMA_ESTS_TCFLG_0                       0U     /* 0 : No canceled transfers                                                 */
#define  DMA_ESTS_TCFLG_1                       1U     /* 1 : The last recorded entry was a canceled transfer by the error
                                                     cancel transfer input                                                     */


/*                                                  DMA ESTS EEFLG [31..31]                                                   */
                                     /* DMA_ESTS_EEFLG                                                           */
#define  DMA_ESTS_EEFLG_0                      0U     /* 0 : No ERR bits are set.                                                  */
#define  DMA_ESTS_EEFLG_1                      1U     /* 1 : At least one ERR bit is set indicating a valid error exists
                                                     that has not been cleared.                                                */


/*                                                            REQEN                                                            */
/*                                                   DMA REQEN REQEN0 [0..0]                                                   */
                                     /* DMA_REQEN_REQEN0                                                          */
#define  DMA_REQEN_REQEN0_0                     0U     /* 0 : The DMA request signal for the corresponding channel is
                                                      disabled                                                                  */
#define  DMA_REQEN_REQEN0_1                     1U     /* 1 : The DMA request signal for the corresponding channel is
                                                      enabled                                                                   */


/*                                                   DMA REQEN REQEN1 [1..1]                                                   */
                                    /* DMA_REQEN_REQEN1                                                          */
 #define DMA_REQEN_REQEN1_0                     0U     /* 0 : The DMA request signal for the corresponding channel is
                                                      disabled                                                                  */
 #define DMA_REQEN_REQEN1_1                     1U     /* 1 : The DMA request signal for the corresponding channel is
                                                       enabled                                                                   */


/*                                                   DMA REQEN REQEN2 [2..2]                                                   */
                                  /* DMA_REQEN_REQEN2                                                          */
#define  DMA_REQEN_REQEN2_0                     0U     /* 0 : The DMA request signal for the corresponding channel is
                                                             disabled                                                                  */
#define  DMA_REQEN_REQEN2_1                     1U     /* 1 : The DMA request signal for the corresponding channel is
                                                        enabled                                                                   */


/*                                                   DMA REQEN REQEN3 [3..3]                                                   */
                                     /* DMA_REQEN_REQEN3                                                          */
#define  DMA_REQEN_REQEN3_0                     0U     /* 0 : The DMA request signal for the corresponding channel is
                                                      disabled                                                                  */
#define  DMA_REQEN_REQEN3_1                     1U     /* 1 : The DMA request signal for the corresponding channel is
                                                        enabled                                                                   */


/*                                                   DMA REQEN REQEN4 [4..4]                                                   */
                                     /* DMA_REQEN_REQEN4                                                          */
#define  DMA_REQEN_REQEN4_0                     0U     /* 0 : The DMA request signal for the corresponding channel is
                                                       disabled                                                                  */
#define  DMA_REQEN_REQEN4_1                     1U     /* 1 : The DMA request signal for the corresponding channel is
                                                      enabled                                                                   */


/*                                                   DMA REQEN REQEN5 [5..5]                                                   */
                                   /* DMA_REQEN_REQEN5                                                          */
#define  DMA_REQEN_REQEN5_0                     0U     /* 0 : The DMA request signal for the corresponding channel is
                                                         disabled                                                                  */
#define  DMA_REQEN_REQEN5_1                     1U     /* 1 : The DMA request signal for the corresponding channel is
                                                       enabled                                                                   */


/*                                                   DMA REQEN REQEN6 [6..6]                                                   */
                                   /* DMA_REQEN_REQEN6                                                          */
#define  DMA_REQEN_REQEN6_0                     0U     /* 0 : The DMA request signal for the corresponding channel is
                                                        disabled                                                                  */
#define  DMA_REQEN_REQEN6_1                     1U     /* 1 : The DMA request signal for the corresponding channel is
                                                       enabled                                                                   */


/*                                                   DMA REQEN REQEN7 [7..7]                                                   */
                                   /* DMA_REQEN_REQEN7                                                          */
#define  DMA_REQEN_REQEN7_0                     0U     /* 0 : The DMA request signal for the corresponding channel is
                                                        disabled                                                                  */
#define  DMA_REQEN_REQEN7_1                     1U     /* 1 : The DMA request signal for the corresponding channel is
                                                        enabled                                                                   */


/*                                                   DMA REQEN REQEN8 [8..8]                                                   */
                                    /* DMA_REQEN_REQEN8                                                          */
#define  DMA_REQEN_REQEN8_0                     0U     /* 0 : The DMA request signal for the corresponding channel is
                                                        disabled                                                                  */
#define  DMA_REQEN_REQEN8_1                     1U     /* 1 : The DMA request signal for the corresponding channel is
                                                       enabled                                                                   */


/*                                                   DMA REQEN REQEN9 [9..9]                                                   */
                                 /* DMA_REQEN_REQEN9                                                          */
 #define DMA_REQEN_REQEN9_0                     0U     /* 0 : The DMA request signal for the corresponding channel is
                                                    disabled                                                                  */
 #define DMA_REQEN_REQEN9_1                     1U     /* 1 : The DMA request signal for the corresponding channel is
                                                     enabled                                                                   */


