MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/*                                                 DMA REQEN REQEN10 [10..10]                                                  */
                                    /* DMA_REQEN_REQEN10                                                         */
#define  DMA_REQEN_REQEN10_0                    0U     /* 0 : The DMA request signal for the corresponding channel is
                                                        disabled                                                                  */
#define  DMA_REQEN_REQEN10_1                    1U     /* 1 : The DMA request signal for the corresponding channel is
                                                     enabled                                                                   */


/*                                                 DMA REQEN REQEN11 [11..11]                                                  */
                                   /* DMA_REQEN_REQEN11                                                         */
#define  DMA_REQEN_REQEN11_0                    0U     /* 0 : The DMA request signal for the corresponding channel is
                                                        disabled                                                                  */
#define  DMA_REQEN_REQEN11_1                    1U     /* 1 : The DMA request signal for the corresponding channel is
                                                    enabled                                                                   */


/*                                                 DMA REQEN REQEN12 [12..12]                                                  */
                                     /* DMA_REQEN_REQEN12                                                         */
#define  DMA_REQEN_REQEN12_0                    0U     /* 0 : The DMA request signal for the corresponding channel is
                                                      disabled                                                                  */
#define  DMA_REQEN_REQEN12_1                    1U     /* 1 : The DMA request signal for the corresponding channel is
                                                     enabled                                                                   */


/*                                                 DMA REQEN REQEN13 [13..13]                                                  */
                                    /* DMA_REQEN_REQEN13                                                         */
 #define DMA_REQEN_REQEN13_0                    0U     /* 0 : The DMA request signal for the corresponding channel is
                                                    disabled                                                                  */
 #define DMA_REQEN_REQEN13_1                    1U     /* 1 : The DMA request signal for the corresponding channel is
                                                      enabled                                                                   */


/*                                                 DMA REQEN REQEN14 [14..14]                                                  */
                                    /* DMA_REQEN_REQEN14                                                         */
#define DMA_REQEN_REQEN14_0                     0U     /* 0 : The DMA request signal for the corresponding channel is
                                                      disabled                                                                  */
#define  DMA_REQEN_REQEN14_1                    1U     /* 1 : The DMA request signal for the corresponding channel is
                                                     enabled                                                                   */


/*                                                 DMA REQEN REQEN15 [15..15]                                                  */
                                   /* DMA_REQEN_REQEN15                                                         */
 #define DMA_REQEN_REQEN15_0                    0U     /* 0 : The DMA request signal for the corresponding channel is
                                                       disabled                                                                  */
 #define DMA_REQEN_REQEN15_1                    1U     /* 1 : The DMA request signal for the corresponding channel is
                                                     enabled                                                                   */


/*                                                            EIEN                                                             */
/*                                                    DMA EIEN EIEN0 [0..0]                                                    */
                                   /* DMA_EIEN_EIEN0                                                            */
 #define DMA_EIEN_EIEN0_0                       0U     /* 0 : The error signal for corresponding channel does not generate
                                                       an error interrupt                                                        */
 #define DMA_EIEN_EIEN0_1                       1U     /* 1 : The assertion of the error signal for corresponding channel
                                                      generates an error interrupt request                                      */


/*                                                    DMA EIEN EIEN1 [1..1]                                                    */
                                   /* DMA_EIEN_EIEN1                                                            */
#define  DMA_EIEN_EIEN1_0                       0U     /* 0 : The error signal for corresponding channel does not generate
                                                        an error interrupt                                                        */
#define  DMA_EIEN_EIEN1_1                       1U     /* 1 : The assertion of the error signal for corresponding channel
                                                      generates an error interrupt request                                      */


/*                                                    DMA EIEN EIEN2 [2..2]                                                    */
                                    /* DMA_EIEN_EIEN2                                                            */
 #define DMA_EIEN_EIEN2_0                       0U     /* 0 : The error signal for corresponding channel does not generate
                                                       an error interrupt                                                        */
 #define DMA_EIEN_EIEN2_1                       1U     /* 1 : The assertion of the error signal for corresponding channel
                                                      generates an error interrupt request                                      */


/*                                                    DMA EIEN EIEN3 [3..3]                                                    */
                                     /* DMA_EIEN_EIEN3                                                            */
#define  DMA_EIEN_EIEN3_0                       0U     /* 0 : The error signal for corresponding channel does not generate
                                                        an error interrupt                                                        */
#define  DMA_EIEN_EIEN3_1                       1U     /* 1 : The assertion of the error signal for corresponding channel
                                                      generates an error interrupt request                                      */


