MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/*                                                    DMA EIEN EIEN4 [4..4]                                                    */
                                     /* DMA_EIEN_EIEN4                                                            */
#define  DMA_EIEN_EIEN4_0                       0U     /* 0 : The error signal for corresponding channel does not generate
                                                       an error interrupt                                                        */
#define  DMA_EIEN_EIEN4_1                       1U     /* 1 : The assertion of the error signal for corresponding channel
                                                       generates an error interrupt request                                      */


/*                                                    DMA EIEN EIEN5 [5..5]                                                    */
                                     /* DMA_EIEN_EIEN5                                                            */
#define  DMA_EIEN_EIEN5_0                       0U     /* 0 : The error signal for corresponding channel does not generate
                                                        an error interrupt                                                        */
#define  DMA_EIEN_EIEN5_1                       1U     /* 1 : The assertion of the error signal for corresponding channel
                                                        generates an error interrupt request                                      */


/*                                                    DMA EIEN EIEN6 [6..6]                                                    */
                                     /* DMA_EIEN_EIEN6                                                            */
#define  DMA_EIEN_EIEN6_0                       0U     /* 0 : The error signal for corresponding channel does not generate
                                                       an error interrupt                                                        */
#define  DMA_EIEN_EIEN6_1                       1U     /* 1 : The assertion of the error signal for corresponding channel
#define                                                     generates an error interrupt request                                      */


/*                                                    DMA EIEN EIEN7 [7..7]                                                    */
                                 /* DMA_EIEN_EIEN7                                                            */
#define  DMA_EIEN_EIEN7_0                       0U     /* 0 : The error signal for corresponding channel does not generate
                                                        an error interrupt                                                        */
#define  DMA_EIEN_EIEN7_1                       1U     /* 1 : The assertion of the error signal for corresponding channel
                                                      generates an error interrupt request                                      */


/*                                                    DMA EIEN EIEN8 [8..8]                                                    */
                                     /* DMA_EIEN_EIEN8                                                            */
 #define DMA_EIEN_EIEN8_0                       0U     /* 0 : The error signal for corresponding channel does not generate
                                                       an error interrupt                                                        */
 #define DMA_EIEN_EIEN8_1                       1U     /* 1 : The assertion of the error signal for corresponding channel
                                                    generates an error interrupt request                                      */


/*                                                    DMA EIEN EIEN9 [9..9]                                                    */
                                     /* DMA_EIEN_EIEN9                                                            */
#define  DMA_EIEN_EIEN9_0                       0U     /* 0 : The error signal for corresponding channel does not generate
                                                       an error interrupt                                                        */
#define  DMA_EIEN_EIEN9_1                       1U     /* 1 : The assertion of the error signal for corresponding channel
                                                        generates an error interrupt request                                      */


/*                                                  DMA EIEN EIEN10 [10..10]                                                   */
                                    /* DMA_EIEN_EIEN10                                                           */
#define DMA_EIEN_EIEN10_0                       0U     /* 0 : The error signal for corresponding channel does not generate
                                                       an error interrupt                                                        */
#define  DMA_EIEN_EIEN10_1                      1U     /* 1 : The assertion of the error signal for corresponding channel
                                                       generates an error interrupt request                                      */


/*                                                  DMA EIEN EIEN11 [11..11]                                                   */
                                 /* DMA_EIEN_EIEN11                                                           */
#define  DMA_EIEN_EIEN11_0                      0U     /* 0 : The error signal for corresponding channel does not generate
                                                       an error interrupt                                                        */
#define  DMA_EIEN_EIEN11_1                      1U     /* 1 : The assertion of the error signal for corresponding channel
                                                      generates an error interrupt request                                      */


/*                                                  DMA EIEN EIEN12 [12..12]                                                   */
                                     /* DMA_EIEN_EIEN12                                                           */
 #define DMA_EIEN_EIEN12_0                      0U     /* 0 : The error signal for corresponding channel does not generate
                                                    an error interrupt                                                        */
 #define DMA_EIEN_EIEN12_1                      1U     /* 1 : The assertion of the error signal for corresponding channel
                                                       generates an error interrupt request                                      */


/*                                                  DMA EIEN EIEN13 [13..13]                                                   */
                                   /* DMA_EIEN_EIEN13                                                           */
#define  DMA_EIEN_EIEN13_0                      0U     /* 0 : The error signal for corresponding channel does not generate
                                                       an error interrupt                                                        */
#define  DMA_EIEN_EIEN13_1                      1U     /* 1 : The assertion of the error signal for corresponding channel
                                                 generates an error interrupt request                                      */


/*                                                  DMA EIEN EIEN14 [14..14]                                                   */
                                  /* DMA_EIEN_EIEN14                                                           */
#define  DMA_EIEN_EIEN14_0                      0U     /* 0 : The error signal for corresponding channel does not generate
                                                       an error interrupt                                                        */
#define  DMA_EIEN_EIEN14_1                      1U     /* 1 : The assertion of the error signal for corresponding channel
                                                     generates an error interrupt request                                      */


