MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/*                                                            CHESTS                                                             */
/*                                                    DMA CHESTS EFLG0 [0..0]                                                    */
                                     /* DMA_CHESTS_EFLG0                                                            */
#define  DMA_CHESTS_EFLG0_0                       0U     /* 0 : An error in this channel has not occurred                             */
#define  DMA_CHESTS_EFLG0_1                       1U     /* 1 : An error in this channel has occurred                                 */


/*                                                    DMA CHESTS EFLG1 [1..1]                                                    */
                                     /* DMA_CHESTS_EFLG1                                                            */
#define  DMA_CHESTS_EFLG1_0                       0U     /* 0 : An error in this channel has not occurred                             */
#define  DMA_CHESTS_EFLG1_1                       1U     /* 1 : An error in this channel has occurred                                 */


/*                                                    DMA CHESTS EFLG2 [2..2]                                                    */
                                    /* DMA_CHESTS_EFLG2                                                            */
#define  DMA_CHESTS_EFLG2_0                       0U     /* 0 : An error in this channel has not occurred                             */
#define  DMA_CHESTS_EFLG2_1                       1U     /* 1 : An error in this channel has occurred                                 */


/*                                                    DMA CHESTS EFLG3 [3..3]                                                    */
                                    /* DMA_CHESTS_EFLG3                                                            */
#define  DMA_CHESTS_EFLG3_0                       0U     /* 0 : An error in this channel has not occurred                             */
#define  DMA_CHESTS_EFLG3_1                       1U     /* 1 : An error in this channel has occurred                                 */


/*                                                    DMA CHESTS EFLG4 [4..4]                                                    */
                                     /* DMA_CHESTS_EFLG4                                                            */
#define  DMA_CHESTS_EFLG4_0                       0U     /* 0 : An error in this channel has not occurred                             */
#define  DMA_CHESTS_EFLG4_1                       1U     /* 1 : An error in this channel has occurred                                 */


/*                                                    DMA CHESTS EFLG5 [5..5]                                                    */
                                     /* DMA_CHESTS_EFLG5                                                            */
#define  DMA_CHESTS_EFLG5_0                       0U     /* 0 : An error in this channel has not occurred                             */
#define  DMA_CHESTS_EFLG5_1                       1U     /* 1 : An error in this channel has occurred                                 */


/*                                                    DMA CHESTS EFLG6 [6..6]                                                    */
                                        /* DMA_CHESTS_EFLG6                                                            */
#define  DMA_CHESTS_EFLG6_0                       0U     /* 0 : An error in this channel has not occurred                             */
#define  DMA_CHESTS_EFLG6_1                       1U     /* 1 : An error in this channel has occurred                                 */


/*                                                    DMA CHESTS EFLG7 [7..7]                                                    */
                                         /* DMA_CHESTS_EFLG7                                                            */
#define  DMA_CHESTS_EFLG7_0                       0U     /* 0 : An error in this channel has not occurred                             */
#define  DMA_CHESTS_EFLG7_1                       1U     /* 1 : An error in this channel has occurred                                 */


/*                                                    DMA CHESTS EFLG8 [8..8]                                                    */
                                        /* DMA_CHESTS_EFLG8                                                            */
#define  DMA_CHESTS_EFLG8_0                       0U     /* 0 : An error in this channel has not occurred                             */
#define  DMA_CHESTS_EFLG8_1                       1U     /* 1 : An error in this channel has occurred                                 */


/*                                                    DMA CHESTS EFLG9 [9..9]                                                    */
                                        /* DMA_CHESTS_EFLG9                                                            */
#define  DMA_CHESTS_EFLG9_0                       0U     /* 0 : An error in this channel has not occurred                             */
#define  DMA_CHESTS_EFLG9_1                       1U     /* 1 : An error in this channel has occurred                                 */


/*                                                  DMA CHESTS EFLG10 [10..10]                                                   */
                                        /* DMA_CHESTS_EFLG10                                                           */
#define  DMA_CHESTS_EFLG10_0                      0U     /* 0 : An error in this channel has not occurred                             */
#define  DMA_CHESTS_EFLG10_1                      1U     /* 1 : An error in this channel has occurred                                 */


/*                                                  DMA CHESTS EFLG11 [11..11]                                                   */
                                        /* DMA_CHESTS_EFLG11                                                           */
#define  DMA_CHESTS_EFLG11_0                      0U     /* 0 : An error in this channel has not occurred                             */
#define  DMA_CHESTS_EFLG11_1                      1U     /* 1 : An error in this channel has occurred                                 */


