MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/*                                                 DMA AREQSEN AREQSEN6 [6..6]                                                  */
                            /* DMA_AREQSEN_AREQSEN6                                                       */
#define  DMA_AREQSEN_AREQSEN6_0                  0U     /* 0 : Disable asynchronous DMA request for channel 6.                       */
#define  DMA_AREQSEN_AREQSEN6_1                  1U     /* 1 : Enable asynchronous DMA request for channel 6.                        */


/*                                                 DMA AREQSEN AREQSEN7 [7..7]                                                  */
                            /* DMA_AREQSEN_AREQSEN7                                                       */
#define  DMA_AREQSEN_AREQSEN7_0                  0U     /* 0 : Disable asynchronous DMA request for channel 7.                       */
#define  DMA_AREQSEN_AREQSEN7_1                  1U     /* 1 : Enable asynchronous DMA request for channel 7.                        */


/*                                                 DMA AREQSEN AREQSEN8 [8..8]                                                  */
                            /* DMA_AREQSEN_AREQSEN8                                                       */
#define  DMA_AREQSEN_AREQSEN8_0                  0U     /* 0 : Disable asynchronous DMA request for channel 8.                       */
#define  DMA_AREQSEN_AREQSEN8_1                  1U     /* 1 : Enable asynchronous DMA request for channel 8.                        */


/*                                                 DMA AREQSEN AREQSEN9 [9..9]                                                  */
                                   /* DMA_AREQSEN_AREQSEN9                                                       */
#define  DMA_AREQSEN_AREQSEN9_0                  0U     /* 0 : Disable asynchronous DMA request for channel 9.                       */
#define  DMA_AREQSEN_AREQSEN9_1                  1U     /* 1 : Enable asynchronous DMA request for channel 9.                        */


/*                                                DMA AREQSEN AREQSEN10 [10..10]                                                */
                                 /* DMA_AREQSEN_AREQSEN10                                                      */
#define  DMA_AREQSEN_AREQSEN10_0                 0U     /* 0 : Disable asynchronous DMA request for channel 10.                      */
#define  DMA_AREQSEN_AREQSEN10_1                 1U     /* 1 : Enable asynchronous DMA request for channel 10.                       */


/*                                                DMA AREQSEN AREQSEN11 [11..11]                                                */
                                /* DMA_AREQSEN_AREQSEN11                                                      */
#define  DMA_AREQSEN_AREQSEN11_0                 0U     /* 0 : Disable asynchronous DMA request for channel 11.                      */
#define  DMA_AREQSEN_AREQSEN11_1                 1U     /* 1 : Enable asynchronous DMA request for channel 11.                       */


/*                                                DMA AREQSEN AREQSEN12 [12..12]                                                */
                                   /* DMA_AREQSEN_AREQSEN12                                                      */
#define  DMA_AREQSEN_AREQSEN12_0                 0U     /* 0 : Disable asynchronous DMA request for channel 12.                      */
#define  DMA_AREQSEN_AREQSEN12_1                 1U     /* 1 : Enable asynchronous DMA request for channel 12.                       */


/*                                                DMA AREQSEN AREQSEN13 [13..13]                                                */
                              /* DMA_AREQSEN_AREQSEN13                                                      */
#define  DMA_AREQSEN_AREQSEN13_0                 0U     /* 0 : Disable asynchronous DMA request for channel 13.                      */
#define  DMA_AREQSEN_AREQSEN13_1                 1U     /* 1 : Enable asynchronous DMA request for channel 13.                       */


/*                                                DMA AREQSEN AREQSEN14 [14..14]                                                */
                               /* DMA_AREQSEN_AREQSEN14                                                      */
#define  DMA_AREQSEN_AREQSEN14_0                 0U     /* 0 : Disable asynchronous DMA request for channel 14.                      */
#define  DMA_AREQSEN_AREQSEN14_1                 1U     /* 1 : Enable asynchronous DMA request for channel 14.                       */


/*                                               DMA EAREQS AREQSEN15 [15..15]                                                */
                                    /* DMA_EAREQS_EAREQSEN15                                                     */
#define  DMA_EAREQS_EAREQSEN15_0                0U     /* 0 : Disable asynchronous DMA request for channel 15.                      */
#define  DMA_EAREQS_EAREQSEN15_1                1U     /* 1 : Enable asynchronous DMA request for channel 15.                       */


/*                                                           CHPRI3                                                            */
/*                                                 DMA CHPRI3 PLPRICHD [6..6]                                                  */
                                 /* DMA_CHPRI3_PLPRICHD                                                       */
#define  DMA_CHPRI3_PLPRICHD_0                  0U     /* 0 : Channel n can suspend a lower priority channel.                       */
#define  DMA_CHPRI3_PLPRICHD_1                  1U     /* 1 : Channel n cannot suspend any channelU regardless of channel
                                                     priority.                                                                 */


/*                                                DMA CHPRI3 BPHPRICHEN [7..7]                                                 */
                                      /* DMA_CHPRI3_BPHPRICHEN                                                     */
#define  DMA_CHPRI3_BPHPRICHEN_0                0U     /* 0 : Channel n cannot be suspended by a higher priority channels
                                                      service request.                                                          */
#define  DMA_CHPRI3_BPHPRICHEN_1                1U     /* 1 : Channel n can be temporarily suspended by the service request
                                                    of a higher priority channel.                                             */


/*                                                           CHPRI2                                                            */
/*                                                 DMA CHPRI2 PLPRICHD [6..6]                                                  */
                                    /* DMA_CHPRI2_PLPRICHD                                                       */
#define  DMA_CHPRI2_PLPRICHD_0                  0U     /* 0 : Channel n can suspend a lower priority channel.                       */
#define  DMA_CHPRI2_PLPRICHD_1                  1U     /* 1 : Channel n cannot suspend any channelU regardless of channel
                                                     priority.                                                                 */


