MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/*                                                DMA CHPRI2 BPHPRICHEN [7..7]                                                 */
    /* DMA_CHPRI2_BPHPRICHEN                                                     */
 #define DMA_CHPRI2_BPHPRICHEN_0                0U     /* 0 : Channel n cannot be suspended by a higher priority channels
                                                     service request.                                                          */
 #define DMA_CHPRI2_BPHPRICHEN_1                1U     /* 1 : Channel n can be temporarily suspended by the service request
                                                     of a higher priority channel.                                             */


/*                                                           CHPRI1                                                            */
/*                                                 DMA CHPRI1 PLPRICHD [6..6]                                                  */
                                    /* DMA_CHPRI1_PLPRICHD                                                       */
#define  DMA_CHPRI1_PLPRICHD_0                  0U     /* 0 : Channel n can suspend a lower priority channel.                       */
#define  DMA_CHPRI1_PLPRICHD_1                  1U     /* 1 : Channel n cannot suspend any channelU regardless of channel
                                                     priority.                                                                 */


/*                                                DMA CHPRI1 BPHPRICHEN [7..7]                                                 */
                                    /* DMA_CHPRI1_BPHPRICHEN                                                     */
 #define DMA_CHPRI1_BPHPRICHEN_0                0U     /* 0 : Channel n cannot be suspended by a higher priority channels
                                                      service request.                                                          */
 #define DMA_CHPRI1_BPHPRICHEN_1                1U     /* 1 : Channel n can be temporarily suspended by the service request
                                                       of a higher priority channel.                                             */


/*                                                           CHPRI0                                                            */
/*                                                 DMA CHPRI0 PLPRICHD [6..6]                                                  */
                                    /* DMA_CHPRI0_PLPRICHD                                                       */
#define  DMA_CHPRI0_PLPRICHD_0                  0U     /* 0 : Channel n can suspend a lower priority channel.                       */
#define  DMA_CHPRI0_PLPRICHD_1                  1U     /* 1 : Channel n cannot suspend any channelU regardless of channel
                                                     priority.                                                                 */


/*                                                DMA CHPRI0 BPHPRICHEN [7..7]                                                 */
                                   /* DMA_CHPRI0_BPHPRICHEN                                                     */
#define  DMA_CHPRI0_BPHPRICHEN_0                0U     /* 0 : Channel n cannot be suspended by a higher priority channels
                                                        service request.                                                          */
#define  DMA_CHPRI0_BPHPRICHEN_1                1U     /* 1 : Channel n can be temporarily suspended by the service request
                                            of a higher priority channel.                                             */


/*                                                           CHPRI7                                                            */
/*                                                 DMA CHPRI7 PLPRICHD [6..6]                                                  */
                             /* DMA_CHPRI7_PLPRICHD                                                       */
#define  DMA_CHPRI7_PLPRICHD_0                  0U     /* 0 : Channel n can suspend a lower priority channel.                       */
#define  DMA_CHPRI7_PLPRICHD_1                  1U     /* 1 : Channel n cannot suspend any channelU regardless of channel
                                                     priority.                                                                 */


/*                                                DMA CHPRI7 BPHPRICHEN [7..7]                                                 */
                              /* DMA_CHPRI7_BPHPRICHEN                                                     */
#define  DMA_CHPRI7_BPHPRICHEN_0                0U     /* 0 : Channel n cannot be suspended by a higher priority channels
                                                    service request.                                                          */
#define  DMA_CHPRI7_BPHPRICHEN_1                1U     /* 1 : Channel n can be temporarily suspended by the service request
                                                       of a higher priority channel.                                             */


/*                                                           CHPRI6                                                            */
/*                                                 DMA CHPRI6 PLPRICHD [6..6]                                                  */
                                     /* DMA_CHPRI6_PLPRICHD                                                       */
#define  DMA_CHPRI6_PLPRICHD_0                  0U     /* 0 : Channel n can suspend a lower priority channel.                       */
#define  DMA_CHPRI6_PLPRICHD_1                  1U     /* 1 : Channel n cannot suspend any channelU regardless of channel
                                                     priority.                                                                 */


/*                                                DMA CHPRI6 BPHPRICHEN [7..7]                                                 */
                                     /* DMA_CHPRI6_BPHPRICHEN                                                     */
 #define DMA_CHPRI6_BPHPRICHEN_0                0U     /* 0 : Channel n cannot be suspended by a higher priority channels
                                                 service request.                                                          */
 #define DMA_CHPRI6_BPHPRICHEN_1                1U     /* 1 : Channel n can be temporarily suspended by the service request
                                                   of a higher priority channel.                                             */


/*                                                           CHPRI5                                                            */
/*                                                 DMA CHPRI5 PLPRICHD [6..6]                                                  */
                                     /* DMA_CHPRI5_PLPRICHD                                                       */
 #define DMA_CHPRI5_PLPRICHD_0                  0U     /* 0 : Channel n can suspend a lower priority channel.                       */
 #define DMA_CHPRI5_PLPRICHD_1                  1U     /* 1 : Channel n cannot suspend any channelU regardless of channel
                                                     priority.                                                                 */


