MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/*                                                           CHPRI8                                                            */
/*                                                 DMA CHPRI8 PLPRICHD [6..6]                                                  */
                                     /* DMA_CHPRI8_PLPRICHD                                                       */
#define  DMA_CHPRI8_PLPRICHD_0                  0U     /* 0 : Channel n can suspend a lower priority channel.                       */
#define  DMA_CHPRI8_PLPRICHD_1                  1U     /* 1 : Channel n cannot suspend any channelU regardless of channel
                                                     priority.                                                                 */


/*                                                DMA CHPRI8 BPHPRICHEN [7..7]                                                 */
                             /* DMA_CHPRI8_BPHPRICHEN                                                     */
#define  DMA_CHPRI8_BPHPRICHEN_0                0U     /* 0 : Channel n cannot be suspended by a higher priority channels
                                                         service request.                                                          */
#define  DMA_CHPRI8_BPHPRICHEN_1                1U     /* 1 : Channel n can be temporarily suspended by the service request
                                                        of a higher priority channel.                                             */


/*                                                           CHPRI15                                                           */
/*                                                 DMA CHPRI15 PLPRICHD [6..6]                                                 */
                              /* DMA_CHPRI15_PLPRICHD                                                      */
#define  DMA_CHPRI15_PLPRICHD_0                 0U     /* 0 : Channel n can suspend a lower priority channel.                       */
#define  DMA_CHPRI15_PLPRICHD_1                 1U     /* 1 : Channel n cannot suspend any channelU regardless of channel
                                                     priority.                                                                 */


/*                                                DMA CHPRI15 BPHPRICHEN [7..7]                                                */
                               /* DMA_CHPRI15_BPHPRICHEN                                                    */
#define  DMA_CHPRI15_BPHPRICHEN_0               0U     /* 0 : Channel n cannot be suspended by a higher priority channels
                                                        service request.                                                          */
#define  DMA_CHPRI15_BPHPRICHEN_1               1U     /* 1 : Channel n can be temporarily suspended by the service request
                                                      of a higher priority channel.                                             */


/*                                                           CHPRI14                                                           */
/*                                                 DMA CHPRI14 PLPRICHD [6..6]                                                 */
                                    /* DMA_CHPRI14_PLPRICHD                                                      */
#define  DMA_CHPRI14_PLPRICHD_0                 0U     /* 0 : Channel n can suspend a lower priority channel.                       */
#define  DMA_CHPRI14_PLPRICHD_1                 1U     /* 1 : Channel n cannot suspend any channelU regardless of channel
                                                     priority.                                                                 */


/*                                                DMA CHPRI14 BPHPRICHEN [7..7]                                                */
                                /* DMA_CHPRI14_BPHPRICHEN                                                    */
 #define DMA_CHPRI14_BPHPRICHEN_0               0U     /* 0 : Channel n cannot be suspended by a higher priority channels
                                               service request.                                                          */
 #define DMA_CHPRI14_BPHPRICHEN_1               1U     /* 1 : Channel n can be temporarily suspended by the service request
                                                       of a higher priority channel.                                             */


/*                                                           CHPRI13                                                           */
/*                                                 DMA CHPRI13 PLPRICHD [6..6]                                                 */
                                   /* DMA_CHPRI13_PLPRICHD                                                      */
 #define DMA_CHPRI13_PLPRICHD_0                 0U     /* 0 : Channel n can suspend a lower priority channel.                       */
 #define DMA_CHPRI13_PLPRICHD_1                 1U     /* 1 : Channel n cannot suspend any channelU regardless of channel
                                                         priority.                                                                 */


/*                                                DMA CHPRI13 BPHPRICHEN [7..7]                                                */
                                  /* DMA_CHPRI13_BPHPRICHEN                                                    */
#define  DMA_CHPRI13_BPHPRICHEN_0               0U     /* 0 : Channel n cannot be suspended by a higher priority channels
                                                        service request.                                                          */
#define  DMA_CHPRI13_BPHPRICHEN_1               1U     /* 1 : Channel n can be temporarily suspended by the service request
                                                        of a higher priority channel.                                             */


/*                                                           CHPRI12                                                           */
/*                                                 DMA CHPRI12 PLPRICHD [6..6]                                                 */
                                   /* DMA_CHPRI12_PLPRICHD                                                      */
 #define DMA_CHPRI12_PLPRICHD_0                 0U     /* 0 : Channel n can suspend a lower priority channel.                       */
 #define DMA_CHPRI12_PLPRICHD_1                 1U     /* 1 : Channel n cannot suspend any channelU regardless of channel
                                                     priority.                                                                 */


/*                                                DMA CHPRI12 BPHPRICHEN [7..7]                                                */
                                /* DMA_CHPRI12_BPHPRICHEN                                                    */
 #define DMA_CHPRI12_BPHPRICHEN_0               0U     /* 0 : Channel n cannot be suspended by a higher priority channels
                                                        service request.                                                          */
 #define DMA_CHPRI12_BPHPRICHEN_1               1U     /* 1 : Channel n can be temporarily suspended by the service request
                                                        of a higher priority channel.                                             */


/*                                                         TCD_SADDR                                                          */
/*                                                        TCD_SADDROF                                                         */
/*                                                          TCD_TATT                                                          */
/*                                                DMA TCD_TATT STSIZE [8..10]                                                 */
                                      /* DMA_TCD_TATT_STSIZE                                                      */
#define  DMA_TCD_TATT_STSIZE_0                 0U     /* 0 : 8-bit                                                                 */
#define  DMA_TCD_TATT_STSIZE_1                 1U     /* 1 : 16-bit                                                                */
#define  DMA_TCD_TATT_STSIZE_10                2U     /* 10 : 32-bit                                                               */

/*                                               DMA TCD_TATT SADDRMV [11..15]                                                */
                                      /* DMA_TCD_TATT_SADDRMV                                                     */
#define  DMA_TCD_TATT_SADDRMV_0                0U     /* 0 : Source address modulo feature is disabled                             */


