MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/*                                               DMA TCD_CSTS MAJLCMPFLG [7..7]                                                */
                                    /* DMA_TCD_CSTS_MAJLCMPFLG                                                   */
#define  DMA_TCD_CSTS_MAJLCMPFLG_0              0U     /* 0 : Indicates the DMA has not completed the major loop.
                                                       This bit must be cleared to write the MAJILINKEN or SGFEN bits.*/
#define  DMA_TCD_CSTS_MAJLCMPFLG_1              1U     /* 1 : Indicates the DMA has completed the major loop.                            */

/*                                                DMA TCD_CSTS BWCTRL [14..15]                                                */
                                     /* DMA_TCD_CSTS_BWCTRL                                                      */
#define  DMA_TCD_CSTS_BWCTRL_0                 0U     /* 0 : No eDMA engine stalls.                                                */
#define  DMA_TCD_CSTS_BWCTRL_10                2U     /* 10 : eDMA engine stalls for 4 cycles after each R/W.                      */
#define  DMA_TCD_CSTS_BWCTRL_11                3U     /* 11 : eDMA engine stalls for 8 cycles after each R/W.                      */


/*                                                 TCD_MAJICNTSTAT_LINKD_DMA                                                  */
/*                                       DMA TCD_MAJICNTSTAT_LINKD_DMA LINKEN [15..15]                                        */
                                  /* DMA_TCD_MAJICNTSTAT_LINKD_DMA_LINKEN                                     */
#define  DMA_TCD_MAJICNTSTAT_LINKD_DMA_LINKEN_0   0U  /* 0 : The channel-to-channel linking is disabled                            */
#define  DMA_TCD_MAJICNTSTAT_LINKD_DMA_LINKEN_1   1U  /* 1 : The channel-to-channel linking is enabled                             */


/*                                                 TCD_MAJICNTSTAT_LINKEN_DMA                                                 */
/*                                     DMA TCD_MAJICNTSTAT_LINKEN_DMA LINKEN [15..15]                                      */
                                    /* DMA_TCD_MAJICNTSTAT_LINKEN_DMA_LINKEN                                 */
#define  DMA_TCD_MAJICNTSTAT_LINKEN_DMA_LINKEN_0   0U/* 0 : The channel-to-channel linking is disabled                          */
#define  DMA_TCD_MAJICNTSTAT_LINKEN_DMA_LINKEN_1   1U/* 1 : The channel-to-channel linking is enabled                           */


/*                                                                                                                             */
/*                                                             MPU                                                              */
/*                                                                                                                             */

/*                                                            CESTS                                                            */
/*                                                    MPU CESTS MPUEN [0..0]                                                     */
                                 /* MPU_CESTS_MPUEN                                                             */
#define  MPU_CESTS_MPUEN_0                        0U     /* 0 : MPU is disabled. All accesses from all bus masters are allowed.       */
#define  MPU_CESTS_MPUEN_1                        1U     /* 1 : MPU is enabled                                                        */


/*                                                   MPU CESTS RDINUM [8..11]                                                   */
                                 /* MPU_CESTS_RDINUM                                                           */
#define  MPU_CESTS_RDINUM_0000                   0U     /* 0000 : 8 region descriptors                                               */
#define  MPU_CESTS_RDINUM_0001                   1U     /* 0001 : 12 region descriptors                                              */
#define  MPU_CESTS_RDINUM_0010                   2U     /* 0010 : 16 region descriptors                                              */


/*                                                  MPU CESTS SPEFLG3 [28..28]                                                  */
                                 /* MPU_CESTS_SPEFLG3                                                          */
#define  MPU_CESTS_SPEFLG3_0                     0U     /* 0 : No error has occurred for slave port 3.                               */
#define  MPU_CESTS_SPEFLG3_1                     1U     /* 1 : An error has occurred for slave port 3.                               */


/*                                                  MPU CESTS SPEFLG2 [29..29]                                                  */
                                 /* MPU_CESTS_SPEFLG2                                                          */
#define  MPU_CESTS_SPEFLG2_0                     0U     /* 0 : No error has occurred for slave port 2.                               */
#define  MPU_CESTS_SPEFLG2_1                     1U     /* 1 : An error has occurred for slave port 2.                               */


/*                                                  MPU CESTS SPEFLG1 [30..30]                                                  */
                                 /* MPU_CESTS_SPEFLG1                                                          */
#define  MPU_CESTS_SPEFLG1_0                     0U     /* 0 : No error has occurred for slave port 1.                               */
#define  MPU_CESTS_SPEFLG1_1                     1U     /* 1 : An error has occurred for slave port 1.                               */


/*                                                  MPU CESTS SPEFLG0 [31..31]                                                  */
                                 /* MPU_CESTS_SPEFLG0                                                          */
#define  MPU_CESTS_SPEFLG0_0                     0U     /* 0 : No error has occurred for slave port 0.                               */
#define  MPU_CESTS_SPEFLG0_1                     1U     /* 1 : An error has occurred for slave port 0.                               */


/*                                                           EADDR0                                                            */
/*                                                          EDETAIL0                                                           */
/*                                                   MPU EDETAIL0 RWE [0..0]                                                    */
                                 /* MPU_EDETAIL0_RWE                                                           */
#define  MPU_EDETAIL0_RWE_0                      0U     /* 0 : Read                                                                  */
#define  MPU_EDETAIL0_RWE_1                      1U     /* 1 : Write                                                                 */


/*                                                  MPU EDETAIL0 AINFOE [1..3]                                                  */
                                 /* MPU_EDETAIL0_AINFOE                                                        */
#define  MPU_EDETAIL0_AINFOE_000                 0U     /* 000 : User modeU instruction access                                       */
#define  MPU_EDETAIL0_AINFOE_001                 1U     /* 001 : User modeU data access                                              */
#define  MPU_EDETAIL0_AINFOE_010                 2U     /* 010 : Supervisor modeU instruction access                                 */
#define  MPU_EDETAIL0_AINFOE_011                 3U     /* 011 : Supervisor modeU data access                                        */


/*                                                           EADDR1                                                            */
/*                                                          EDETAIL1                                                           */
/*                                                   MPU EDETAIL1 RWE [0..0]                                                    */
                                 /* MPU_EDETAIL1_RWE                                                           */
 #define MPU_EDETAIL1_RWE_0                      0U     /* 0 : Read                                                                  */
 #define MPU_EDETAIL1_RWE_1                      1U     /* 1 : Write                                                                 */


/*                                                  MPU EDETAIL1 AINFOE [1..3]                                                  */
                                 /* MPU_EDETAIL1_AINFOE                                                        */
 #define MPU_EDETAIL1_AINFOE_000                 0U     /* 000 : User modeU instruction access                                       */
 #define MPU_EDETAIL1_AINFOE_001                 1U     /* 001 : User modeU data access                                              */
 #define MPU_EDETAIL1_AINFOE_010                 2U     /* 010 : Supervisor modeU instruction access                                 */
 #define MPU_EDETAIL1_AINFOE_011                 3U     /* 011 : Supervisor modeU data access                                        */


/*                                                           EADDR2                                                            */
/*                                                          EDETAIL2                                                           */
/*                                                   MPU EDETAIL2 RWE [0..0]                                                    */
                                 /* MPU_EDETAIL2_RWE                                                           */
#define  MPU_EDETAIL2_RWE_0                      0U     /* 0 : Read                                                                  */
#define  MPU_EDETAIL2_RWE_1                      1U     /* 1 : Write                                                                 */


/*                                                  MPU EDETAIL2 AINFOE [1..3]                                                  */
                                 /* MPU_EDETAIL2_AINFOE                                                        */
#define  MPU_EDETAIL2_AINFOE_000                 0U     /* 000 : User modeU instruction access                                       */
#define  MPU_EDETAIL2_AINFOE_001                 1U     /* 001 : User modeU data access                                              */
#define  MPU_EDETAIL2_AINFOE_010                 2U     /* 010 : Supervisor modeU instruction access                                 */
#define  MPU_EDETAIL2_AINFOE_011                 3U     /* 011 : Supervisor modeU data access                                        */


/*                                                           EADDR3                                                            */
/*                                                          EDETAIL3                                                           */
/*                                                   MPU EDETAIL3 RWE [0..0]                                                    */
                                 /* MPU_EDETAIL3_RWE                                                           */
 #define MPU_EDETAIL3_RWE_0                      0U     /* 0 : Read                                                                  */
 #define MPU_EDETAIL3_RWE_1                      1U     /* 1 : Write                                                                 */


/*                                                  MPU EDETAIL3 AINFOE [1..3]                                                  */
                                 /* MPU_EDETAIL3_AINFOE                                                        */
#define  MPU_EDETAIL3_AINFOE_000                 0U     /* 000 : User modeU instruction access                                       */
#define  MPU_EDETAIL3_AINFOE_001                 1U     /* 001 : User modeU data access                                              */
#define  MPU_EDETAIL3_AINFOE_010                 2U     /* 010 : Supervisor modeU instruction access                                 */
#define  MPU_EDETAIL3_AINFOE_011                 3U     /* 011 : Supervisor modeU data access                                        */


