MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/*                                                         REGD7_WORD0                                                         */
/*                                                         REGD7_WORD1                                                         */
/*                                                         REGD7_WORD2                                                         */
/*                                               MPU REGD7_WORD2 SMCTRLM0 [3..4]                                                */
                                 /* MPU_REGD7_WORD2_SMCTRLM0                                                   */
#define  MPU_REGD7_WORD2_SMCTRLM0_0              0U     /* 0 : r/w/x; readU write and execute allowed                                */
#define  MPU_REGD7_WORD2_SMCTRLM0_1              1U     /* 1 : r/x; read and execute allowedU but no write                           */
#define  MPU_REGD7_WORD2_SMCTRLM0_10             2U     /* 10 : r/w; read and write allowedU but no execute                          */
#define  MPU_REGD7_WORD2_SMCTRLM0_11             3U     /* 11 : Same as User mode defined in M0UM                                    */


/*                                                MPU REGD7_WORD2 PIDENM0 [5..5]                                                */
                                 /* MPU_REGD7_WORD2_PIDENM0                                                    */
#define  MPU_REGD7_WORD2_PIDENM0_0               0U     /* 0 : Do not include the process identifier in the evaluation               */
#define  MPU_REGD7_WORD2_PIDENM0_1               1U     /* 1 : Include the process identifier and mask (RGDn.RGDAACC) in
                                                     the region hit evaluation                                                 */


/*                                               MPU REGD7_WORD2 SMCTRLM1 [9..10]                                               */
                                 /* MPU_REGD7_WORD2_SMCTRLM1                                                   */
#define  MPU_REGD7_WORD2_SMCTRLM1_0              0U     /* 0 : r/w/x; readU write and execute allowed                                */
#define  MPU_REGD7_WORD2_SMCTRLM1_1              1U     /* 1 : r/x; read and execute allowedU but no write                           */
#define  MPU_REGD7_WORD2_SMCTRLM1_10             2U     /* 10 : r/w; read and write allowedU but no execute                          */
#define  MPU_REGD7_WORD2_SMCTRLM1_11             3U     /* 11 : Same as User mode defined in M1UM                                    */


/*                                               MPU REGD7_WORD2 PIDENM1 [11..11]                                               */
                                 /* MPU_REGD7_WORD2_PIDENM1                                                    */
#define  MPU_REGD7_WORD2_PIDENM1_0               0U     /* 0 : Do not include the process identifier in the evaluation               */
#define  MPU_REGD7_WORD2_PIDENM1_1               1U     /* 1 : Include the process identifier and mask (RGDn.RGDAACC) in
                                                     the region hit evaluation                                                 */


/*                                              MPU REGD7_WORD2 SMCTRLM2 [15..16]                                               */
                                 /* MPU_REGD7_WORD2_SMCTRLM2                                                   */
#define  MPU_REGD7_WORD2_SMCTRLM2_0              0U     /* 0 : r/w/x; readU write and execute allowed                                */
#define  MPU_REGD7_WORD2_SMCTRLM2_1              1U     /* 1 : r/x; read and execute allowedU but no write                           */
#define  MPU_REGD7_WORD2_SMCTRLM2_10             2U     /* 10 : r/w; read and write allowedU but no execute                          */
#define  MPU_REGD7_WORD2_SMCTRLM2_11             3U     /* 11 : Same as User mode defined in M2UM                                    */


/*                                              MPU REGD7_WORD2 SMCTRLM3 [21..22]                                               */
                                 /* MPU_REGD7_WORD2_SMCTRLM3                                                   */
#define  MPU_REGD7_WORD2_SMCTRLM3_0              0U     /* 0 : r/w/x; readU write and execute allowed                                */
#define  MPU_REGD7_WORD2_SMCTRLM3_1              1U     /* 1 : r/x; read and execute allowedU but no write                           */
#define  MPU_REGD7_WORD2_SMCTRLM3_10             2U     /* 10 : r/w; read and write allowedU but no execute                          */
#define  MPU_REGD7_WORD2_SMCTRLM3_11             3U     /* 11 : Same as User mode defined in M3UM                                    */


/*                                                MPU REGD7_WORD2 WENM4 [24..24]                                                */
                                 /* MPU_REGD7_WORD2_WENM4                                                      */
#define  MPU_REGD7_WORD2_WENM4_0                 0U     /* 0 : Bus master 4 writes terminate with an access error and the
                                                         write is not performed                                                    */
#define  MPU_REGD7_WORD2_WENM4_1                 1U     /* 1 : Bus master 4 writes allowed                                           */


/*                                                MPU REGD7_WORD2 RENM4 [25..25]                                                */
                                 /* MPU_REGD7_WORD2_RENM4                                                      */
#define  MPU_REGD7_WORD2_RENM4_0                 0U     /* 0 : Bus master 4 reads terminate with an access error and the
                                                 read is not performed                                                     */
#define  MPU_REGD7_WORD2_RENM4_1                 1U     /* 1 : Bus master 4 reads allowed                                            */


