MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/*                                                MPU REGD7_WORD2 WENM5 [26..26]                                                */
                                 /* MPU_REGD7_WORD2_WENM5                                                      */
#define  MPU_REGD7_WORD2_WENM5_0                 0U     /* 0 : Bus master 5 writes terminate with an access error and the
                                                     write is not performed                                                    */
#define  MPU_REGD7_WORD2_WENM5_1                 1U     /* 1 : Bus master 5 writes allowed                                           */


/*                                                MPU REGD7_WORD2 RENM5 [27..27]                                                */
                                 /* MPU_REGD7_WORD2_RENM5                                                      */
#define  MPU_REGD7_WORD2_RENM5_0                 0U     /* 0 : Bus master 5 reads terminate with an access error and the
                                                     read is not performed                                                     */
#define  MPU_REGD7_WORD2_RENM5_1                 1U     /* 1 : Bus master 5 reads allowed                                            */


/*                                                MPU REGD7_WORD2 WENM6 [28..28]                                                */
                                 /* MPU_REGD7_WORD2_WENM6                                                      */
#define  MPU_REGD7_WORD2_WENM6_0                 0U     /* 0 : Bus master 6 writes terminate with an access error and the
                                                       write is not performed                                                    */
#define  MPU_REGD7_WORD2_WENM6_1                 1U     /* 1 : Bus master 6 writes allowed                                           */


/*                                                MPU REGD7_WORD2 RENM6 [29..29]                                                */
                                 /* MPU_REGD7_WORD2_RENM6                                                      */
#define  MPU_REGD7_WORD2_RENM6_0                 0U     /* 0 : Bus master 6 reads terminate with an access error and the
                                                     read is not performed                                                     */
#define  MPU_REGD7_WORD2_RENM6_1                 1U     /* 1 : Bus master 6 reads allowed                                            */


/*                                                MPU REGD7_WORD2 WENM7 [30..30]                                                */
                                 /* MPU_REGD7_WORD2_WENM7                                                      */
#define  MPU_REGD7_WORD2_WENM7_0                 0U     /* 0 : Bus master 7 writes terminate with an access error and the
                                                  write is not performed                                                    */
#define  MPU_REGD7_WORD2_WENM7_1                 1U     /* 1 : Bus master 7 writes allowed                                           */


/*                                                MPU REGD7_WORD2 RENM7 [31..31]                                                */
                                 /* MPU_REGD7_WORD2_RENM7                                                      */
#define  MPU_REGD7_WORD2_RENM7_0                 0U     /* 0 : Bus master 7 reads terminate with an access error and the
                                                      read is not performed                                                     */
#define  MPU_REGD7_WORD2_RENM7_1                 1U     /* 1 : Bus master 7 reads allowed                                            */


/*                                                         REGD7_WORD3                                                         */
/*                                                MPU REGD7_WORD3 RDVALID [0..0]                                                */
                                 /* MPU_REGD7_WORD3_RDVALID                                                    */
#define  MPU_REGD7_WORD3_RDVALID_0               0U     /* 0 : Region descriptor is invalid                                          */
#define  MPU_REGD7_WORD3_RDVALID_1               1U     /* 1 : Region descriptor is valid                                            */


/*                                                          RGDAACC0                                                           */
/*                                                 MPU RGDAACC0 SMCTRLM0 [3..4]                                                 */
                                 /* MPU_RGDAACC0_SMCTRLM0                                                      */
#define  MPU_RGDAACC0_SMCTRLM0_0                 0U     /* 0 : r/w/x; readU write and execute allowed                                */
#define  MPU_RGDAACC0_SMCTRLM0_1                 1U     /* 1 : r/x; read and execute allowedU but no write                           */
#define  MPU_RGDAACC0_SMCTRLM0_10                2U     /* 10 : r/w; read and write allowedU but no execute                          */
#define  MPU_RGDAACC0_SMCTRLM0_11                3U     /* 11 : Same as User mode defined in M0UM                                    */


/*                                                 MPU RGDAACC0 PIDENM0 [5..5]                                                  */
                                 /* MPU_RGDAACC0_PIDENM0                                                       */
#define  MPU_RGDAACC0_PIDENM0_0                  0U     /* 0 : Do not include the process identifier in the evaluation               */
#define  MPU_RGDAACC0_PIDENM0_1                  1U     /* 1 : Include the process identifier and mask (RGDn.RGDAACC) in
                                                     the region hit evaluation                                                 */


