MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/*                                                MPU RGDAACC0 SMCTRLM1 [9..10]                                                 */
                                 /* MPU_RGDAACC0_SMCTRLM1                                                      */
#define  MPU_RGDAACC0_SMCTRLM1_0                 0U     /* 0 : r/w/x; readU write and execute allowed                                */
#define  MPU_RGDAACC0_SMCTRLM1_1                 1U     /* 1 : r/x; read and execute allowedU but no write                           */
#define  MPU_RGDAACC0_SMCTRLM1_10                2U     /* 10 : r/w; read and write allowedU but no execute                          */
#define  MPU_RGDAACC0_SMCTRLM1_11                3U     /* 11 : Same as User mode defined in M1UM                                    */


/*                                                MPU RGDAACC0 PIDENM1 [11..11]                                                 */
                                 /* MPU_RGDAACC0_PIDENM1                                                       */
#define  MPU_RGDAACC0_PIDENM1_0                  0U     /* 0 : Do not include the process identifier in the evaluation               */
#define  MPU_RGDAACC0_PIDENM1_1                  1U     /* 1 : Include the process identifier and mask (RGDn.RGDAACC) in
                                                     the region hit evaluation                                                 */


/*                                                MPU RGDAACC0 SMCTRLM2 [15..16]                                                */
                                 /* MPU_RGDAACC0_SMCTRLM2                                                      */
#define  MPU_RGDAACC0_SMCTRLM2_0                 0U     /* 0 : r/w/x; readU write and execute allowed                                */
#define  MPU_RGDAACC0_SMCTRLM2_1                 1U     /* 1 : r/x; read and execute allowedU but no write                           */
#define  MPU_RGDAACC0_SMCTRLM2_10                2U     /* 10 : r/w; read and write allowedU but no execute                          */
#define  MPU_RGDAACC0_SMCTRLM2_11                3U     /* 11 : Same as User mode defined in M2UM                                    */


/*                                                MPU RGDAACC0 SMCTRLM3 [21..22]                                                */
                                 /* MPU_RGDAACC0_SMCTRLM3                                                      */
#define  MPU_RGDAACC0_SMCTRLM3_0                 0U     /* 0 : r/w/x; readU write and execute allowed                                */
#define  MPU_RGDAACC0_SMCTRLM3_1                 1U     /* 1 : r/x; read and execute allowedU but no write                           */
#define  MPU_RGDAACC0_SMCTRLM3_10                2U     /* 10 : r/w; read and write allowedU but no execute                          */
#define  MPU_RGDAACC0_SMCTRLM3_11                3U     /* 11 : Same as User mode defined in M3UM                                    */


/*                                                 MPU RGDAACC0 WENM4 [24..24]                                                  */
                                 /* MPU_RGDAACC0_WENM4                                                         */
#define  MPU_RGDAACC0_WENM4_0                    0U     /* 0 : Bus master 4 writes terminate with an access error and the
                                                         write is not performed                                                    */
#define  MPU_RGDAACC0_WENM4_1                    1U     /* 1 : Bus master 4 writes allowed                                           */


/*                                                 MPU RGDAACC0 RENM4 [25..25]                                                  */
                                 /* MPU_RGDAACC0_RENM4                                                         */
#define  MPU_RGDAACC0_RENM4_0                    0U     /* 0 : Bus master 4 reads terminate with an access error and the
                                                read is not performed                                                     */
#define  MPU_RGDAACC0_RENM4_1                    1U     /* 1 : Bus master 4 reads allowed                                            */


/*                                                 MPU RGDAACC0 WENM5 [26..26]                                                  */
                                 /* MPU_RGDAACC0_WENM5                                                         */
#define  MPU_RGDAACC0_WENM5_0                    0U     /* 0 : Bus master 5 writes terminate with an access error and the
                                                   write is not performed                                                    */
#define  MPU_RGDAACC0_WENM5_1                    1U     /* 1 : Bus master 5 writes allowed                                           */


/*                                                 MPU RGDAACC0 RENM5 [27..27]                                                  */
                                 /* MPU_RGDAACC0_RENM5                                                         */
#define  MPU_RGDAACC0_RENM5_0                    0U     /* 0 : Bus master 5 reads terminate with an access error and the
                                                      read is not performed                                                     */
#define  MPU_RGDAACC0_RENM5_1                    1U     /* 1 : Bus master 5 reads allowed                                            */


/*                                                 MPU RGDAACC0 WENM6 [28..28]                                                  */
                                 /* MPU_RGDAACC0_WENM6                                                         */
#define  MPU_RGDAACC0_WENM6_0                    0U     /* 0 : Bus master 6 writes terminate with an access error and the
                                                write is not performed                                                    */
#define  MPU_RGDAACC0_WENM6_1                    1U     /* 1 : Bus master 6 writes allowed                                           */


