MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/*                                                 MPU RGDAACC4 RENM5 [27..27]                                                  */
                                 /* MPU_RGDAACC4_RENM5                                                         */
#define  MPU_RGDAACC4_RENM5_0                    0U     /* 0 : Bus master 5 reads terminate with an access error and the
                                                   read is not performed                                                     */
#define  MPU_RGDAACC4_RENM5_1                    1U     /* 1 : Bus master 5 reads allowed                                            */


/*                                                 MPU RGDAACC4 WENM6 [28..28]                                                  */
                                 /* MPU_RGDAACC4_WENM6                                                         */
#define  MPU_RGDAACC4_WENM6_0                    0U     /* 0 : Bus master 6 writes terminate with an access error and the
                                                write is not performed                                                    */
#define  MPU_RGDAACC4_WENM6_1                    1U     /* 1 : Bus master 6 writes allowed                                           */


/*                                                 MPU RGDAACC4 RENM6 [29..29]                                                  */
                                 /* MPU_RGDAACC4_RENM6                                                         */
#define  MPU_RGDAACC4_RENM6_0                    0U     /* 0 : Bus master 6 reads terminate with an access error and the
                                                   read is not performed                                                     */
#define  MPU_RGDAACC4_RENM6_1                    1U     /* 1 : Bus master 6 reads allowed                                            */


/*                                                 MPU RGDAACC4 WENM7 [30..30]                                                  */
                                 /* MPU_RGDAACC4_WENM7                                                         */
#define  MPU_RGDAACC4_WENM7_0                    0U     /* 0 : Bus master 7 writes terminate with an access error and the
                                                        write is not performed                                                    */
#define  MPU_RGDAACC4_WENM7_1                    1U     /* 1 : Bus master 7 writes allowed                                           */


/*                                                 MPU RGDAACC4 RENM7 [31..31]                                                  */
                                 /* MPU_RGDAACC4_RENM7                                                         */
#define  MPU_RGDAACC4_RENM7_0                    0U     /* 0 : Bus master 7 reads terminate with an access error and the
                                                        read is not performed                                                     */
#define  MPU_RGDAACC4_RENM7_1                    1U     /* 1 : Bus master 7 reads allowed                                            */


/*                                                          RGDAACC5                                                           */
/*                                                 MPU RGDAACC5 SMCTRLM0 [3..4]                                                 */
                                 /* MPU_RGDAACC5_SMCTRLM0                                                      */
#define  MPU_RGDAACC5_SMCTRLM0_0                 0U     /* 0 : r/w/x; readU write and execute allowed                                */
#define  MPU_RGDAACC5_SMCTRLM0_1                 1U     /* 1 : r/x; read and execute allowedU but no write                           */
#define  MPU_RGDAACC5_SMCTRLM0_10                2U     /* 10 : r/w; read and write allowedU but no execute                          */
#define  MPU_RGDAACC5_SMCTRLM0_11                3U     /* 11 : Same as User mode defined in M0UM                                    */


/*                                                 MPU RGDAACC5 PIDENM0 [5..5]                                                  */
                                 /* MPU_RGDAACC5_PIDENM0                                                       */
#define  MPU_RGDAACC5_PIDENM0_0                  0U     /* 0 : Do not include the process identifier in the evaluation               */
#define  MPU_RGDAACC5_PIDENM0_1                  1U     /* 1 : Include the process identifier and mask (RGDn.RGDAACC) in
                                                     the region hit evaluation                                                 */


/*                                                MPU RGDAACC5 SMCTRLM1 [9..10]                                                 */
                                 /* MPU_RGDAACC5_SMCTRLM1                                                      */
#define  MPU_RGDAACC5_SMCTRLM1_0                 0U     /* 0 : r/w/x; readU write and execute allowed                                */
#define  MPU_RGDAACC5_SMCTRLM1_1                 1U     /* 1 : r/x; read and execute allowedU but no write                           */
#define  MPU_RGDAACC5_SMCTRLM1_10                2U     /* 10 : r/w; read and write allowedU but no execute                          */
#define  MPU_RGDAACC5_SMCTRLM1_11                3U     /* 11 : Same as User mode defined in M1UM                                    */


/*                                                MPU RGDAACC5 PIDENM1 [11..11]                                                 */
                                 /* MPU_RGDAACC5_PIDENM1                                                       */
#define  MPU_RGDAACC5_PIDENM1_0                  0U     /* 0 : Do not include the process identifier in the evaluation               */
#define  MPU_RGDAACC5_PIDENM1_1                  1U     /* 1 : Include the process identifier and mask (RGDn.RGDAACC) in
                                                     the region hit evaluation                                                 */


/*                                                MPU RGDAACC5 SMCTRLM2 [15..16]                                                */
                                 /* MPU_RGDAACC5_SMCTRLM2                                                      */
#define  MPU_RGDAACC5_SMCTRLM2_0                 0U     /* 0 : r/w/x; readU write and execute allowed                                */
#define  MPU_RGDAACC5_SMCTRLM2_1                 1U     /* 1 : r/x; read and execute allowedU but no write                           */
#define  MPU_RGDAACC5_SMCTRLM2_10                2U     /* 10 : r/w; read and write allowedU but no execute                          */
#define  MPU_RGDAACC5_SMCTRLM2_11                3U     /* 11 : Same as User mode defined in M2UM                                    */


/*                                                MPU RGDAACC5 SMCTRLM3 [21..22]                                                */
                                 /* MPU_RGDAACC5_SMCTRLM3                                                      */
#define  MPU_RGDAACC5_SMCTRLM3_0                 0U     /* 0 : r/w/x; readU write and execute allowed                                */
#define  MPU_RGDAACC5_SMCTRLM3_1                 1U     /* 1 : r/x; read and execute allowedU but no write                           */
#define  MPU_RGDAACC5_SMCTRLM3_10                2U     /* 10 : r/w; read and write allowedU but no execute                          */
#define  MPU_RGDAACC5_SMCTRLM3_11                3U     /* 11 : Same as User mode defined in M3UM                                    */


/*                                                 MPU RGDAACC5 WENM4 [24..24]                                                  */
                                 /* MPU_RGDAACC5_WENM4                                                         */
#define  MPU_RGDAACC5_WENM4_0                    0U     /* 0 : Bus master 4 writes terminate with an access error and the
                                                        write is not performed                                                    */
#define  MPU_RGDAACC5_WENM4_1                    1U     /* 1 : Bus master 4 writes allowed                                           */


