MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ========================================================  CSECSTS  ======================================================== */
/* ========================================================  ESTS  ========================================================= */
/* ==============================================  FLASH ESTS DBFIFLG [1..1]  ============================================== */
                                 /* FLASH_ESTS_DBFIFLG                                                      */
#define  FLASH_ESTS_DBFIFLG_0                 0U     /* 0 : Double bit fault not detected during a valid flash read
                                                        access from the platform flash controller                                 */
#define  FLASH_ESTS_DBFIFLG_1                 1U     /* 1 : Double bit fault detected (or FERCNFG[FDFD] is set) during
                                                       a valid flash read access from the platform flash controller              */


/* ========================================================  ECFG  ========================================================= */
/* ==============================================  FLASH ECFG DBFIEN [1..1]  =============================================== */
                                 /* FLASH_ECFG_DBFIEN                                                       */
#define  FLASH_ECFG_DBFIEN_0                  0U     /* 0 : Double bit fault detect interrupt disabled                            */
#define  FLASH_ECFG_DBFIEN_1                  1U     /* 1 : Double bit fault detect interrupt enabled. An interrupt
                                                     request is generated whenever the FERSTAT[DFDIF] flag is
                                                     set.                                                                      */


/* =============================================  FLASH ECFG EDBFINTD [5..5]  ============================================== */
                                 /* FLASH_ECFG_EDBFINTD                                                     */
#define  FLASH_ECFG_EDBFINTD_0                0U     /* 0 : FERSTAT[DFDIF] sets only if a double bit fault is detected
                                                        during read access from the platform flash controller                     */
#define  FLASH_ECFG_EDBFINTD_1                1U     /* 1 : FERSTAT[DFDIF] sets during any valid flash read access from
                                                       the platform flash controller. An interrupt request is
                                                     generated if the DFDIE bit is set.                                        */




/* =========================================================================================================================== */
/* ================                                          DMACHM                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  CFG  ========================================================= */
/* =============================================  DMACHM CFG PRDTREN [6..6]  ============================================== */
                                 /* DMACHM_CFG_PRDTREN                                                     */
#define  DMACHM_CFG_PRDTREN_0                0U     /* 0 : Triggering is disabled. If triggering is disabled and ENBL
                                                      is setU the DMA Channel will simply route the specified
                                                     source to the DMA channel. (Normal mode)                                  */
#define  DMACHM_CFG_PRDTREN_1                1U     /* 1 : Triggering is enabled. If triggering is enabled and ENBL
                                                        is setU the DMAMUX is in Periodic Trigger mode.                           */


/* ===============================================  DMACHM CFG CHEN [7..7]  =============================================== */
                                 /* DMACHM_CFG_CHEN                                                        */
#define  DMACHM_CFG_CHEN_0                   0U     /* 0 : DMA channel is disabled. This mode is primarily used during
                                                        configuration of the DMAMux. The DMA has separate channel
                                                     enables/disablesU which should be used to disable or reconfigure
                                                     a DMA channel.                                                            */
#define  DMACHM_CFG_CHEN_1                   1U     /* 1 : DMA channel is enabled                                                */




/* =========================================================================================================================== */
/* ================                                           CAN                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  MCFG  ========================================================== */
/* ================================================  CAN MCFG IDFFMT [8..9]  ================================================ */
                                  /* CAN_MCFG_IDFFMT                                                          */
#define  CAN_MCFG_IDFFMT_00                    0U     /* 00 : Format A: One full ID (standard and extended) per ID Filter
                                                     Table element.                                                            */
#define  CAN_MCFG_IDFFMT_01                    1U     /* 01 : Format B: Two full standard IDs or two partial 14-bit (standard
                                                     and extended) IDs per ID Filter Table element.                            */
#define  CAN_MCFG_IDFFMT_10                    2U     /* 10 : Format C: Four partial 8-bit Standard IDs per ID Filter
                                                     Table element.                                                            */
#define  CAN_MCFG_IDFFMT_11                    3U     /* 11 : Format D: All frames rejected.                                       */


/* ==============================================  CAN MCFG CANFDEN [11..11]  =============================================== */
                                  /* CAN_MCFG_CANFDEN                                                         */
#define  CAN_MCFG_CANFDEN_1                    1U     /* 1 : CAN FD is enabled. CAN is able to receive and transmit
                                                     messages in both CAN FD and CAN 2.0 formats.                              */
#define  CAN_MCFG_CANFDEN_0                    0U     /* 0 : CAN FD is disabled. CAN is able to receive and transmit
                                                     messages in CAN 2.0 format.                                               */


/* ================================================  CAN MCFG TAEN [12..12]  ================================================ */
                                  /* CAN_MCFG_TAEN                                                            */
#define  CAN_MCFG_TAEN_0                       0U     /* 0 : Abort disabled.                                                       */
#define  CAN_MCFG_TAEN_1                       1U     /* 1 : Abort enabled.                                                        */


/* ===============================================  CAN MCFG LPRIEN [13..13]  =============================================== */
                                  /* CAN_MCFG_LPRIEN                                                          */
#define  CAN_MCFG_LPRIEN_0                     0U     /* 0 : Local Priority disabled.                                              */
#define  CAN_MCFG_LPRIEN_1                     1U     /* 1 : Local Priority enabled.                                               */


/* ================================================  CAN MCFG PNEN [14..14]  ================================================ */
                                  /* CAN_MCFG_PNEN                                                            */
#define  CAN_MCFG_PNEN_0                       0U     /* 0 : Pretended Networking mode is disabled.                                */
#define  CAN_MCFG_PNEN_1                       1U     /* 1 : Pretended Networking mode is enabled.                                 */


/* =================================                CAN MCFG DMAEN [15..15]                                                   */
                                  /* CAN_MCFG_DMAEN                                                           */
#define  CAN_MCFG_DMAEN_0                      0U     /* 0 : DMA feature for RX FIFO disabled.                                     */
#define  CAN_MCFG_DMAEN_1                      1U     /* 1 : DMA feature for RX FIFO enabled.                                      */


/* ==============================================  CAN MCFG IRXMQEN [16..16]  =============================================== */
                                  /* CAN_MCFG_IRXMQEN                                                         */
#define  CAN_MCFG_IRXMQEN_0                    0U     /* 0 : Individual Rx masking and queue feature are disabled. For
                                                        backward compatibility with legacy applicationsU the reading
                                                     of C/S word locks the MB even if it is EMPTY.                             */
#define  CAN_MCFG_IRXMQEN_1                    1U     /* 1 : Individual Rx masking and queue feature are enabled.                  */


