MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ================================================  CAN CTRL1 LOEN [3..3]  ================================================= */
                                  /* CAN_CTRL1_LOEN                                                           */
#define  CAN_CTRL1_LOEN_0                      0U     /* 0 : Listen-Only mode is deactivated.                                      */
#define  CAN_CTRL1_LOEN_1                      1U     /* 1 : CAN module operates in Listen-Only mode.                          */


/* ================================================  CAN CTRL1 TXLB [4..4]  ================================================= */
                                  /* CAN_CTRL1_TXLB                                                           */
#define  CAN_CTRL1_TXLB_0                      0U     /* 0 : Buffer with highest priority is transmitted first.                    */
#define  CAN_CTRL1_TXLB_1                      1U     /* 1 : Lowest number buffer is transmitted first.                            */


/* ===============================================  CAN CTRL1 TMRSYN [5..5]  ================================================ */
                                  /* CAN_CTRL1_TMRSYN                                                         */
#define  CAN_CTRL1_TMRSYN_0                    0U     /* 0 : Timer Sync feature disabled                                           */
#define  CAN_CTRL1_TMRSYN_1                    1U     /* 1 : Timer Sync feature enabled                                            */


/* ================================================  CAN CTRL1 BORD [6..6]  ================================================= */
                                  /* CAN_CTRL1_BORD                                                           */
#define  CAN_CTRL1_BORD_0                      0U     /* 0 : Automatic recovering from Bus Off state enabled.                      */
#define  CAN_CTRL1_BORD_1                      1U     /* 1 : Automatic recovering from Bus Off state disabled.                     */


/* ================================================  CAN CTRL1 TSEN [7..7]  ================================================= */
                                  /* CAN_CTRL1_TSEN                                                           */
#define  CAN_CTRL1_TSEN_0                      0U     /* 0 : Just one sample is used to determine the bit value.                   */
#define  CAN_CTRL1_TSEN_1                      1U     /* 1 : Three samples are used to determine the value of the received
                                                     bit: the regular one (sample point) and 2 preceding samples;
                                                     a majority rule is used.                                                  */


/* ==============================================  CAN CTRL1 RXWIEN [10..10]  =============================================== */
                                  /* CAN_CTRL1_RXWIEN                                                         */
#define  CAN_CTRL1_RXWIEN_0                    0U     /* 0 : Rx Warning Interrupt disabled.                                        */
#define  CAN_CTRL1_RXWIEN_1                    1U     /* 1 : Rx Warning Interrupt enabled.                                         */


/* ==============================================  CAN CTRL1 TXWIEN [11..11]  =============================================== */
                                  /* CAN_CTRL1_TXWIEN                                                         */
#define  CAN_CTRL1_TXWIEN_0                    0U     /* 0 : Tx Warning Interrupt disabled.                                        */
#define  CAN_CTRL1_TXWIEN_1                    1U     /* 1 : Tx Warning Interrupt enabled.                                         */


/* ===============================================  CAN CTRL1 LBEN [12..12]  ================================================ */
                                  /* CAN_CTRL1_LBEN                                                           */
#define  CAN_CTRL1_LBEN_0                      0U     /* 0 : Loop Back disabled.                                                   */
#define  CAN_CTRL1_LBEN_1                      1U     /* 1 : Loop Back enabled.                                                    */


/* ==============================================  CAN CTRL1 CLKSEL [13..13]  =============================================== */
                                  /* CAN_CTRL1_CLKSEL                                                         */
#define  CAN_CTRL1_CLKSEL_0                    0U     /* 0 : The CAN engine clock source is the oscillator clock. Under
                                                         this conditionU the oscillator clock frequency must be
                                                     lower than the bus clock.                                                 */
#define  CAN_CTRL1_CLKSEL_1                    1U     /* 1 : The CAN engine clock source is the peripheral clock.                  */


/* ===============================================  CAN CTRL1 ERRIEN [14..14]  ================================================ */
                                  /* CAN_CTRL1_ERRIEN                                                           */
#define  CAN_CTRL1_ERRIEN_0                      0U     /* 0 : Error interrupt disabled.                                             */
#define  CAN_CTRL1_ERRIEN_1                      1U     /* 1 : Error interrupt enabled.                                              */


/* ===============================================  CAN CTRL1 BOIEN [15..15]  =============================================== */
                                  /* CAN_CTRL1_BOIEN                                                          */
#define  CAN_CTRL1_BOIEN_0                     0U     /* 0 : Bus Off interrupt disabled.                                           */
#define  CAN_CTRL1_BOIEN_1                     1U     /* 1 : Bus Off interrupt enabled.                                            */

/* ===============================================  CAN CTRL1 PBS2 [16..18]  =============================================== */
                                  /* CAN_CTRL1_PBS2                                                          */
#define  CAN_CTRL1_PBS2_1                     1U     /* 1 : the length of phase segment 2 in the bit time is 1.      */
#define  CAN_CTRL1_PBS2_2                     2U     /* 2 : the length of phase segment 2 in the bit time is 2.      */
#define  CAN_CTRL1_PBS2_3                     3U     /* 3 : the length of phase segment 2 in the bit time is 3.      */
#define  CAN_CTRL1_PBS2_4                     4U     /* 4 : the length of phase segment 2 in the bit time is 4.      */
#define  CAN_CTRL1_PBS2_5                     5U     /* 5 : the length of phase segment 2 in the bit time is 5.      */
#define  CAN_CTRL1_PBS2_6                     6U     /* 6 : the length of phase segment 2 in the bit time is 6.      */
#define  CAN_CTRL1_PBS2_7                     7U     /* 7 : the length of phase segment 2 in the bit time is 7.      */

/* ===============================================  CAN CTRL1 PBS1 [19..21]  =============================================== */
                                  /* CAN_CTRL1_PBS1                                                          */
#define  CAN_CTRL1_PBS1_0                     0U     /* 0 : the length of phase segment 1 in the bit time is 0.      */
#define  CAN_CTRL1_PBS1_1                     1U     /* 1 : the length of phase segment 1 in the bit time is 1.      */
#define  CAN_CTRL1_PBS1_2                     2U     /* 2 : the length of phase segment 1 in the bit time is 2.      */
#define  CAN_CTRL1_PBS1_3                     3U     /* 3 : the length of phase segment 1 in the bit time is 3.      */
#define  CAN_CTRL1_PBS1_4                     4U     /* 4 : the length of phase segment 1 in the bit time is 4.      */
#define  CAN_CTRL1_PBS1_5                     5U     /* 5 : the length of phase segment 1 in the bit time is 5.      */
#define  CAN_CTRL1_PBS1_6                     6U     /* 6 : the length of phase segment 1 in the bit time is 6.      */
#define  CAN_CTRL1_PBS1_7                     7U     /* 7 : the length of phase segment 1 in the bit time is 7.      */

/* ===============================================  CAN CTRL1 SJW [22..23]  =============================================== */
                                  /* CAN_CTRL1_SJW                                                          */
#define  CAN_CTRL1_SJW_0                     0U     /* 0 :  the maximum number of time quanta  is 0.      */
#define  CAN_CTRL1_SJW_1                     1U     /* 1 :  the maximum number of time quanta  is 1.      */
#define  CAN_CTRL1_SJW_2                     2U     /* 2 :  the maximum number of time quanta  is 2.      */
#define  CAN_CTRL1_SJW_3                     3U     /* 3 :  the maximum number of time quanta  is 3.      */

/* =========================================================  FRTMR  ========================================================= */
/* =======================================================  RXMASK  ======================================================== */
/* =======================================================  RX14MASK  ======================================================== */
/* =======================================================  RX15MASK  ======================================================== */
/* ========================================================  ERRCNT  ========================================================= */
/* ========================================================  ERRFLG1  ======================================================== */
/* ==============================================  CAN ERRFLG1 ERRFLG [1..1]  =============================================== */
                                 /* CAN_ERRFLG1_ERRFLG                                                       */
#define CAN_ERRFLG1_ERRFLG_0                   0U     /* 0 : No such occurrence.                                                   */
#define CAN_ERRFLG1_ERRFLG_1                   1U     /* 1 : Indicates setting of any Error Bit in the Error and Status
                                                     Register.                                                                 */


