MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* =============================================  CAN ERRFLG1 RXWINTFLG [16..16]  ============================================== */
                                 /* CAN_ERRFLG1_RXWINTFLG                                                       */
#define  CAN_ERRFLG1_RXWINTFLG_0                  0U     /* 0 : No such occurrence.                                                   */
#define  CAN_ERRFLG1_RXWINTFLG_1                  1U     /* 1 : The Rx error counter transitioned from less than 96 to greater
                                                     than or equal to 96.                                                      */


/* =============================================  CAN ERRFLG1 TXWINTFLG [17..17]  ============================================== */
                                 /* CAN_ERRFLG1_TXWINTFLG                                                       */
#define  CAN_ERRFLG1_TXWINTFLG_0                  0U     /* 0 : No such occurrence.                                                   */
#define  CAN_ERRFLG1_TXWINTFLG_1                  1U     /* 1 : The Tx error counter transitioned from less than 96 to greater
                                                     than or equal to 96.                                                      */


/* ==============================================  CAN ERRFLG1 BSYNFLG [18..18]  =============================================== */
                                 /* CAN_ERRFLG1_BSYNFLG                                                         */
#define  CAN_ERRFLG1_BSYNFLG_0                    0U     /* 0 : CAN is not synchronized to the CAN bus.                           */
#define  CAN_ERRFLG1_BSYNFLG_1                    1U     /* 1 : CAN is synchronized to the CAN bus.                               */


/* =============================================  CAN ERRFLG1 BOCINTFLG [19..19]  ============================================== */
                                 /* CAN_ERRFLG1_BOCINTFLG                                                       */
#define  CAN_ERRFLG1_BOCINTFLG_0                  0U     /* 0 : No such occurrence.                                                   */
#define  CAN_ERRFLG1_BOCINTFLG_1                  1U     /* 1 : CAN module has completed Bus Off process.                         */


/* ============================================  CAN ERRFLG1 FDERRFLG [20..20]  ============================================= */
                                 /* CAN_ERRFLG1_FDERRFLG                                                     */
#define  CAN_ERRFLG1_FDERRFLG_0                0U     /* 0 : No such occurrence.                                                   */
#define  CAN_ERRFLG1_FDERRFLG_1                1U     /* 1 : Indicates setting of any Error Bit detected in the Data
                                                     Phase of CAN FD frames with the BRS bit set.                              */


/* =============================================  CAN ERRFLG1 OVRFLG [21..21]  ============================================== */
                                 /* CAN_ERRFLG1_OVRFLG                                                       */
#define  CAN_ERRFLG1_OVRFLG_0                  0U     /* 0 : Overrun has not occurred.                                             */
#define  CAN_ERRFLG1_OVRFLG_1                  1U     /* 1 : Overrun has occurred.                                                 */


/* ============================================  CAN ERRFLG1 FDSERRFLG [26..26]  ============================================ */
                                 /* CAN_ERRFLG1_FDSERRFLG                                                    */
#define  CAN_ERRFLG1_FDSERRFLG_0               0U     /* 0 : No such occurrence.                                                   */
#define  CAN_ERRFLG1_FDSERRFLG_1               1U     /* 1 : A Stuffing Error occurred since last read of this register.           */


/* ============================================  CAN ERRFLG1 FDFERRFLG [27..27]  ============================================ */
                                 /* CAN_ERRFLG1_FDFERRFLG                                                    */
#define  CAN_ERRFLG1_FDFERRFLG_0               0U     /* 0 : No such occurrence.                                                   */
#define  CAN_ERRFLG1_FDFERRFLG_1               1U     /* 1 : A Form Error occurred since last read of this register.               */


/* ===========================================  CAN ERRFLG1 FDCRCERRFLG [28..28]  =========================================== */
                                 /* CAN_ERRFLG1_FDCRCERRFLG                                                  */
#define  CAN_ERRFLG1_FDCRCERRFLG_0             0U     /* 0 : No such occurrence.                                                   */
#define  CAN_ERRFLG1_FDCRCERRFLG_1             1U     /* 1 : A CRC error occurred since last read of this register.                */


/* ===========================================  CAN ERRFLG1 FDB0ERRFLG [30..30]  ============================================ */
                                 /* CAN_ERRFLG1_FDB0ERRFLG                                                   */
#define  CAN_ERRFLG1_FDB0ERRFLG_0              0U     /* 0 : No such occurrence.                                                   */
#define  CAN_ERRFLG1_FDB0ERRFLG_1              1U     /* 1 : At least one bit sent as dominant is received as recessive.           */


/* ===========================================  CAN ERRFLG1 FDB1ERRFLG [31..31]  ============================================ */
                                 /* CAN_ERRFLG1_FDB1ERRFLG                                                   */
#define  CAN_ERRFLG1_FDB1ERRFLG_0              0U     /* 0 : No such occurrence.                                                   */
#define  CAN_ERRFLG1_FDB1ERRFLG_1              1U     /* 1 : At least one bit sent as recessive is received as dominant.           */


/* =========================================================  MBiIEN  ========================================================= */
/* =========================================================  IFLG  ========================================================== */
/* ================================================  CAN IFLG MB0INT [0..0]  ================================================ */
                                 /* CAN_IFLG_MB0INT                                                          */
#define  CAN_IFLG_MB0INT_0                     0U     /* 0 : The corresponding buffer has no occurrence of successfully
                                                 completed transmission or reception when MCR[RFEN] 0.                     */
#define  CAN_IFLG_MB0INT_1                     1U     /* 1 : The corresponding buffer has successfully completed transmission
                                                       or reception when MCR[RFEN] 0.                                            */


