MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ==============================================  CAN CTRL2 BOCIEN [30..30]  =============================================== */
                                 /* CAN_CTRL2_BOCIEN                                                         */
#define  CAN_CTRL2_BOCIEN_0                    0U     /* 0 : Bus Off Done interrupt disabled.                                      */
#define  CAN_CTRL2_BOCIEN_1                    1U     /* 1 : Bus Off Done interrupt enabled.                                       */


/* =============================================  CAN CTRL2 FDERRIEN [31..31]  ============================================== */
                                 /* CAN_CTRL2_FDERRIEN                                                       */
#define  CAN_CTRL2_FDERRIEN_0                  0U     /* 0 : ERRINT_FAST Error interrupt disabled.                                 */
#define  CAN_CTRL2_FDERRIEN_1                  1U     /* 1 : ERRINT_FAST Error interrupt enabled.                                  */


/* ========================================================  ERRFLG2  ======================================================== */
/* ==============================================  CAN ERRFLG2 IAMBFLG [13..13]  =============================================== */
                                 /* CAN_ERRFLG2_IAMBFLG                                                         */
#define  CAN_ERRFLG2_IAMBFLG_0                    0U     /* 0 : If ESR2[VPS] is assertedU the ESR2[LPTM] is not an inactive
                                                        Mailbox.                                                                  */
#define  CAN_ERRFLG2_IAMBFLG_1                    1U     /* 1 : If ESR2[VPS] is assertedU there is at least one inactive
                                                         Mailbox. LPTM content is the number of the first one.                     */


/* ==============================================  CAN ERRFLG2 CVFLG [14..14]  ============================================== */
                                 /* CAN_ERRFLG2_CVFLG                                                        */
#define  CAN_ERRFLG2_CVFLG_0                   0U     /* 0 : Contents of IMB and LPTM are invalid.                                 */
#define  CAN_ERRFLG2_CVFLG_1                   1U     /* 1 : Contents of IMB and LPTM are valid.                                   */


/* ==========================================================  CRC  ========================================================== */
/* =======================================================  FIFOGMASK  ======================================================= */
/* =======================================================  FIFOINFO  ======================================================== */
/* ========================================================  BTIM  ========================================================= */
/* ==============================================  CAN BTIM EBTEN [31..31]  =============================================== */
                                 /* CAN_BTIM_EBTEN                                                         */
#define  CAN_BTIM_EBTEN_0                    0U     /* 0 : Extended bit time definitions disabled.                               */
#define  CAN_BTIM_EBTEN_1                    1U     /* 1 : Extended bit time definitions enabled.                                */


/* =========================================================  RAMn  ========================================================= */
/* =======================================================  RXIMASK  ======================================================== */
/* ========================================================  PNCTRL1  ======================================================== */
/* ===============================================  CAN PNCTRL1 FCSEL [0..1]  =============================================== */
                                 /* CAN_PNCTRL1_FCSEL                                                        */
#define  CAN_PNCTRL1_FCSEL_00                  0U     /* 00 : Message ID filtering only                                            */
#define  CAN_PNCTRL1_FCSEL_01                  1U     /* 01 : Message ID filtering and payload filtering                           */
#define  CAN_PNCTRL1_FCSEL_10                  2U     /* 10 : Message ID filtering occurring a specified number of times.          */
#define  CAN_PNCTRL1_FCSEL_11                  3U     /* 11 : Message ID filtering and payload filtering a specified
                                                     number of times                                                           */


/* ==============================================  CAN PNCTRL1 IDFLSEL [2..3]  ============================================== */
                                 /* CAN_PNCTRL1_IDFLSEL                                                      */
#define  CAN_PNCTRL1_IDFLSEL_00                0U     /* 00 : Match upon a ID contents against an exact target value               */
#define  CAN_PNCTRL1_IDFLSEL_01                1U     /* 01 : Match upon a ID value greater than or equal to a specified
                                                     target value                                                              */
#define  CAN_PNCTRL1_IDFLSEL_10                2U     /* 10 : Match upon a ID value smaller than or equal to a specified
                                                      target value                                                              */
#define  CAN_PNCTRL1_IDFLSEL_11                3U     /* 11 : Match upon a ID value inside a rangeU greater than or equal
                                                       to a specified lower limit and smaller than or equal a
                                                     specified upper limit                                                     */


/* ==============================================  CAN PNCTRL1 PFLSEL [4..5]  =============================================== */
                                 /* CAN_PNCTRL1_PFLSEL                                                       */
#define  CAN_PNCTRL1_PFLSEL_00                 0U     /* 00 : Match upon a payload contents against an exact target value          */
#define  CAN_PNCTRL1_PFLSEL_01                 1U     /* 01 : Match upon a payload value greater than or equal to a specified
                                                     target value                                                              */
#define  CAN_PNCTRL1_PFLSEL_10                 2U     /* 10 : Match upon a payload value smaller than or equal to a specified
                                                      target value                                                              */
#define  CAN_PNCTRL1_PFLSEL_11                 3U     /* 11 : Match upon a payload value inside a rangeU greater than
                                                      or equal to a specified lower limit and smaller than or
                                                     equal a specified upper limit                                             */


/* ==============================================  CAN PNCTRL1 NUMMSG [8..15]  ============================================== */
                                 /* CAN_PNCTRL1_NUMMSG                                                       */
#define  CAN_PNCTRL1_NUMMSG_00000001           1U     /* 00000001 : Received message must match the predefined filtering
                                                         criteria for ID and/or PL once before generating a wake
                                                     up event.                                                                 */
#define  CAN_PNCTRL1_NUMMSG_00000010           2U     /* 00000010 : Received message must match the predefined filtering
                                                        criteria for ID and/or PL twice before generating a wake
                                                     up event.                                                                 */
#define  CAN_PNCTRL1_NUMMSG_11111111           255U   /* 11111111 : Received message must match the predefined filtering
                                                      criteria for ID and/or PL 255 times before generating a
                                                     wake up event.                                                            */


/* ==============================================  CAN PNCTRL1 WUMEN [16..16]  ============================================== */
                                 /* CAN_PNCTRL1_WUMEN                                                        */
#define  CAN_PNCTRL1_WUMEN_0                   0U     /* 0 : Wake up match event is disabled                                       */
#define  CAN_PNCTRL1_WUMEN_1                   1U     /* 1 : Wake up match event is enabled                                        */


