MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* =============================================  CFGTMR CSTS PWMOENCH6 [22..22]  ============================================== */
                                 /* CFGTMR_CSTS_PWMOENCH6                                                       */
#define  CFGTMR_CSTS_PWMOENCH6_0                  0U     /* 0 : Channel 6 output port is disabled                                       */
#define  CFGTMR_CSTS_PWMOENCH6_1                  1U     /* 1 : Channel 6 output port is enabled                                        */

/* =============================================  CFGTMR CSTS PWMOENCH7 [23..23]  ============================================== */
                                 /* CFGTMR_CSTS_PWMOENCH7                                                       */
#define  CFGTMR_CSTS_PWMOENCH7_0                  0U     /* 0 : Channel 7 output port is disabled                                       */
#define  CFGTMR_CSTS_PWMOENCH7_1                  1U     /* 1 : Channel 7 output port is enabled                                        */


/* ==============================================  CFGTMR CSTS FPSCSEL [24..27]  ============================================== */
                                 /* CFGTMR_CSTS_FPSCSEL                                                        */
#define  CFGTMR_CSTS_FPSCSEL_0000                0U     /* 0000 : Divide by 1                                                        */
#define  CFGTMR_CSTS_FPSCSEL_0001                1U     /* 0001 : Divide by 2                                                        */
#define  CFGTMR_CSTS_FPSCSEL_0010                2U     /* 0010 : Divide by 3                                                        */
#define  CFGTMR_CSTS_FPSCSEL_0011                3U     /* 0011 : Divide by 4                                                        */
#define  CFGTMR_CSTS_FPSCSEL_0100                4U     /* 0100 : Divide by 5                                                        */
#define  CFGTMR_CSTS_FPSCSEL_0101                5U     /* 0101 : Divide by 6                                                        */
#define  CFGTMR_CSTS_FPSCSEL_0110                6U     /* 0110 : Divide by 7                                                        */
#define  CFGTMR_CSTS_FPSCSEL_0111                7U     /* 0111 : Divide by 8                                                        */
#define  CFGTMR_CSTS_FPSCSEL_1000                8U     /* 1000 : Divide by 9                                                        */
#define  CFGTMR_CSTS_FPSCSEL_1001                9U     /* 1001 : Divide by 10                                                       */
#define  CFGTMR_CSTS_FPSCSEL_1010                10U    /* 1010 : Divide by 11                                                       */
#define  CFGTMR_CSTS_FPSCSEL_1011                11U    /* 1011 : Divide by 12                                                       */
#define  CFGTMR_CSTS_FPSCSEL_1100                12U    /* 1100 : Divide by 13                                                       */
#define  CFGTMR_CSTS_FPSCSEL_1101                13U    /* 1101 : Divide by 14                                                       */
#define  CFGTMR_CSTS_FPSCSEL_1110                14U    /* 1110 : Divide by 15                                                       */
#define  CFGTMR_CSTS_FPSCSEL_1111                15U    /* 1111 : Divide by 16                                                       */


/* ==========================================================  CNT  ========================================================== */
/* ==========================================================  MOD  ========================================================== */
/* ========================================================  CHnCSTS  ======================================================== */
/* ==============================================  CFGTMR CHnCSTS DMAEN [0..0]  =============================================== */
                                 /* CFGTMR_CHnCSTS_DMAEN                                         */
#define  CFGTMR_CHnCSTS_DMAEN_0    0U     /* 0 : Disable DMA transfers.                                                */
#define  CFGTMR_CHnCSTS_DMAEN_1    1U     /* 1 : Enable DMA transfers.                                                 */


/* =============================================  CFGTMR CHnCSTS CRSTCTRL [1..1]  ============================================= */
                                 /* CFGTMR_CHnCSTS_CRSTCTRL                                      */
#define  CFGTMR_CHnCSTS_CRSTCTRL_0   0U   /* 0 : CFGTMR counter is not reset when the selected channel (n) input
                                                        event is detected.                                                        */
#define  CFGTMR_CHnCSTS_CRSTCTRL_1   1U   /* 1 : CFGTMR counter is reset when the selected channel (n) input
                                                        event is detected.                                                        */

/* ==============================================  CFGTMR CHnCSTS CHMSEL0 [2..2]  =============================================== */
                                 /* CFGTMR_CHnCSTS_CHMSEL0                                         */
#define  CFGTMR_CHnCSTS_CHMSEL0_0    0U
#define  CFGTMR_CHnCSTS_CHMSEL0_1    1U

/* ==============================================  CFGTMR CHnCSTS CHMSEL1 [3..3]  =============================================== */
                                 /* CFGTMR_CHnCSTS_CHMSEL1                                         */
#define  CFGTMR_CHnCSTS_CHMSEL1_0    0U
#define  CFGTMR_CHnCSTS_CHMSEL1_1    1U

/* ==============================================  CFGTMR CHnCSTS CHMSEL2 [4..4]  =============================================== */
                                 /* CFGTMR_CHnCSTS_CHMSEL2                                         */
#define  CFGTMR_CHnCSTS_CHMSEL2_0    0U
#define  CFGTMR_CHnCSTS_CHMSEL2_1    1U

/* ==============================================  CFGTMR CHnCSTS CHMSEL3 [5..5]  =============================================== */
                                 /* CFGTMR_CHnCSTS_CHMSEL3                                         */
#define  CFGTMR_CHnCSTS_CHMSEL3_0    0U
#define  CFGTMR_CHnCSTS_CHMSEL3_1    1U

