MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ===============================================  CFGTMR SYN HWT1SEL [5..5]  ================================================ */
                                 /* CFGTMR_SYN_HWT1SEL                                                         */
#define  CFGTMR_SYN_HWT1SEL_0                    0U     /* 0 : Trigger is disabled.                                                  */
#define  CFGTMR_SYN_HWT1SEL_1                    1U     /* 1 : Trigger is enabled.                                                   */


/* ===============================================  CFGTMR SYN HWT2SEL [6..6]  ================================================ */
                                 /* CFGTMR_SYN_HWT2SEL                                                         */
#define  CFGTMR_SYN_HWT2SEL_0                    0U     /* 0 : Trigger is disabled.                                                  */
#define  CFGTMR_SYN_HWT2SEL_1                    1U     /* 1 : Trigger is enabled.                                                   */


/* ================================================  CFGTMR SYN SWTSEL [7..7]  ================================================ */
                                 /* CFGTMR_SYN_SWTSEL                                                          */
#define  CFGTMR_SYN_SWTSEL_0                     0U     /* 0 : Software trigger is not selected.                                     */
#define  CFGTMR_SYN_SWTSEL_1                     1U     /* 1 : Software trigger is selected.                                         */


/* =========================================================  CHOI  ========================================================== */
/* ===============================================  CFGTMR CHOI CHOISEL0 [0..0]  =============================================== */
                                 /* CFGTMR_CHOI_CHOISEL0                                                        */
#define  CFGTMR_CHOI_CHOISEL0_0                   0U     /* 0 : The initialization value is 0.                                        */
#define  CFGTMR_CHOI_CHOISEL0_1                   1U     /* 1 : The initialization value is 1.                                        */

/* ===============================================  CFGTMR CHOI CHOISEL1 [1..1]  =============================================== */
                                 /* CFGTMR_CHOI_CHOISEL1                                                        */
#define  CFGTMR_CHOI_CHOISEL1_0                   0U     /* 0 : The initialization value is 0.                                        */
#define  CFGTMR_CHOI_CHOISEL1_1                   1U     /* 1 : The initialization value is 1.                                        */

/* ===============================================  CFGTMR CHOI CHOISEL2 [2..2]  =============================================== */
                                 /* CFGTMR_CHOI_CHOISEL2                                                        */
#define  CFGTMR_CHOI_CHOISEL2_0                   0U     /* 0 : The initialization value is 0.                                        */
#define  CFGTMR_CHOI_CHOISEL2_1                   1U     /* 1 : The initialization value is 1.                                        */

/* ===============================================  CFGTMR CHOI CHOISEL3 [3..3]  =============================================== */
                                 /* CFGTMR_CHOI_CHOISEL3                                                        */
#define  CFGTMR_CHOI_CHOISEL3_0                   0U     /* 0 : The initialization value is 0.                                        */
#define  CFGTMR_CHOI_CHOISEL3_1                   1U     /* 1 : The initialization value is 1.                                        */

/* ===============================================  CFGTMR CHOI CHOISEL4 [4..4]  =============================================== */
                                 /* CFGTMR_CHOI_CHOISEL4                                                        */
#define  CFGTMR_CHOI_CHOISEL4_0                   0U     /* 0 : The initialization value is 0.                                        */
#define  CFGTMR_CHOI_CHOISEL4_1                   1U     /* 1 : The initialization value is 1.                                        */

/* ===============================================  CFGTMR CHOI CHOISEL5 [5..5]  =============================================== */
                                 /* CFGTMR_CHOI_CHOISEL5                                                        */
#define  CFGTMR_CHOI_CHOISEL5_0                   0U     /* 0 : The initialization value is 0.                                        */
#define  CFGTMR_CHOI_CHOISEL5_1                   1U     /* 1 : The initialization value is 1.                                        */

/* ===============================================  CFGTMR CHOI CHOISEL6 [6..6]  =============================================== */
                                 /* CFGTMR_CHOI_CHOISEL6                                                        */
#define  CFGTMR_CHOI_CHOISEL6_0                   0U     /* 0 : The initialization value is 0.                                        */
#define  CFGTMR_CHOI_CHOISEL6_1                   1U     /* 1 : The initialization value is 1.                                        */

/* ===============================================  CFGTMR CHOI CHOISEL7 [7..7]  =============================================== */
                                 /* CFGTMR_CHOI_CHOISEL7                                                        */
#define  CFGTMR_CHOI_CHOISEL7_0                   0U     /* 0 : The initialization value is 0.                                        */
#define  CFGTMR_CHOI_CHOISEL7_1                   1U     /* 1 : The initialization value is 1.                                        */


/* =========================================================  OMASK  ========================================================= */
/* ==============================================  CFGTMR OMASK CHOMASK0 [0..0]  =============================================== */
                                 /* CFGTMR_OMASK_CHOMASK0                                                       */
#define  CFGTMR_OMASK_CHOMASK0_0                  0U     /* 0 : Channel output is not masked. It continues to operate normally.       */
#define  CFGTMR_OMASK_CHOMASK0_1                  1U     /* 1 : Channel output is masked. It is forced to its inactive state.         */

/* ==============================================  CFGTMR OMASK CHOMASK1 [1..1]  =============================================== */
                                 /* CFGTMR_OMASK_CHOMASK1                                                       */
#define  CFGTMR_OMASK_CHOMASK1_0                  0U     /* 0 : Channel output is not masked. It continues to operate normally.       */
#define  CFGTMR_OMASK_CHOMASK1_1                  1U     /* 1 : Channel output is masked. It is forced to its inactive state.         */
/* ==============================================  CFGTMR OMASK CHOMASK2 [2..2]  =============================================== */
                                 /* CFGTMR_OMASK_CHOMASK2                                                       */
#define  CFGTMR_OMASK_CHOMASK2_0                  0U     /* 0 : Channel output is not masked. It continues to operate normally.       */
#define  CFGTMR_OMASK_CHOMASK2_1                  1U     /* 1 : Channel output is masked. It is forced to its inactive state.         */
/* ==============================================  CFGTMR OMASK CHOMASK3 [3..3]  =============================================== */
                                 /* CFGTMR_OMASK_CHOMASK3                                                       */
#define  CFGTMR_OMASK_CHOMASK3_0                  0U     /* 0 : Channel output is not masked. It continues to operate normally.       */
#define  CFGTMR_OMASK_CHOMASK3_1                  1U     /* 1 : Channel output is masked. It is forced to its inactive state.         */
/* ==============================================  CFGTMR OMASK CHOMASK4 [4..4]  =============================================== */
                                 /* CFGTMR_OMASK_CHOMASK4                                                       */
#define  CFGTMR_OMASK_CHOMASK4_0                  0U     /* 0 : Channel output is not masked. It continues to operate normally.       */
#define  CFGTMR_OMASK_CHOMASK4_1                  1U     /* 1 : Channel output is masked. It is forced to its inactive state.         */
/* ==============================================  CFGTMR OMASK CHOMASK5 [5..5]  =============================================== */
                                 /* CFGTMR_OMASK_CHOMASK5                                                       */
#define  CFGTMR_OMASK_CHOMASK5_0                  0U     /* 0 : Channel output is not masked. It continues to operate normally.       */
#define  CFGTMR_OMASK_CHOMASK5_1                  1U     /* 1 : Channel output is masked. It is forced to its inactive state.         */
/* ==============================================  CFGTMR OMASK CHOMASK6 [6..6]  =============================================== */
                                 /* CFGTMR_OMASK_CHOMASK6                                                       */
#define  CFGTMR_OMASK_CHOMASK6_0                  0U     /* 0 : Channel output is not masked. It continues to operate normally.       */
#define  CFGTMR_OMASK_CHOMASK6_1                  1U     /* 1 : Channel output is masked. It is forced to its inactive state.         */
/* ==============================================  CFGTMR OMASK CHOMASK7 [7..7]  =============================================== */
                                 /* CFGTMR_OMASK_CHOMASK7                                                       */
#define  CFGTMR_OMASK_CHOMASK7_0                  0U     /* 0 : Channel output is not masked. It continues to operate normally.       */
#define  CFGTMR_OMASK_CHOMASK7_1                  1U     /* 1 : Channel output is masked. It is forced to its inactive state.         */

/* =========================================================  FLCH  ========================================================== */
/* ================================================  CFGTMR FLCH CCHO0 [1..1]  ================================================ */
                                 /* CFGTMR_FLCH_CCHO0                                                          */
#define  CFGTMR_FLCH_CCHO0_0                     0U     /* 0 : The channel (n+1) output is the same as the channel (n)
                                                       output.                                                                   */
#define  CFGTMR_FLCH_CCHO0_1                     1U     /* 1 : The channel (n+1) output is the complement of the channel
                                                        (n) output.                                                               */


