MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ============================================  CFGTMR EXTTRG EXTTRGENCH1 [5..5]  ============================================ */
                                 /* CFGTMR_EXTTRG_EXTTRGENCH1                                                  */
#define  CFGTMR_EXTTRG_EXTTRGENCH1_0             0U     /* 0 : The generation of this external trigger is disabled.                  */
#define  CFGTMR_EXTTRG_EXTTRGENCH1_1             1U     /* 1 : The generation of this external trigger is enabled.                   */


/* =============================================  CFGTMR EXTTRG INITTRGEN [6..6]  ============================================= */
                                 /* CFGTMR_EXTTRG_INITTRGEN                                                    */
#define  CFGTMR_EXTTRG_INITTRGEN_0               0U     /* 0 : The generation of initialization trigger is disabled.                 */
#define  CFGTMR_EXTTRG_INITTRGEN_1               1U     /* 1 : The generation of initialization trigger is enabled.                  */

/* =============================================  CFGTMR EXTTRG CHTRGFLG [7..7]  ============================================== */
                                 /* CFGTMR_EXTTRG_CHTRGFLG                                                     */
#define  CFGTMR_EXTTRG_CHTRGFLG_0                0U     /* 0 : No channel trigger was generated.                                     */
#define  CFGTMR_EXTTRG_CHTRGFLG_1                1U     /* 1 : A channel trigger was generated.                                      */


/* ============================================  CFGTMR EXTTRG EXTTRGENCH6 [8..8]  ============================================ */
                                 /* CFGTMR_EXTTRG_EXTTRGENCH6                                                  */
#define  CFGTMR_EXTTRG_EXTTRGENCH6_0             0U     /* 0 : The generation of this external trigger is disabled.                  */
#define  CFGTMR_EXTTRG_EXTTRGENCH6_1             1U     /* 1 : The generation of this external trigger is enabled.                   */


/* ============================================  CFGTMR EXTTRG EXTTRGENCH7 [9..9]  ============================================ */
                                 /* CFGTMR_EXTTRG_EXTTRGENCH7                                                  */
#define  CFGTMR_EXTTRG_EXTTRGENCH7_0             0U     /* 0 : The generation of this external trigger is disabled.                  */
#define  CFGTMR_EXTTRG_EXTTRGENCH7_1             1U     /* 1 : The generation of this external trigger is enabled.                   */


/* =========================================================  CHPOL  ========================================================= */
/* ===============================================  CFGTMR CHPOL CHPOL0 [0..0]  ================================================ */
                                 /* CFGTMR_CHPOL_CHPOL0                                                         */
#define  CFGTMR_CHPOL_CHPOL0_0                    0U     /* 0 : The channel polarity is active high.                                  */
#define  CFGTMR_CHPOL_CHPOL0_1                    1U     /* 1 : The channel polarity is active low.                                   */

/* ===============================================  CFGTMR CHPOL CHPOL1 [1..1]  ================================================ */
                                 /* CFGTMR_CHPOL_CHPOL1                                                         */
#define  CFGTMR_CHPOL_CHPOL1_0                    0U     /* 0 : The channel polarity is active high.                                  */
#define  CFGTMR_CHPOL_CHPOL1_1                    1U     /* 1 : The channel polarity is active low.                                   */

/* ===============================================  CFGTMR CHPOL CHPOL2 [2..2]  ================================================ */
                                 /* CFGTMR_CHPOL_CHPOL2                                                         */
#define  CFGTMR_CHPOL_CHPOL2_0                    0U     /* 0 : The channel polarity is active high.                                  */
#define  CFGTMR_CHPOL_CHPOL2_1                    1U     /* 1 : The channel polarity is active low.                                   */

/* ===============================================  CFGTMR CHPOL CHPOL3 [3..3]  ================================================ */
                                 /* CFGTMR_CHPOL_CHPOL3                                                         */
#define  CFGTMR_CHPOL_CHPOL3_0                    0U     /* 0 : The channel polarity is active high.                                  */
#define  CFGTMR_CHPOL_CHPOL3_1                    1U     /* 1 : The channel polarity is active low.                                   */

/* ===============================================  CFGTMR CHPOL CHPOL4 [4..4]  ================================================ */
                                 /* CFGTMR_CHPOL_CHPOL4                                                         */
#define  CFGTMR_CHPOL_CHPOL4_0                    0U     /* 0 : The channel polarity is active high.                                  */
#define  CFGTMR_CHPOL_CHPOL4_1                    1U     /* 1 : The channel polarity is active low.                                   */

/* ===============================================  CFGTMR CHPOL CHPOL5 [5..5]  ================================================ */
                                 /* CFGTMR_CHPOL_CHPOL5                                                         */
#define  CFGTMR_CHPOL_CHPOL5_0                    0U     /* 0 : The channel polarity is active high.                                  */
#define  CFGTMR_CHPOL_CHPOL5_1                    1U     /* 1 : The channel polarity is active low.                                   */

/* ===============================================  CFGTMR CHPOL CHPOL [6..6]  ================================================ */
                                 /* CFGTMR_CHPOL_CHPOL6                                                         */
#define  CFGTMR_CHPOL_CHPOL6_0                    0U     /* 0 : The channel polarity is active high.                                  */
#define  CFGTMR_CHPOL_CHPOL6_1                    1U     /* 1 : The channel polarity is active low.                                   */

/* ===============================================  CFGTMR CHPOL CHPOL7 [7..7]  ================================================ */
                                 /* CFGTMR_CHPOL_CHPOL7                                                         */
#define  CFGTMR_CHPOL_CHPOL7_0                    0U     /* 0 : The channel polarity is active high.                                  */
#define  CFGTMR_CHPOL_CHPOL7_1                    1U     /* 1 : The channel polarity is active low.                                   */


