MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* =========================================================  FMSTS  ========================================================= */
/* ==============================================  CFGTMR FMSTS FIDFLG0 [0..0]  =============================================== */
                                 /* CFGTMR_FMSTS_FIDFLG0                                                       */
#define  CFGTMR_FMSTS_FIDFLG0_0                  0U     /* 0 : No fault condition was detected at the fault input.                   */
#define  CFGTMR_FMSTS_FIDFLG0_1                  1U     /* 1 : A fault condition was detected at the fault input.                    */


/* ==============================================  CFGTMR FMSTS FIDFLG1 [1..1]  =============================================== */
                                 /* CFGTMR_FMSTS_FIDFLG1                                                       */
#define  CFGTMR_FMSTS_FIDFLG1_0                  0U     /* 0 : No fault condition was detected at the fault input.                   */
#define  CFGTMR_FMSTS_FIDFLG1_1                  1U     /* 1 : A fault condition was detected at the fault input.                    */


/* ==============================================  CFGTMR FMSTS FIDFLG2 [2..2]  =============================================== */
                                 /* CFGTMR_FMSTS_FIDFLG2                                                       */
#define  CFGTMR_FMSTS_FIDFLG2_0                  0U     /* 0 : No fault condition was detected at the fault input.                   */
#define  CFGTMR_FMSTS_FIDFLG2_1                  1U     /* 1 : A fault condition was detected at the fault input.                    */


/* ==============================================  CFGTMR FMSTS FIDFLG3 [3..3]  =============================================== */
                                 /* CFGTMR_FMSTS_FIDFLG3                                                       */
#define  CFGTMR_FMSTS_FIDFLG3_0                  0U     /* 0 : No fault condition was detected at the fault input.                   */
#define  CFGTMR_FMSTS_FIDFLG3_1                  1U     /* 1 : A fault condition was detected at the fault input.                    */


/* ===============================================  CFGTMR FMSTS FICTRL [5..5]  =============================================== */
                                 /* CFGTMR_FMSTS_FICTRL                                                        */
#define  CFGTMR_FMSTS_FICTRL_0                   0U     /* 0 : The logic OR of the enabled fault inputs is 0.                        */
#define  CFGTMR_FMSTS_FICTRL_1                   1U     /* 1 : The logic OR of the enabled fault inputs is 1.                        */


/* ================================================  CFGTMR FMSTS WPEN [6..6]  ================================================ */
                                 /* CFGTMR_FMSTS_WPEN                                                          */
#define  CFGTMR_FMSTS_WPEN_0                     0U     /* 0 : Write protection is disabled. Write protected bits can be
                                                       written.                                                                  */
#define  CFGTMR_FMSTS_WPEN_1                     1U     /* 1 : Write protection is enabled. Write protected bits cannot
                                                        be written.                                                               */


/* ===============================================  CFGTMR FMSTS FCDFLG [7..7]  =============================================== */
                                 /* CFGTMR_FMSTS_FCDFLG                                                        */
#define  CFGTMR_FMSTS_FCDFLG_0                   0U     /* 0 : No fault condition was detected.                                      */
#define  CFGTMR_FMSTS_FCDFLG_1                   1U     /* 1 : A fault condition was detected.                                       */


/* ========================================================  ICFCTRL  ======================================================== */
/* =========================================================  FCTRL  ========================================================= */
/* ===============================================  CFGTMR FCTRL FIEN0 [0..0]  ================================================ */
                                 /* CFGTMR_FCTRL_FIEN0                                                         */
#define  CFGTMR_FCTRL_FIEN0_0                    0U     /* 0 : Fault input is disabled.                                              */
#define  CFGTMR_FCTRL_FIEN0_1                    1U     /* 1 : Fault input is enabled.                                               */


/* ===============================================  CFGTMR FCTRL FIEN1 [1..1]  ================================================ */
                                 /* CFGTMR_FCTRL_FIEN1                                                         */
#define  CFGTMR_FCTRL_FIEN1_0                    0U     /* 0 : Fault input is disabled.                                              */
#define  CFGTMR_FCTRL_FIEN1_1                    1U     /* 1 : Fault input is enabled.                                               */


/* ===============================================  CFGTMR FCTRL FIEN2 [2..2]  ================================================ */
                                 /* CFGTMR_FCTRL_FIEN2                                                         */
#define  CFGTMR_FCTRL_FIEN2_0                    0U     /* 0 : Fault input is disabled.                                              */
#define  CFGTMR_FCTRL_FIEN2_1                    1U     /* 1 : Fault input is enabled.                                               */


/* ===============================================  CFGTMR FCTRL FIEN3 [3..3]  ================================================ */
                                 /* CFGTMR_FCTRL_FIEN3                                                         */
#define  CFGTMR_FCTRL_FIEN3_0                    0U     /* 0 : Fault input is disabled.                                              */
#define  CFGTMR_FCTRL_FIEN3_1                    1U     /* 1 : Fault input is enabled.                                               */


/* ===============================================  CFGTMR FCTRL FIFEN0 [4..4]  =============================================== */
                                 /* CFGTMR_FCTRL_FIFEN0                                                        */
#define  CFGTMR_FCTRL_FIFEN0_0                   0U     /* 0 : Fault input filter is disabled.                                       */
#define  CFGTMR_FCTRL_FIFEN0_1                   1U     /* 1 : Fault input filter is enabled.                                        */


