MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ===============================================  CFGTMR FCTRL FIFEN1 [5..5]  =============================================== */
                                 /* CFGTMR_FCTRL_FIFEN1                                                        */
#define  CFGTMR_FCTRL_FIFEN1_0                   0U     /* 0 : Fault input filter is disabled.                                       */
#define  CFGTMR_FCTRL_FIFEN1_1                   1U     /* 1 : Fault input filter is enabled.                                        */


/* ===============================================  CFGTMR FCTRL FIFEN2 [6..6]  =============================================== */
                                 /* CFGTMR_FCTRL_FIFEN2                                                        */
#define  CFGTMR_FCTRL_FIFEN2_0                   0U     /* 0 : Fault input filter is disabled.                                       */
#define  CFGTMR_FCTRL_FIFEN2_1                   1U     /* 1 : Fault input filter is enabled.                                        */


/* ===============================================  CFGTMR FCTRL FIFEN3 [7..7]  =============================================== */
                                 /* CFGTMR_FCTRL_FIFEN3                                                        */
#define  CFGTMR_FCTRL_FIFEN3_0                   0U     /* 0 : Fault input filter is disabled.                                       */
#define  CFGTMR_FCTRL_FIFEN3_1                   1U     /* 1 : Fault input filter is enabled.                                        */


/* ==============================================  CFGTMR FCTRL FEOSTS [15..15]  ============================================== */
                                 /* CFGTMR_FCTRL_FEOSTS                                                        */
#define  CFGTMR_FCTRL_FEOSTS_0                   0U     /* 0 : CFGTMR outputs will be placed into safe values when fault events
                                                        in ongoing (defined by POL bits).                                         */
#define  CFGTMR_FCTRL_FEOSTS_1                   1U     /* 1 : CFGTMR outputs will be tri-stated when fault event is ongoing            */


/* ========================================================  QDCSTS  ========================================================= */
/* ===============================================  CFGTMR QDCSTS QDMEN [0..0]  =============================================== */
                                 /* CFGTMR_QDCSTS_QDMEN                                                        */
#define  CFGTMR_QDCSTS_QDMEN_0                   0U     /* 0 : Quadrature Decoder mode is disabled.                                  */
#define  CFGTMR_QDCSTS_QDMEN_1                   1U     /* 1 : Quadrature Decoder mode is enabled.                                   */


/* =============================================  CFGTMR QDCSTS TMRODSEL [1..1]  ============================================== */
                                 /* CFGTMR_QDCSTS_TMRODSEL                                                     */
#define  CFGTMR_QDCSTS_TMRODSEL_0                0U     /* 0 : TOF bit was set on the bottom of counting. There was an
                                                         CFGTMR counter decrement and CFGTMR counter changes from its
                                                     minimum value (CNTIN register) to its maximum value (MOD
                                                     register).                                                                */
#define  CFGTMR_QDCSTS_TMRODSEL_1                1U     /* 1 : TOF bit was set on the top of counting. There was an CFGTMR
                                                        counter increment and CFGTMR counter changes from its maximum
                                                     value (MOD register) to its minimum value (CNTIN register).               */


/* ==============================================  CFGTMR QDCSTS CNTDIR [2..2]  =============================================== */
                                 /* CFGTMR_QDCSTS_CNTDIR                                                       */
#define  CFGTMR_QDCSTS_CNTDIR_0                  0U     /* 0 : Counting direction is decreasing (CFGTMR counter decrement).             */
#define  CFGTMR_QDCSTS_CNTDIR_1                  1U     /* 1 : Counting direction is increasing (CFGTMR counter increment).             */


/* ===============================================  CFGTMR QDCSTS EMSEL [3..3]  =============================================== */
                                 /* CFGTMR_QDCSTS_EMSEL                                                        */
#define  CFGTMR_QDCSTS_EMSEL_0                   0U     /* 0 : Phase A and phase B encoding mode.                                    */
#define  CFGTMR_QDCSTS_EMSEL_1                   1U     /* 1 : Count and direction encoding mode.                                    */


/* ==============================================  CFGTMR QDCSTS PBISPOL [4..4]  ============================================== */
                                 /* CFGTMR_QDCSTS_PBISPOL                                                      */
#define  CFGTMR_QDCSTS_PBISPOL_0                 0U     /* 0 : Normal polarity. Phase B input signal is not inverted before
                                                        identifying the rising and falling edges of this signal.                  */
#define  CFGTMR_QDCSTS_PBISPOL_1                 1U     /* 1 : Inverted polarity. Phase B input signal is inverted before
                                                      identifying the rising and falling edges of this signal.                  */


/* ==============================================  CFGTMR QDCSTS PAISPOL [5..5]  ============================================== */
                                 /* CFGTMR_QDCSTS_PAISPOL                                                      */
#define  CFGTMR_QDCSTS_PAISPOL_0                 0U     /* 0 : Normal polarity. Phase A input signal is not inverted before
                                                         identifying the rising and falling edges of this signal.                  */
#define  CFGTMR_QDCSTS_PAISPOL_1                 1U     /* 1 : Inverted polarity. Phase A input signal is inverted before
                                                      identifying the rising and falling edges of this signal.                  */


/* ==============================================  CFGTMR QDCSTS PBIFEN [6..6]  =============================================== */
                                 /* CFGTMR_QDCSTS_PBIFEN                                                       */
#define  CFGTMR_QDCSTS_PBIFEN_0                  0U     /* 0 : Phase B input filter is disabled.                                     */
#define  CFGTMR_QDCSTS_PBIFEN_1                  1U     /* 1 : Phase B input filter is enabled.                                      */


/* ==============================================  CFGTMR QDCSTS PAIFEN [7..7]  =============================================== */
                                 /* CFGTMR_QDCSTS_PAIFEN                                                       */
#define  CFGTMR_QDCSTS_PAIFEN_0                  0U     /* 0 : Phase A input filter is disabled.                                     */
#define  CFGTMR_QDCSTS_PAIFEN_1                  1U     /* 1 : Phase A input filter is enabled.                                      */


/* ==========================================================  CFG  ========================================================== */
/* =============================================  CFGTMR CFG INITTRGRP [11..11]  ============================================== */
                                 /* CFGTMR_CFG_INITTRGRP                                                       */
#define  CFGTMR_CFG_INITTRGRP_0                  0U     /* 0 : Initialization trigger is generated on counter wrap events.           */
#define  CFGTMR_CFG_INITTRGRP_1                  1U     /* 1 : Initialization trigger is generated when a reload point
                                                     is reached.                                                               */


/* ==========================================================  FIPOLSEL  ========================================================== */
/* ==============================================  CFGTMR FIPOLSEL FIPOLSEL0 [0..0]  =============================================== */
                                 /* CFGTMR_FIPOLSEL_FIPOLSEL0                                                       */
#define  CFGTMR_FIPOLSEL_FIPOLSEL0_0                  0U     /* 0 : The fault input polarity is active high. A 1 at the fault
                                                    input indicates a fault.                                                  */
#define  CFGTMR_FIPOLSEL_FIPOLSEL0_1                  1U     /* 1 : The fault input polarity is active low. A 0 at the fault
                                                       input indicates a fault.                                                  */


/* ==============================================  CFGTMR FIPOLSEL FIPOLSEL1 [1..1]  =============================================== */
                                 /* CFGTMR_FIPOLSEL_FIPOLSEL1                                                       */
#define  CFGTMR_FIPOLSEL_FIPOLSEL1_0                  0U     /* 0 : The fault input polarity is active high. A 1 at the fault
                                                       input indicates a fault.                                                  */
#define  CFGTMR_FIPOLSEL_FIPOLSEL1_1                  1U     /* 1 : The fault input polarity is active low. A 0 at the fault
                                                       input indicates a fault.                                                  */


/* ==============================================  CFGTMR FIPOLSEL FIPOLSEL2 [2..2]  =============================================== */
                                 /* CFGTMR_FIPOLSEL_FIPOLSEL2                                                       */
#define  CFGTMR_FIPOLSEL_FIPOLSEL2_0                  0U     /* 0 : The fault input polarity is active high. A 1 at the fault
                                                        input indicates a fault.                                                  */
#define  CFGTMR_FIPOLSEL_FIPOLSEL2_1                  1U     /* 1 : The fault input polarity is active low. A 0 at the fault
                                                      input indicates a fault.                                                  */


/* ==============================================  CFGTMR FIPOLSEL FIPOLSEL3 [3..3]  =============================================== */
                                 /* CFGTMR_FIPOLSEL_FIPOLSEL3                                                       */
#define  CFGTMR_FIPOLSEL_FIPOLSEL3_0                  0U     /* 0 : The fault input polarity is active high. A 1 at the fault
                                                       input indicates a fault.                                                  */
#define  CFGTMR_FIPOLSEL_FIPOLSEL3_1                  1U     /* 1 : The fault input polarity is active low. A 0 at the fault
                                                         input indicates a fault.                                                  */


/* ========================================================  SYNCFG  ========================================================= */
/* ==============================================  CFGTMR SYNCFG HWTRGD [0..0]  =============================================== */
                                 /* CFGTMR_SYNCFG_HWTRGD                                                       */
#define  CFGTMR_SYNCFG_HWTRGD_0                  0U     /* 0 : CFGTMR clears the TRIGj bit when the hardware trigger j is
                                                      detectedU where j   0U 1U2.                                               */
#define  CFGTMR_SYNCFG_HWTRGD_1                  1U     /* 1 : CFGTMR does not clear the TRIGj bit when the hardware trigger
                                                    j is detectedU where j   0U 1U2.                                          */


/* =============================================  CFGTMR SYNCFG INITVSYN [2..2]  ============================================== */
                                 /* CFGTMR_SYNCFG_INITVSYN                                                     */
#define  CFGTMR_SYNCFG_INITVSYN_0                0U     /* 0 : CNTIN register is updated with its buffer value at all rising
                                                        edges of CFGTMR input clock.                                                 */
#define  CFGTMR_SYNCFG_INITVSYN_1                1U     /* 1 : CNTIN register is updated with its buffer value by the PWM
                                                        synchronization.                                                          */


/* =============================================  CFGTMR SYNCFG ICTRLSYN [4..4]  ============================================== */
                                 /* CFGTMR_SYNCFG_ICTRLSYN                                                     */
#define  CFGTMR_SYNCFG_ICTRLSYN_0                0U     /* 0 : INVCTRL register is updated with its buffer value at all
                                                       rising edges of CFGTMR input clock.                                          */
#define  CFGTMR_SYNCFG_ICTRLSYN_1                1U     /* 1 : INVCTRL register is updated with its buffer value by the
                                                       PWM synchronization.                                                      */


/* ============================================  CFGTMR SYNCFG SWOCTRLSYN [5..5]  ============================================= */
                                 /* CFGTMR_SYNCFG_SWOCTRLSYN                                                   */
#define  CFGTMR_SYNCFG_SWOCTRLSYN_0              0U     /* 0 : SWOCTRL register is updated with its buffer value at all
                                                        rising edges of CFGTMR input clock.                                          */
#define  CFGTMR_SYNCFG_SWOCTRLSYN_1              1U     /* 1 : SWOCTRL register is updated with its buffer value by the
                                                         PWM synchronization.                                                      */


/* ==============================================  CFGTMR SYNCFG SYNMSEL [7..7]  ============================================== */
                                 /* CFGTMR_SYNCFG_SYNMSEL                                                      */
#define  CFGTMR_SYNCFG_SYNMSEL_0                 0U     /* 0 : Legacy PWM synchronization is selected.                               */
#define  CFGTMR_SYNCFG_SYNMSEL_1                 1U     /* 1 : Enhanced PWM synchronization is selected.                             */


/* ===============================================  CFGTMR SYNCFG SWTAC [8..8]  =============================================== */
                                 /* CFGTMR_SYNCFG_SWTAC                                                        */
#define  CFGTMR_SYNCFG_SWTAC_0                   0U     /* 0 : The software trigger does not activate the CFGTMR counter synchronization. */
#define  CFGTMR_SYNCFG_SWTAC_1                   1U     /* 1 : The software trigger activates the CFGTMR counter synchronization.       */


/* =============================================  CFGTMR SYNCFG SWTAWRBUF [9..9]  ============================================= */
                                 /* CFGTMR_SYNCFG_SWTAWRBUF                                                    */
#define  CFGTMR_SYNCFG_SWTAWRBUF_0               0U     /* 0 : The software trigger does not activate MODU HCRU CNTINU
                                                       and CV registers synchronization.                                         */
#define  CFGTMR_SYNCFG_SWTAWRBUF_1               1U     /* 1 : The software trigger activates MODU HCRU CNTINU and CV registers
                                                       synchronization.                                                          */


/* =============================================  CFGTMR SYNCFG SWTAOM [10..10]  ============================================== */
                                 /* CFGTMR_SYNCFG_SWTAOM                                                       */
#define  CFGTMR_SYNCFG_SWTAOM_0                  0U     /* 0 : The software trigger does not activate the OUTMASK register
                                                       synchronization.                                                          */
#define  CFGTMR_SYNCFG_SWTAOM_1                  1U     /* 1 : The software trigger activates the OUTMASK register synchronization.  */


/* ============================================  CFGTMR SYNCFG SWTAICTRL [11..11]  ============================================ */
                                 /* CFGTMR_SYNCFG_SWTAICTRL                                                    */
#define  CFGTMR_SYNCFG_SWTAICTRL_0               0U     /* 0 : The software trigger does not activate the INVCTRL register
                                                        synchronization.                                                          */
#define  CFGTMR_SYNCFG_SWTAICTRL_1               1U     /* 1 : The software trigger activates the INVCTRL register synchronization.  */


/* =============================================  CFGTMR SYNCFG SWTASWO [12..12]  ============================================= */
                                 /* CFGTMR_SYNCFG_SWTASWO                                                      */
#define  CFGTMR_SYNCFG_SWTASWO_0                 0U     /* 0 : The software trigger does not activate the SWOCTRL register
                                                         synchronization.                                                          */
#define  CFGTMR_SYNCFG_SWTASWO_1                 1U     /* 1 : The software trigger activates the SWOCTRL register synchronization.  */


