MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ===========================================  CFGTMR SWOCTRL CHSWOCTRLEN3 [3..3]  ============================================ */
                                 /* CFGTMR_SWOCTRL_CHSWOCTRLEN3                                                 */
#define  CFGTMR_SWOCTRL_CHSWOCTRLEN3_0            0U     /* 0 : The channel output is not affected by software output control.        */
#define  CFGTMR_SWOCTRL_CHSWOCTRLEN3_1            1U     /* 1 : The channel output is affected by software output control.            */

/* ===========================================  CFGTMR SWOCTRL CHSWOCTRLEN4 [4..4]  ============================================ */
                                 /* CFGTMR_SWOCTRL_CHSWOCTRLEN4                                                 */
#define  CFGTMR_SWOCTRL_CHSWOCTRLEN4_0            0U     /* 0 : The channel output is not affected by software output control.        */
#define  CFGTMR_SWOCTRL_CHSWOCTRLEN4_1            1U     /* 1 : The channel output is affected by software output control.            */

/* ===========================================  CFGTMR SWOCTRL CHSWOCTRLEN5 [5..5]  ============================================ */
                                 /* CFGTMR_SWOCTRL_CHSWOCTRLEN5                                                 */
#define  CFGTMR_SWOCTRL_CHSWOCTRLEN5_0            0U     /* 0 : The channel output is not affected by software output control.        */
#define  CFGTMR_SWOCTRL_CHSWOCTRLEN5_1            1U     /* 1 : The channel output is affected by software output control.            */

/* ===========================================  CFGTMR SWOCTRL CHSWOCTRLEN6 [6..6]  ============================================ */
                                 /* CFGTMR_SWOCTRL_CHSWOCTRLEN6                                                 */
#define  CFGTMR_SWOCTRL_CHSWOCTRLEN6_0            0U     /* 0 : The channel output is not affected by software output control.        */
#define  CFGTMR_SWOCTRL_CHSWOCTRLEN6_1            1U     /* 1 : The channel output is affected by software output control.            */

/* ===========================================  CFGTMR SWOCTRL CHSWOCTRLEN7 [7..7]  ============================================ */
                                 /* CFGTMR_SWOCTRL_CHSWOCTRLEN7                                                 */
#define  CFGTMR_SWOCTRL_CHSWOCTRLEN7_0            0U     /* 0 : The channel output is not affected by software output control.        */
#define  CFGTMR_SWOCTRL_CHSWOCTRLEN7_1            1U     /* 1 : The channel output is affected by software output control.            */


/* ============================================  CFGTMR SWOCTRL CHSWOCTRLVSEL0 [8..8]  ============================================= */
                                 /* CFGTMR_SWOCTRL_CHSWOCTRLVSEL0                                                   */
#define  CFGTMR_SWOCTRL_CHSWOCTRLVSEL0_0              0U     /* 0 : The software output control forces 0 to the channel output.           */
#define  CFGTMR_SWOCTRL_CHSWOCTRLVSEL0_1              1U     /* 1 : The software output control forces 1 to the channel output.           */

/* ============================================  CFGTMR SWOCTRL CHSWOCTRLVSEL1 [9..9]  ============================================= */
                                 /* CFGTMR_SWOCTRL_CHSWOCTRLVSEL1                                                   */
#define  CFGTMR_SWOCTRL_CHSWOCTRLVSEL1_0              0U     /* 0 : The software output control forces 0 to the channel output.           */
#define  CFGTMR_SWOCTRL_CHSWOCTRLVSEL1_1              1U     /* 1 : The software output control forces 1 to the channel output.           */

/* ============================================  CFGTMR SWOCTRL CHSWOCTRLVSEL2 [10..10]  ============================================= */
                                 /* CFGTMR_SWOCTRL_CHSWOCTRLVSEL2                                                   */
#define  CFGTMR_SWOCTRL_CHSWOCTRLVSEL2_0              0U     /* 0 : The software output control forces 0 to the channel output.           */
#define  CFGTMR_SWOCTRL_CHSWOCTRLVSEL2_1              1U     /* 1 : The software output control forces 1 to the channel output.           */

/* ============================================  CFGTMR SWOCTRL CHSWOCTRLVSEL3 [11..11]  ============================================= */
                                 /* CFGTMR_SWOCTRL_CHSWOCTRLVSEL3                                                   */
#define  CFGTMR_SWOCTRL_CHSWOCTRLVSEL3_0              0U     /* 0 : The software output control forces 0 to the channel output.           */
#define  CFGTMR_SWOCTRL_CHSWOCTRLVSEL3_1              1U     /* 1 : The software output control forces 1 to the channel output.           */

/* ============================================  CFGTMR SWOCTRL CHSWOCTRLVSEL4 [12..12]  ============================================= */
                                 /* CFGTMR_SWOCTRL_CHSWOCTRLVSEL4                                                   */
#define  CFGTMR_SWOCTRL_CHSWOCTRLVSEL4_0              0U     /* 0 : The software output control forces 0 to the channel output.           */
#define  CFGTMR_SWOCTRL_CHSWOCTRLVSEL4_1              1U     /* 1 : The software output control forces 1 to the channel output.           */

/* ============================================  CFGTMR SWOCTRL CHSWOCTRLVSEL5 [13..13]  ============================================= */
                                 /* CFGTMR_SWOCTRL_CHSWOCTRLVSEL5                                                   */
#define  CFGTMR_SWOCTRL_CHSWOCTRLVSEL5_0              0U     /* 0 : The software output control forces 0 to the channel output.           */
#define  CFGTMR_SWOCTRL_CHSWOCTRLVSEL5_1              1U     /* 1 : The software output control forces 1 to the channel output.           */

/* ============================================  CFGTMR SWOCTRL CHSWOCTRLVSEL6 [14..14]  ============================================= */
                                 /* CFGTMR_SWOCTRL_CHSWOCTRLVSEL6                                                   */
#define  CFGTMR_SWOCTRL_CHSWOCTRLVSEL6_0              0U     /* 0 : The software output control forces 0 to the channel output.           */
#define  CFGTMR_SWOCTRL_CHSWOCTRLVSEL6_1              1U     /* 1 : The software output control forces 1 to the channel output.           */

/* ============================================  CFGTMR SWOCTRL CHSWOCTRLVSEL7 [15..15]  ============================================= */
                                 /* CFGTMR_SWOCTRL_CHSWOCTRLVSEL7                                                   */
#define  CFGTMR_SWOCTRL_CHSWOCTRLVSEL7_0              0U     /* 0 : The software output control forces 0 to the channel output.           */
#define  CFGTMR_SWOCTRL_CHSWOCTRLVSEL7_1              1U     /* 1 : The software output control forces 1 to the channel output.           */



