MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* =========================================================  PWMLD  ========================================================= */
/* ===============================================  CFGTMR PWMLD CHMSEL0 [0..0]  =============================================== */
                                 /* CFGTMR_PWMLD_CHMSEL0                                                        */
#define  CFGTMR_PWMLD_CHMSEL0_0                   0U     /* 0 : Channel match is not included as a reload opportunity.                */
#define  CFGTMR_PWMLD_CHMSEL0_1                   1U     /* 1 : Channel match is included as a reload opportunity.                    */

/* ===============================================  CFGTMR PWMLD CHMSEL1 [1..1]  =============================================== */
                                 /* CFGTMR_PWMLD_CHMSEL1                                                        */
#define  CFGTMR_PWMLD_CHMSEL1_0                   0U     /* 0 : Channel match is not included as a reload opportunity.                */
#define  CFGTMR_PWMLD_CHMSEL1_1                   1U     /* 1 : Channel match is included as a reload opportunity.                    */

/* ===============================================  CFGTMR PWMLD CHMSEL2 [2..2]  =============================================== */
                                 /* CFGTMR_PWMLD_CHMSEL2                                                        */
#define  CFGTMR_PWMLD_CHMSEL2_0                   0U     /* 0 : Channel match is not included as a reload opportunity.                */
#define  CFGTMR_PWMLD_CHMSEL2_1                   1U     /* 1 : Channel match is included as a reload opportunity.                    */

/* ===============================================  CFGTMR PWMLD CHMSEL3 [3..3]  =============================================== */
                                 /* CFGTMR_PWMLD_CHMSEL3                                                        */
#define  CFGTMR_PWMLD_CHMSEL3_0                   0U     /* 0 : Channel match is not included as a reload opportunity.                */
#define  CFGTMR_PWMLD_CHMSEL3_1                   1U     /* 1 : Channel match is included as a reload opportunity.                    */

/* ===============================================  CFGTMR PWMLD CHMSEL4 [4..4]  =============================================== */
                                 /* CFGTMR_PWMLD_CHMSEL4                                                        */
#define  CFGTMR_PWMLD_CHMSEL4_0                   0U     /* 0 : Channel match is not included as a reload opportunity.                */
#define  CFGTMR_PWMLD_CHMSEL4_1                   1U     /* 1 : Channel match is included as a reload opportunity.                    */

/* ===============================================  CFGTMR PWMLD CHMSEL5 [5..5]  =============================================== */
                                 /* CFGTMR_PWMLD_CHMSEL5                                                        */
#define  CFGTMR_PWMLD_CHMSEL5_0                   0U     /* 0 : Channel match is not included as a reload opportunity.                */
#define  CFGTMR_PWMLD_CHMSEL5_1                   1U     /* 1 : Channel match is included as a reload opportunity.                    */

/* ===============================================  CFGTMR PWMLD CHMSEL6 [6..6]  =============================================== */
                                 /* CFGTMR_PWMLD_CHMSEL6                                                        */
#define  CFGTMR_PWMLD_CHMSEL6_0                   0U     /* 0 : Channel match is not included as a reload opportunity.                */
#define  CFGTMR_PWMLD_CHMSEL6_1                   1U     /* 1 : Channel match is included as a reload opportunity.                    */

/* ===============================================  CFGTMR PWMLD CHMSEL7 [7..7]  =============================================== */
                                 /* CFGTMR_PWMLD_CHMSEL7                                                        */
#define  CFGTMR_PWMLD_CHMSEL7_0                   0U     /* 0 : Channel match is not included as a reload opportunity.                */
#define  CFGTMR_PWMLD_CHMSEL7_1                   1U     /* 1 : Channel match is included as a reload opportunity.                    */



/* ===============================================  CFGTMR PWMLD HCREN [8..8]  ================================================ */
                                 /* CFGTMR_PWMLD_HCREN                                                         */
#define  CFGTMR_PWMLD_HCREN_0                    0U     /* 0 : Half cycle reload is disabled and it is not considered as
                                                        a reload opportunity.                                                     */
#define  CFGTMR_PWMLD_HCREN_1                    1U     /* 1 : Half cycle reload is enabled and it is considered as a reload
                                                        opportunity.                                                              */


/* ===============================================  CFGTMR PWMLD LUVEN [9..9]  ================================================ */
                                 /* CFGTMR_PWMLD_LUVEN                                                         */
#define  CFGTMR_PWMLD_LUVEN_0                    0U     /* 0 : Loading updated values is disabled.                                   */
#define  CFGTMR_PWMLD_LUVEN_1                    1U     /* 1 : Loading updated values is enabled.                                    */


/* ==============================================  CFGTMR PWMLD GLOKEN [10..10]  ============================================== */
                                 /* CFGTMR_PWMLD_GLOKEN                                                        */
#define  CFGTMR_PWMLD_GLOKEN_0                   0U     /* 0 : Global Load Ok disabled.                                              */
#define  CFGTMR_PWMLD_GLOKEN_1                   1U     /* 1 : Global Load OK enabled. A pulse event on the module global
                                                     load input sets the LDOK bit.                                             */


/* ===============================================  CFGTMR PWMLD GLOP [11..11]  =============================================== */
                                 /* CFGTMR_PWMLD_GLOP                                                          */
#define  CFGTMR_PWMLD_GLOP_0                     0U     /* 0 : No action.                                                            */
#define  CFGTMR_PWMLD_GLOP_1                     1U     /* 1 : LDOK bit is set.                                                      */


