MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ==========================================================  HC  =========================================================== */
/* ========================================================  P0DCFG  ========================================================= */
/* ==============================================  CFGTMR P0DCFG PSCCFG [6..7]  =============================================== */
                                 /* CFGTMR_PDCFG_PDCFG_P0DCFG_PSCCFG                                           */
#define  CFGTMR_PDCFG_PDCFG_P0DCFG_PSCCFG_0x_0   0U     /* 0x_0 : Divide the CFGTMR input clock by 1.                                   */
#define  CFGTMR_PDCFG_PDCFG_P0DCFG_PSCCFG_0x_1   1U     /* 0x_1 : Divide the CFGTMR input clock by 1.                                   */
#define  CFGTMR_PDCFG_PDCFG_P0DCFG_PSCCFG_10     2U     /* 10 : Divide the CFGTMR input clock by 4.                                     */
#define  CFGTMR_PDCFG_PDCFG_P0DCFG_PSCCFG_11     3U     /* 11 : Divide the CFGTMR input clock by 16.                                    */


/* ========================================================  P1DCFG  ========================================================= */
/* ==============================================  CFGTMR P1DCFG PSCCFG [6..7]  =============================================== */
                                 /* CFGTMR_PDCFG_PDCFG_P1DCFG_PSCCFG                                           */
#define  CFGTMR_PDCFG_PDCFG_P1DCFG_PSCCFG_0x_0   0U     /* 0x_0 : Divide the CFGTMR input clock by 1.                                   */
#define  CFGTMR_PDCFG_PDCFG_P1DCFG_PSCCFG_0x_1   1U     /* 0x_1 : Divide the CFGTMR input clock by 1.                                   */
#define  CFGTMR_PDCFG_PDCFG_P1DCFG_PSCCFG_10     2U     /* 10 : Divide the CFGTMR input clock by 4.                                     */
#define  CFGTMR_PDCFG_PDCFG_P1DCFG_PSCCFG_11     3U     /* 11 : Divide the CFGTMR input clock by 16.                                    */


/* ========================================================  P2DCFG  ========================================================= */
/* ==============================================  CFGTMR P2DCFG PSCCFG [6..7]  =============================================== */
                                 /* CFGTMR_PDCFG_PDCFG_P2DCFG_PSCCFG                                           */
#define  CFGTMR_PDCFG_PDCFG_P2DCFG_PSCCFG_0x_0   0U     /* 0x_0 : Divide the CFGTMR input clock by 1.                                   */
#define  CFGTMR_PDCFG_PDCFG_P2DCFG_PSCCFG_0x_1   1U     /* 0x_1 : Divide the CFGTMR input clock by 1.                                   */
#define  CFGTMR_PDCFG_PDCFG_P2DCFG_PSCCFG_10     2U     /* 10 : Divide the CFGTMR input clock by 4.                                     */
#define  CFGTMR_PDCFG_PDCFG_P2DCFG_PSCCFG_11     3U     /* 11 : Divide the CFGTMR input clock by 16.                                    */


/* ========================================================  P3DCFG  ========================================================= */
/* ==============================================  CFGTMR P3DCFG PSCCFG [6..7]  =============================================== */
                                 /* CFGTMR_PDCFG_PDCFG_P3DCFG_PSCCFG                                           */
#define  CFGTMR_PDCFG_PDCFG_P3DCFG_PSCCFG_0x_0   0U     /* 0x_0 : Divide the CFGTMR input clock by 1.                                   */
#define  CFGTMR_PDCFG_PDCFG_P3DCFG_PSCCFG_0x_1   1U     /* 0x_1 : Divide the CFGTMR input clock by 1.                                   */
#define  CFGTMR_PDCFG_PDCFG_P3DCFG_PSCCFG_10     2U     /* 10 : Divide the CFGTMR input clock by 4.                                     */
#define  CFGTMR_PDCFG_PDCFG_P3DCFG_PSCCFG_11     3U     /* 11 : Divide the CFGTMR input clock by 16.                                    */


/* ==========================================================  MMV  ========================================================== */
/* =========================================================  MCH0M  ========================================================= */
/* =========================================================  MCH1M  ========================================================= */
/* =========================================================  MCH2M  ========================================================= */
/* =========================================================  MCH3M  ========================================================= */
/* =========================================================  MCH4M  ========================================================= */
/* =========================================================  MCH5M  ========================================================= */
/* =========================================================  MCH6M  ========================================================= */
/* =========================================================  MCH7M  ========================================================= */


/* =========================================================================================================================== */
/* ================                                           ADC                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  CSTS1  ========================================================= */
/* ===============================================  ADC CSTS1 ICHSEL [0..4]  =============================================== */
                                    /* ADC_CSTS1_ICHSEL                                            */
#define ADC_CSTS1_ICHSEL_00000   0U      /* 00000 : Exernal channel 0 is selected as input.                    */
#define ADC_CSTS1_ICHSEL_00001   1U      /* 00001 : Exernal channel 1 is selected as input.                    */
#define ADC_CSTS1_ICHSEL_00010   2U      /* 00010 : Exernal channel 2 is selected as input.                    */
#define ADC_CSTS1_ICHSEL_00011   3U      /* 00011 : Exernal channel 3 is selected as input.                    */
#define ADC_CSTS1_ICHSEL_00100   4U      /* 00100 : Exernal channel 4 is selected as input.                    */
#define ADC_CSTS1_ICHSEL_00101   5U      /* 00101 : Exernal channel 5 is selected as input.                    */
#define ADC_CSTS1_ICHSEL_00110   6U      /* 00110 : Exernal channel 6 is selected as input.                    */
#define ADC_CSTS1_ICHSEL_00111   7U      /* 00111 : Exernal channel 7 is selected as input.                    */
#define ADC_CSTS1_ICHSEL_01000   8U      /* 01000 : Exernal channel 8 is selected as input.                    */
#define ADC_CSTS1_ICHSEL_01001   9U      /* 01001 : Exernal channel 9 is selected as input.                    */
#define ADC_CSTS1_ICHSEL_01010   10U     /* 01010 : Exernal channel 10 is selected as input.                   */
#define ADC_CSTS1_ICHSEL_01011   11U     /* 01011 : Exernal channel 11 is selected as input.                   */
#define ADC_CSTS1_ICHSEL_01100   12U     /* 01100 : Exernal channel 12 is selected as input.                   */
#define ADC_CSTS1_ICHSEL_01101   13U     /* 01101 : Exernal channel 13 is selected as input.                   */
#define ADC_CSTS1_ICHSEL_01110   14U     /* 01110 : Exernal channel 14 is selected as input.                   */
#define ADC_CSTS1_ICHSEL_01111   15U     /* 01111 : Exernal channel 15 is selected as input.                   */
#define ADC_CSTS1_ICHSEL_10010   18U     /* 10010 : Reserved                                                   */
#define ADC_CSTS1_ICHSEL_10011   19U     /* 10011 : Reserved                                                   */
#define ADC_CSTS1_ICHSEL_10101   21U     /* 10101 : Internal channel 0 is selected as input.                   */
#define ADC_CSTS1_ICHSEL_10110   22U     /* 10110 : Internal channel 1 is selected as input.                   */
#define ADC_CSTS1_ICHSEL_10111   23U     /* 10111 : Internal channel 2 is selected as input.                   */
#define ADC_CSTS1_ICHSEL_11010   26U     /* 11010 : Reserved                                                   */
#define ADC_CSTS1_ICHSEL_11011   27U     /* 11011 : Band Gap                                                   */
#define ADC_CSTS1_ICHSEL_11100   28U     /* 11100 : Internal channel 3 is selected as input.                   */
#define ADC_CSTS1_ICHSEL_11101   29U     /* 11101 : VREFSH is selected as input. Voltage reference selected
                                                     is determined by CSTS2[REFSEL].                                             */
#define ADC_CSTS1_ICHSEL_11110   30U     /* 11110 : VREFSL is selected as input. Voltage reference selected
                                                     is determined by CSTS2[REFSEL].                                             */
#define ADC_CSTS1_ICHSEL_11111   31U     /* 11111 : Reserved                                                   */

