MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ================================================  ADC CSTS2 DMAEN [2..2]  ================================================ */
                                    /* ADC_CSTS2_DMAEN                                                          */
#define ADC_CSTS2_DMAEN_0                     0U      /* 0 : DMA is disabled.                                               */
#define ADC_CSTS2_DMAEN_1                     1U      /* 1 : DMA is enabled and will assert the ADC DMA request during
                                                     an ADC conversion complete event   which is indicated when
                                                     any SC1n[COCO] flag is asserted.                                          */

/* ===============================================  ADC CSTS2 COMPEN [5..5]  ================================================ */
                                    /* ADC_CSTS2_COMPEN                                                         */
#define ADC_CSTS2_COMPEN_0                    0U      /* 0 : Compare function disabled.                                     */
#define ADC_CSTS2_COMPEN_1                    1U      /* 1 : Compare function enabled.                                      */

/* ===============================================  ADC CSTS2 CTRGSEL [6..6]  =============================================== */
                                    /* ADC_CSTS2_CTRGSEL                                                        */
#define ADC_CSTS2_CTRGSEL_0                   0U      /* 0 : Software trigger selected.                                     */
#define ADC_CSTS2_CTRGSEL_1                   1U      /* 1 : Hardware trigger selected.                                     */

/* ================================================  ADC CSTS2 CFLAG [7..7]  ================================================ */
                                    /* ADC_CSTS2_CFLAG                                                   */
#define ADC_CSTS2_CFLAG_0                     0U      /* 0 : Conversion not in progress.                                    */
#define ADC_CSTS2_CFLAG_1                     1U      /* 1 : Conversion in progress.                                        */

/* ==============================================  ADC CSTS2 TRGSTS [16..19]  =============================================== */
                                    /* ADC_CSTS2_TRGSTS                                                  */
#define ADC_CSTS2_TRGSTS_0                    0U      /* 0 : No trigger request has been latched                            */
#define ADC_CSTS2_TRGSTS_1                    1U      /* 1 : A trigger request has been latched                             */

/* ==============================================  ADC CSTS2 TRGEFLG [24..27]  ============================================== */
                                    /* ADC_CSTS2_TRGEFLG                                                        */
#define ADC_CSTS2_TRGEFLG_0                   0U      /* 0 : No error has occurred                                          */
#define ADC_CSTS2_TRGEFLG_1                   1U      /* 1 : An error has occurred                                          */

/* =========================================================  CSTS3  ========================================================= */
/* ===============================================  ADC CSTS3 HAVGCFG [0..1]  =============================================== */
                                   /* ADC_CSTS3_HAVGCFG                                                        */
#define ADC_CSTS3_HAVGCFG_00                  0U      /* 00 : 4 samples averaged.                                           */
#define ADC_CSTS3_HAVGCFG_01                  1U      /* 01 : 8 samples averaged.                                           */
#define ADC_CSTS3_HAVGCFG_10                  2U      /* 10 : 16 samples averaged.                                          */
#define ADC_CSTS3_HAVGCFG_11                  3U      /* 11 : 32 samples averaged.                                          */

/* ===============================================  ADC CSTS3 HAVGEN [2..2]  ================================================ */
                                  /* ADC_CSTS3_HAVGEN                                                         */
#define ADC_CSTS3_HAVGEN_0                    0U      /* 0 : Hardware average function disabled.                            */
#define ADC_CSTS3_HAVGEN_1                    1U      /* 1 : Hardware average function enabled.                             */

/* ===============================================  ADC CSTS3 CONTCEN [3..3]  =============================================== */
                                  /* ADC_CSTS3_CONTCEN                                                        */
#define ADC_CSTS3_CONTCEN_0                   0U      /* 0 : One conversion will be performed (or one set of conversions
                                                     if AVGE is set) after a conversion is initiated.                          */
#define ADC_CSTS3_CONTCEN_1                   1U      /* 1 : Continuous conversions will be performed (or continuous
                                                     sets of conversions  if AVGE is set) after a conversion
                                                     is initiated.                                                             */

 /* ===============================================  ADC CSTS3 CAL [7..7]  =============================================== */
                                  /* ADC_CSTS3_CAL                                                        */
#define ADC_CSTS3_CAL_0                   0U      /* 0 : The calibration sequence is completed                              */
#define ADC_CSTS3_CAL_1                   1U      /* 1 : The ADC begins the calibration sequence                            */

/* =========================================================  BOEC  ========================================================== */
/* ==========================================================  OEC  ========================================================== */
/* =========================================================  UOEC  ========================================================== */
/* =========================================================  XOEC  ========================================================== */
/* =========================================================  YOEC  ========================================================== */
/* =========================================================  GEAF  ========================================================== */
/* =========================================================  UGEC  ========================================================= */
/* =========================================================  GCALS  ========================================================= */
/* ========================================================  PSGCAL3  ======================================================== */
/* ========================================================  PSGCAL2  ======================================================== */
/* ========================================================  PSGCAL1  ======================================================== */
/* ========================================================  PSGCAL0  ======================================================== */
/* ========================================================  PSGCALX  ======================================================== */
/* ========================================================  PSGCAL9  ======================================================== */
/* ========================================================  GCALOS  ========================================================= */
/* =======================================================  PSGCALOV3  ======================================================= */
/* =======================================================  PSGCALOV2  ======================================================= */
/* =======================================================  PSGCALOV1  ======================================================= */
/* =======================================================  PSGCALOV0  ======================================================= */
/* =======================================================  PSGCALOVX  ======================================================= */
/* =======================================================  PSGCALOV9  ======================================================= */


/* =========================================================================================================================== */
/* ================                                          LPSPI                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  VERID  ========================================================= */
/* =============================================  LPSPI VERID FEATURE [0..15]  ============================================== */
                                  /* LPSPI_VERID_FEATURE                                                      */
#define LPSPI_VERID_FEATURE_0000000000000100   4U     /* 0000000000000100 : Standard feature set supporting 32-bit shift
                                                     register.                                                                 */

