MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* =========================================================  PARA  ========================================================= */
/* =========================================================  CTRL  ========================================================== */
/* ================================================  LPSPI CTRL MEN [0..0]  ================================================= */
                                 /* LPSPI_CTRL_MEN                                                           */
#define LPSPI_CTRL_MEN_0                      0U      /* 0 : Module is disabled.                                            */
#define LPSPI_CTRL_MEN_1                      1U      /* 1 : Module is enabled.                                             */

/* ===============================================  LPSPI CTRL SWRST [1..1]  ================================================ */
                                  /* LPSPI_CTRL_SWRST                                                         */
#define LPSPI_CTRL_SWRST_0                    0U      /* 0 : Master logic is not reset.                                     */
#define LPSPI_CTRL_SWRST_1                    1U      /* 1 : Master logic is reset.                                         */

/* ==============================================  LPSPI CTRL DOZEDIS [2..2]  =============================================== */
                                 /* LPSPI_CTRL_DOZEDIS                                                       */
#define LPSPI_CTRL_DOZEDIS_0                  0U      /* 0 : Module is enabled in Doze mode.                                */
#define LPSPI_CTRL_DOZEDIS_1                  1U      /* 1 : Module is disabled in Doze mode.                               */

/* ===============================================  LPSPI CTRL DBGEN [3..3]  ================================================ */
                                  /* LPSPI_CTRL_DBGEN                                                         */
#define LPSPI_CTRL_DBGEN_0                    0U      /* 0 : Module is disabled in debug mode.                              */
#define LPSPI_CTRL_DBGEN_1                    1U      /* 1 : Module is enabled in debug mode.                               */

/* ===============================================  LPSPI CTRL TXFRST [8..8]  =============================================== */
                                 /* LPSPI_CTRL_TXFRST                                                        */
#define LPSPI_CTRL_TXFRST_0                   0U      /* 0 : No effect.                                                     */
#define LPSPI_CTRL_TXFRST_1                   1U      /* 1 : Transmit FIFO is reset.                                        */

/* ===============================================  LPSPI CTRL RXFRST [9..9]  =============================================== */
                                 /* LPSPI_CTRL_RXFRST                                                        */
#define LPSPI_CTRL_RXFRST_0                   0U      /* 0 : No effect.                                                     */
#define LPSPI_CTRL_RXFRST_1                   1U      /* 1 : Receive FIFO is reset.                                         */

/* ==========================================================  STS  ========================================================== */
/* ==============================================  LPSPI STS TXDATAFLG [0..0]  ============================================== */
                                 /* LPSPI_STS_TXDATAFLG                                                      */
#define LPSPI_STS_TXDATAFLG_0                 0U      /* 0 : Transmit data not requested.                                   */
#define LPSPI_STS_TXDATAFLG_1                 1U      /* 1 : Transmit data is requested.                                    */

/* ==============================================  LPSPI STS RXDATAFLG [1..1]  ============================================== */
                                  /* LPSPI_STS_RXDATAFLG                                                      */
#define LPSPI_STS_RXDATAFLG_0                 0U      /* 0 : Receive Data is not ready.                                     */
#define LPSPI_STS_RXDATAFLG_1                 1U      /* 1 : Receive data is ready.                                         */

/* ===============================================  LPSPI STS RXWCFLG [8..8]  =============================================== */
                                  /* LPSPI_STS_RXWCFLG                                                        */
#define LPSPI_STS_RXWCFLG_0                   0U      /* 0 : Transfer word not completed.                                   */
#define LPSPI_STS_RXWCFLG_1                   1U      /* 1 : Transfer word completed.                                       */

/* ===============================================  LPSPI STS FTXCFLG [9..9]  =============================================== */
                                  /* LPSPI_STS_FTXCFLG                                                        */
#define LPSPI_STS_FTXCFLG_0                   0U      /* 0 : Frame transfer has not completed.                              */
#define LPSPI_STS_FTXCFLG_1                   1U      /* 1 : Frame transfer has completed.                                  */

/* ==============================================  LPSPI STS TXCFLG [10..10]  =============================================== */
                                /* LPSPI_STS_TXCFLG                                                         */
#define LPSPI_STS_TXCFLG_0                    0U      /* 0 : All transfers have not completed.                              */
#define LPSPI_STS_TXCFLG_1                    1U      /* 1 : All transfers have completed.                                  */

/* ==============================================  LPSPI STS TXEFLG [11..11]  =============================================== */
                                  /* LPSPI_STS_TXEFLG                                                         */
#define LPSPI_STS_TXEFLG_0                    0U      /* 0 : Transmit FIFO underrun has not occurred.                       */
#define LPSPI_STS_TXEFLG_1                    1U      /* 1 : Transmit FIFO underrun has occurred                            */

/* ==============================================  LPSPI STS RXEFLG [12..12]  =============================================== */
                                 /* LPSPI_STS_RXEFLG                                                         */
#define LPSPI_STS_RXEFLG_0                    0U      /* 0 : Receive FIFO has not overflowed.                               */
#define LPSPI_STS_RXEFLG_1                    1U      /* 1 : Receive FIFO has overflowed.                                   */

/* ==============================================  LPSPI STS RXMFLG [13..13]  =============================================== */
                                  /* LPSPI_STS_RXMFLG                                                         */
#define LPSPI_STS_RXMFLG_0                    0U      /* 0 : Have not received matching data.                               */
#define LPSPI_STS_RXMFLG_1                    1U      /* 1 : Have received matching data.                                   */

/* ==============================================  LPSPI STS BSYFLG [24..24]  =============================================== */
                                  /* LPSPI_STS_BSYFLG                                                         */
#define LPSPI_STS_BSYFLG_0                    0U      /* 0 : LPSPI is idle.                                                 */
#define LPSPI_STS_BSYFLG_1                    1U      /* 1 : LPSPI is busy.                                                 */

/* =========================================================  IEN  ========================================================= */
/* ===============================================  LPSPI IEN TXIEN [0..0]  =============================================== */
                                  /* LPSPI_IEN_TXIEN                                                        */
#define LPSPI_IEN_TXIEN_0                   0U      /* 0 : Interrupt disabled.                                            */
#define LPSPI_IEN_TXIEN_1                   1U      /* 1 : Interrupt enabled                                              */

/* ===============================================  LPSPI IEN RXIEN [1..1]  =============================================== */
                                  /* LPSPI_IEN_RXIEN                                                        */
#define LPSPI_IEN_RXIEN_0                   0U      /* 0 : Interrupt disabled.                                            */
#define LPSPI_IEN_RXIEN_1                   1U      /* 1 : Interrupt enabled.                                             */

/* ==============================================  LPSPI IEN RXWCIEN [8..8]  ============================================== */
                                  /* LPSPI_IEN_RXWCIEN                                                      */
#define LPSPI_IEN_RXWCIEN_0                 0U      /* 0 : Interrupt disabled.                                            */
#define LPSPI_IEN_RXWCIEN_1                 1U      /* 1 : Interrupt enabled.                                             */

/* ==============================================  LPSPI IEN FTCIEN [9..9]  =============================================== */
                                  /* LPSPI_IEN_FTCIEN                                                       */
#define LPSPI_IEN_FTCIEN_0                  0U      /* 0 : Interrupt disabled.                                            */
#define LPSPI_IEN_FTCIEN_1                  1U      /* 1 : Interrupt enabled.                                             */

/* =============================================  LPSPI IEN TXCIEN [10..10]  ============================================== */
                                  /* LPSPI_IEN_TXCIEN                                                       */
#define LPSPI_IEN_TXCIEN_0                  0U      /* 0 : Interrupt disabled.                                            */
#define LPSPI_IEN_TXCIEN_1                  1U      /* 1 : Interrupt enabled.                                             */

