MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ==============================================  LPSPI CFG1 IOPCFG [24..25]  ============================================== */
                                   /* LPSPI_CFG1_IOPCFG                                                        */
#define LPSPI_CFG1_IOPCFG_00                  0U      /* 00 : SIN is used for input data and SOUT for output data.          */
#define LPSPI_CFG1_IOPCFG_01                  1U      /* 01 : SIN is used for both input and output data.                   */
#define LPSPI_CFG1_IOPCFG_10                  2U      /* 10 : SOUT is used for both input and output data.                  */
#define LPSPI_CFG1_IOPCFG_11                  3U      /* 11 : SOUT is used for input data and SIN for output data.          */

/* ==============================================  LPSPI CFG1 ODCFG [26..26]  =============================================== */
                                  /* LPSPI_CFG1_ODCFG                                                         */
#define LPSPI_CFG1_ODCFG_0                    0U      /* 0 : Output data retains last value when chip select is negated.    */
#define LPSPI_CFG1_ODCFG_1                    1U      /* 1 : Output data is tristated when chip select is negated.          */

/* =============================================  LPSPI CFG1 PCSELCFG [27..27]  ============================================= */
                                  /* LPSPI_CFG1_PCSELCFG                                                      */
#define LPSPI_CFG1_PCSELCFG_0                 0U      /* 0 : PCS[3:2] are enabled.                                          */
#define LPSPI_CFG1_PCSELCFG_1                 1U      /* 1 : PCS[3:2] are disabled.                                         */

/* ========================================================  DATAM0  ========================================================= */
/* ========================================================  DATAM1  ========================================================= */
/* ========================================================  CLKCFG  ========================================================= */
/* =========================================================  FCTRL  ========================================================= */
/* =========================================================  FSTS  ========================================================== */
/* =========================================================  TXCMD  ========================================================= */
/* ============================================  LPSPI TXCMD TXWIDCFG [16..17]  ============================================= */
                                  /* LPSPI_TXCMD_TXWIDCFG                                                     */
#define LPSPI_TXCMD_TXWIDCFG_00               0U      /* 00 : Single bit transfer.                                          */
#define LPSPI_TXCMD_TXWIDCFG_01               1U      /* 01 : Two bit transfer.                                             */
#define LPSPI_TXCMD_TXWIDCFG_10               2U      /* 10 : Four bit transfer.                                            */

/* ===========================================  LPSPI TXCMD TXDATAMASK [18..18]  ============================================ */
                                 /* LPSPI_TXCMD_TXDATAMASK                                                   */
#define LPSPI_TXCMD_TXDATAMASK_0              0U      /* 0 : Normal transfer.                                               */
#define LPSPI_TXCMD_TXDATAMASK_1              1U      /* 1 : Mask transmit data.                                            */

/* ===========================================  LPSPI TXCMD RXDATAMASK [19..19]  ============================================ */
                                   /* LPSPI_TXCMD_RXDATAMASK                                                   */
#define LPSPI_TXCMD_RXDATAMASK_0              0U      /* 0 : Normal transfer.                                               */
#define LPSPI_TXCMD_RXDATAMASK_1              1U      /* 1 : Receive data is masked.                                        */

/* =============================================  LPSPI TXCMD CTXCMDW [20..20]  ============================================= */
                                 /* LPSPI_TXCMD_CTXCMDW                                                      */
#define LPSPI_TXCMD_CTXCMDW_0                 0U      /* 0 : Command word for start of new transfer.                        */
#define LPSPI_TXCMD_CTXCMDW_1                 1U      /* 1 : Command word for continuing transfer.                          */

/* ==============================================  LPSPI TXCMD CTXEN [21..21]  ============================================== */
                                  /* LPSPI_TXCMD_CTXEN                                                        */
#define LPSPI_TXCMD_CTXEN_0                   0U      /* 0 : Continuous transfer disabled.                                  */
#define LPSPI_TXCMD_CTXEN_1                   1U      /* 1 : Continuous transfer enabled.                                   */

/* ==============================================  LPSPI TXCMD BSEN [22..22]  =============================================== */
                                  /* LPSPI_TXCMD_BSEN                                                         */
#define LPSPI_TXCMD_BSEN_0                    0U      /* 0 : Byte swap disabled.                                            */
#define LPSPI_TXCMD_BSEN_1                    1U      /* 1 : Byte swap enabled.                                             */

/* ============================================  LPSPI TXCMD DATAFSEL [23..23]  ============================================= */
                                  /* LPSPI_TXCMD_DATAFSEL                                                     */
#define LPSPI_TXCMD_DATAFSEL_0                0U      /* 0 : Data is transferred MSB first.                                 */
#define LPSPI_TXCMD_DATAFSEL_1                1U      /* 1 : Data is transferred LSB first.                                 */

