MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ==============================================  LPSPI TXCMD PCSEL [24..25]  ============================================== */
                                  /* LPSPI_TXCMD_PCSEL                                                        */
#define LPSPI_TXCMD_PCSEL_00                  0U      /* 00 : Transfer using LPSPI_PCS[0]                                   */
#define LPSPI_TXCMD_PCSEL_01                  1U      /* 01 : Transfer using LPSPI_PCS[1]                                   */
#define LPSPI_TXCMD_PCSEL_10                  2U      /* 10 : Transfer using LPSPI_PCS[2]                                   */
#define LPSPI_TXCMD_PCSEL_11                  3U      /* 11 : Transfer using LPSPI_PCS[3]                                   */

/* =============================================  LPSPI TXCMD PVALCFG [27..29]  ============================================= */
                                   /* LPSPI_TXCMD_PVALCFG                                                      */
#define LPSPI_TXCMD_PVALCFG_000               0U      /* 000 : Divide by 1.                                                 */
#define LPSPI_TXCMD_PVALCFG_001               1U      /* 001 : Divide by 2.                                                 */
#define LPSPI_TXCMD_PVALCFG_010               2U      /* 010 : Divide by 4.                                                 */
#define LPSPI_TXCMD_PVALCFG_011               3U      /* 011 : Divide by 8.                                                 */
#define LPSPI_TXCMD_PVALCFG_100               4U      /* 100 : Divide by 16.                                                */
#define LPSPI_TXCMD_PVALCFG_101               5U      /* 101 : Divide by 32.                                                */
#define LPSPI_TXCMD_PVALCFG_110               6U      /* 110 : Divide by 64.                                                */
#define LPSPI_TXCMD_PVALCFG_111               7U      /* 111 : Divide by 128.                                               */

/* =============================================  LPSPI TXCMD CLKPHA [30..30]  ============================================== */
                                  /* LPSPI_TXCMD_CLKPHA                                                       */
#define LPSPI_TXCMD_CLKPHA_0                  0U      /* 0 : Data is captured on the leading edge of SCK and changed
                                                     on the following edge.                                                    */
#define LPSPI_TXCMD_CLKPHA_1                  1U      /* 1 : Data is changed on the leading edge of SCK and captured
                                                     on the following edge.                                                    */

/* =============================================  LPSPI TXCMD CLKPOL [31..31]  ============================================== */
                                /* LPSPI_TXCMD_CLKPOL                                                       */
#define LPSPI_TXCMD_CLKPOL_0                  0U      /* 0 : The inactive state value of SCK is low.                        */
#define LPSPI_TXCMD_CLKPOL_1                  1U      /* 1 : The inactive state value of SCK is high.                       */

/* ========================================================  TXDATA  ========================================================= */
/* =========================================================  RXSTS  ========================================================= */
/* =============================================  LPSPI RXSTS FDATAWCFG [0..0]  ============================================= */
                                /* LPSPI_RXSTS_FDATAWCFG                                                    */
#define LPSPI_RXSTS_FDATAWCFG_0               0U      /* 0 : Subsequent data word received after LPSPI_PCS assertion.       */
#define LPSPI_RXSTS_FDATAWCFG_1               1U      /* 1 : First data word received after LPSPI_PCS assertion.            */

/* ===============================================  LPSPI RXSTS RXFE [1..1]  ================================================ */
                                 /* LPSPI_RXSTS_RXFE                                                         */
#define LPSPI_RXSTS_RXFE_0                    0U      /* 0 : RX FIFO is not empty.                                          */
#define LPSPI_RXSTS_RXFE_1                    1U      /* 1 : RX FIFO is empty.                                              */

/* ========================================================  RXDATA  ========================================================= */


/* =========================================================================================================================== */
/* ================                                           PDU                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  CSTS  ========================================================== */
/* ================================================  PDU CSTS LDSUS [0..0]  ================================================ */
                                  /* PDU_CSTS_LDSUS                                                          */
#define PDU_CSTS_LDSUS_0                     0U      /* 0 : PDU LDSUS                                 */
#define PDU_CSTS_LDSUS_1                     1U      /* 1 : PDU LDSUS                               */


/* ================================================  PDU CSTS CMODEN [1..1]  ================================================ */
                                  /* PDU_CSTS_CMODEN                                                          */
#define PDU_CSTS_CMODEN_0                     0U      /* 0 : PDU operation in One-Shot mode                                 */
#define PDU_CSTS_CMODEN_1                     1U      /* 1 : PDU operation in Continuous mode                               */

