MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ==============================================  PDU CSTS MULPSCCFG [2..3]  =============================================== */
                                  /* PDU_CSTS_MULPSCCFG                                                       */
#define PDU_CSTS_MULPSCCFG_00                 0U      /* 00 : Multiplication factor is 1.                                   */
#define PDU_CSTS_MULPSCCFG_01                 1U      /* 01 : Multiplication factor is 10.                                  */
#define PDU_CSTS_MULPSCCFG_10                 2U      /* 10 : Multiplication factor is 20.                                  */
#define PDU_CSTS_MULPSCCFG_11                 3U      /* 11 : Multiplication factor is 40.                                  */

/* =================================================  PDU CSTS IEN [5..5]  ================================================== */
                                  /* PDU_CSTS_IEN                                                             */
#define PDU_CSTS_IEN_0                        0U      /* 0 : PDU interrupt disabled.                                        */
#define PDU_CSTS_IEN_1                        1U      /* 1 : PDU interrupt enabled.                                         */

/* =================================================  PDU CSTS IFLG [6..6]  ================================================== */
                                  /* PDU_CSTS_IFLG                                                             */
#define PDU_CSTS_IFLG_0                        0U      /* 0 : PDU interrupt flag.                                        */
#define PDU_CSTS_IFLG_1                        1U      /* 1 : PDU interrupt flag.                                         */


/* ================================================  PDU CSTS PDUEN [7..7]  ================================================= */
                                  /* PDU_CSTS_PDUEN                                                           */
#define PDU_CSTS_PDUEN_0                      0U      /* 0 : PDU disabled. Counter is off.                                  */
#define PDU_CSTS_PDUEN_1                      1U      /* 1 : PDU enabled.                                                   */

/* ==============================================  PDU CSTS TRGINTSEL [8..11]  ============================================== */
                                   /* PDU_CSTS_TRGINTSEL                                                       */
#define PDU_CSTS_TRGINTSEL_0000               0U      /* 0000 : Trigger-In 0 is selected.                                   */
#define PDU_CSTS_TRGINTSEL_0001               1U      /* 0001 : Trigger-In 1 is selected.                                   */
#define PDU_CSTS_TRGINTSEL_0010               2U      /* 0010 : Trigger-In 2 is selected.                                   */
#define PDU_CSTS_TRGINTSEL_0011               3U      /* 0011 : Trigger-In 3 is selected.                                   */
#define PDU_CSTS_TRGINTSEL_0100               4U      /* 0100 : Trigger-In 4 is selected.                                   */
#define PDU_CSTS_TRGINTSEL_0101               5U      /* 0101 : Trigger-In 5 is selected.                                   */
#define PDU_CSTS_TRGINTSEL_0110               6U      /* 0110 : Trigger-In 6 is selected.                                   */
#define PDU_CSTS_TRGINTSEL_0111               7U      /* 0111 : Trigger-In 7 is selected.                                   */
#define PDU_CSTS_TRGINTSEL_1000               8U      /* 1000 : Trigger-In 8 is selected.                                   */
#define PDU_CSTS_TRGINTSEL_1001               9U      /* 1001 : Trigger-In 9 is selected.                                   */
#define PDU_CSTS_TRGINTSEL_1010               10U     /* 1010 : Trigger-In 10 is selected.                                  */
#define PDU_CSTS_TRGINTSEL_1011               11U     /* 1011 : Trigger-In 11 is selected.                                  */
#define PDU_CSTS_TRGINTSEL_1100               12U     /* 1100 : Trigger-In 12 is selected.                                  */
#define PDU_CSTS_TRGINTSEL_1101               13U     /* 1101 : Trigger-In 13 is selected.                                  */
#define PDU_CSTS_TRGINTSEL_1110               14U     /* 1110 : Trigger-In 14 is selected.                                  */
#define PDU_CSTS_TRGINTSEL_1111               15U     /* 1111 : Software trigger is selected.                               */

/* =============================================  PDU CSTS PSCDIVCFG [12..14]  ============================================== */
                                   /* PDU_CSTS_PSCDIVCFG                                                       */
#define PDU_CSTS_PSCDIVCFG_000                0U      /* 000 : Counting uses the peripheral clock divided by MULT (the
                                                     multiplication factor).                                                   */
#define PDU_CSTS_PSCDIVCFG_001                1U      /* 001 : Counting uses the peripheral clock divided by 2 x MULT
                                                     (the multiplication factor).                                              */
#define PDU_CSTS_PSCDIVCFG_010                2U      /* 010 : Counting uses the peripheral clock divided by 4 x MULT
                                                     (the multiplication factor).                                              */
#define PDU_CSTS_PSCDIVCFG_011                3U      /* 011 : Counting uses the peripheral clock divided by 8 x MULT
                                                     (the multiplication factor).                                              */
#define PDU_CSTS_PSCDIVCFG_100                4U      /* 100 : Counting uses the peripheral clock divided by 16 x MULT
                                                     (the multiplication factor).                                              */
#define PDU_CSTS_PSCDIVCFG_101                5U      /* 101 : Counting uses the peripheral clock divided by 32 x MULT
                                                     (the multiplication factor).                                              */
#define PDU_CSTS_PSCDIVCFG_110                6U      /* 110 : Counting uses the peripheral clock divided by 64 x MULT
                                                     (the multiplication factor).                                              */
#define PDU_CSTS_PSCDIVCFG_111                7U      /* 111 : Counting uses the peripheral clock divided by 128 x MULT
                                                     (the multiplication factor).                                              */

/* ===============================================  PDU CSTS DMAEN [15..15]  ================================================ */
                                   /* PDU_CSTS_DMAEN                                                           */
#define PDU_CSTS_DMAEN_0                      0U      /* 0 : DMA disabled.                                                  */
#define PDU_CSTS_DMAEN_1                      1U      /* 1 : DMA enabled.                                                   */

/* ============================================  PDU CSTS SWTRGSEL [16..16]  ================================================ */
                                   /* PDU_CSTS_DMAEN                                                           */
#define PDU_CSTS_SWTRGSEL_0                   0U      /* 0 : DMA disabled.                                                  */
#define PDU_CSTS_SWTRGSEL_1                   1U      /* 1 : DMA enabled.                                                   */

