MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ==============================================  PDU CSTS SEQEIEN [17..17]  =============================================== */
                                  /* PDU_CSTS_SEQEIEN                                                         */
#define PDU_CSTS_SEQEIEN_0                    0U      /* 0 : PDU sequence error interrupt disabled.                         */
#define PDU_CSTS_SEQEIEN_1                    1U      /* 1 : PDU sequence error interrupt enabled.                          */

/* ==============================================  PDU CSTS LDMODSEL [18..19]  ============================================== */
                                  /* PDU_CSTS_LDMODSEL                                                        */
#define PDU_CSTS_LDMODSEL_00                  0U      /* 00 : The internal registers are loaded with the values from
                                                     their buffers  immediately after 1 is written to LDOK.                    */
#define PDU_CSTS_LDMODSEL_01                  1U      /* 01 : The internal registers are loaded with the values from
                                                     their buffers when the PDU counter (CNT) = MOD + 1 CNT
                                                     delay elapsed  after 1 is written to LDOK.                                */
#define PDU_CSTS_LDMODSEL_10                  2U      /* 10 : The internal registers are loaded with the values from
                                                     their buffers when a trigger input event is detected  after
                                                     1 is written to LDOK.                                                     */
#define PDU_CSTS_LDMODSEL_11                  3U      /* 11 : The internal registers are loaded with the values from
                                                     their buffers when either the PDU counter (CNT) = MOD +
                                                     1 CNT delay elapsed  or a trigger input event is detected
                                                     after 1 is written to LDOK.                                               */

/* ==========================================================  CNTPRD  ========================================================== */
/* ==========================================================  CNTCUR  ========================================================== */
/* =========================================================  SINTDLY  ========================================================== */
/* =======================================================  CHnCTRL1  ======================================================== */
/* =============================================  PDU CHnCTRL1 CHPTOEN [0..7]  ============================================== */
                                   /* PDU_CHnCTRL1_CHPTOEN                                     */
#define PDU_CHnCTRL1_CHPTOEN_0   0U   /* 0 : PDU channels corresponding pre-trigger disabled.               */
#define PDU_CHnCTRL1_CHPTOEN_1   1U   /* 1 : PDU channels corresponding pre-trigger enabled.                */

/* ============================================  PDU CHnCTRL1 CHPTOSEL [8..15]  ============================================= */
                                   /* PDU_CHnCTRL1_CHPTOSEL                                    */
#define PDU_CHnCTRL1_CHPTOSEL_0   0U  /* 0 : PDU channels corresponding pre-trigger is in bypassed mode.
                                                     The pre-trigger asserts one peripheral clock cycle after
                                                     a rising edge is detected on selected trigger input source
                                                     or software trigger is selected and SWTRIG is written with
                                                     1.                                                                        */
#define PDU_CHnCTRL1_CHPTOSEL_1   1U  /* 1 : PDU channels corresponding pre-trigger asserts when the
                                                     counter reaches the channel delay register and one peripheral
                                                     clock cycle after a rising edge is detected on selected
                                                     trigger input source or software trigger is selected and
                                                     SWTRIG is written with 1.                                                 */

/* =============================================  PDU CHnCTRL1 PTBBEN [16..23]  ============================================= */
                                  /* PDU_CHnCTRL1_PTBBEN                                      */
#define PDU_CHnCTRL1_PTBBEN_0   0U    /* 0 : PDU channels corresponding pre-trigger back-to-back operation
                                                     disabled.                                                                 */
#define PDU_CHnCTRL1_PTBBEN_1   1U    /* 1 : PDU channels corresponding pre-trigger back-to-back operation
                                                     enabled.                                                                  */

/* ========================================================  CHnSTS  ========================================================= */
/* ==============================================  PDU CHnSTS CHPTEFLG [0..7]  ============================================== */
#define PDU_CHnSTS_CHPTEFLG_0     0U      /* 0 : Sequence error not detected on PDU channels corresponding
                                                     pre-trigger.                                                              */
#define PDU_CHnSTS_CHPTEFLG_1     1U      /* 1 : Sequence error detected on PDU channels corresponding pre-trigger.
                                                     ADCn block can be triggered for a conversion by one pre-trigger
                                                     from PDU channel n. When one conversion  which is triggered
                                                     by one of the pre-triggers from PDU channel n  is in progress
                                                     new trigger from PDU channels corresponding pre-trigger
                                                     m cannot be accepted by ADCn  and ERR[m] is set. Writing
                                                     0s to clear the sequence error flags.                                     */

/* =========================================================  CHnD0  ========================================================= */
/* =========================================================  CHnD1  ========================================================= */
/* =========================================================  CHnD2  ========================================================= */
/* =========================================================  CHnD3  ========================================================= */
/* =========================================================  CHnD4  ========================================================= */
/* =========================================================  CHnD5  ========================================================= */
/* =========================================================  CHnD6  ========================================================= */
/* =========================================================  CHnD7  ========================================================= */
/* =================================================  PDU POEN POEN [0..7]  ================================================= */
                                   /* PDU_POEN_POEN                                                            */
#define PDU_POEN_POEN_0                       0U      /* 0 : PDU Pulse-Out disabled                                         */
#define PDU_POEN_POEN_1                       1U      /* 1 : PDU Pulse-Out enabled                                          */

/* =========================================================  PODLY  ========================================================== */


/* =========================================================================================================================== */
/* ================                                            CRC                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  DATA  ========================================================== */
/* ==========================================================  POLY  ========================================================== */
/* =========================================================  CTRL  ========================================================== */
/* ===============================================  CRC CTRL WIDCRCP [24..24]  =============================================== */
                                  /* CRC_CTRL_WIDCRCP                                                          */
#define CRC_CTRL_WIDCRCP_0                     0U      /* 0 : 16-bit CRC protocol.                                           */
#define CRC_CTRL_WIDCRCP_1                     1U      /* 1 : 32-bit CRC protocol.                                           */

/* ===============================================  CRC CTRL WASVAL [25..25]  ================================================ */
                                  /* CRC_CTRL_WASVAL                                                    */
#define CRC_CTRL_WASVAL_0                      0U      /* 0 : Writes to the CRC data register are data values.               */
#define CRC_CTRL_WASVAL_1                      1U      /* 1 : Writes to the CRC data register are seed values.               */

/* ==============================================  CRC CTRL XOR_RDATA [26..26]  ============================================== */
                                 /* CRC_CTRL_XOR_RDATA                                                 */
#define CRC_CTRL_XOR_RDATA_0                   0U      /* 0 : No XOR on reading.                                             */
#define CRC_CTRL_XOR_RDATA_1                   1U      /* 1 : Invert or complement the read value of the CRC Data register.  */

/* ===============================================  CRC CTRL TTRSEL [28..29]  ================================================ */
                                   /* CRC_CTRL_TTRSEL                                                    */
#define CRC_CTRL_TTRSEL_00                     0U      /* 00 : No transposition.                                             */
#define CRC_CTRL_TTRSEL_01                     1U      /* 01 : Bits in bytes are transposed; bytes are not transposed.       */
#define CRC_CTRL_TTRSEL_10                     2U      /* 10 : Both bits in bytes and bytes are transposed.                  */
#define CRC_CTRL_TTRSEL_11                     3U      /* 11 : Only bytes are transposed; no bits in a byte are transposed.  */

