MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ===============================================  CRC CTRL TTWSEL [30..31]  ================================================ */
                                   /* CRC_CTRL_TTWSEL                                                    */
#define CRC_CTRL_TTWSEL_00                     0U      /* 00 : No transposition.                                             */
#define CRC_CTRL_TTWSEL_01                     1U      /* 01 : Bits in bytes are transposed; bytes are not transposed.       */
#define CRC_CTRL_TTWSEL_10                     2U      /* 10 : Both bits in bytes and bytes are transposed.                  */
#define CRC_CTRL_TTWSEL_11                     3U      /* 11 : Only bytes are transposed; no bits in a byte are transposed.  */



/* =========================================================================================================================== */
/* ================                                          LPITMR                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  VERID  ========================================================= */
/* =========================================================  PARA  ========================================================= */
/* =========================================================  MCTRL  ========================================================= */
/* =============================================  LPITMR MCTRL PCLKTMREN [0..0]  ============================================= */
                                 /* LPITMR_MCTRL_PCLKTMREN                                                    */
#define LPITMR_MCTRL_PCLKTMREN_0               0U      /* 0 : Peripheral clock to timers is disabled                         */
#define LPITMR_MCTRL_PCLKTMREN_1               1U      /* 1 : Peripheral clock to timers is enabled                          */

/* ===============================================  LPITMR MCTRL SWRET [1..1]  =============================================== */
                                 /* LPITMR_MCTRL_SWRET                                                 */
#define LPITMR_MCTRL_SWRET_0                   0U      /* 0 : Timer channels and registers are not reset                     */
#define LPITMR_MCTRL_SWRET_1                   1U      /* 1 : Timer channels and registers are reset                         */

/* ==============================================  LPITMR MCTRL DOZEEN [2..2]  =============================================== */
                                  /* LPITMR_MCTRL_DOZEEN                                               */
#define LPITMR_MCTRL_DOZEEN_0                  0U      /* 0 : Timer channels are stopped in DOZE mode                        */
#define LPITMR_MCTRL_DOZEEN_1                  1U      /* 1 : Timer channels continue to run in DOZE mode                    */

/* ===============================================  LPITMR MCTRL DBGEN [3..3]  =============================================== */
                                  /* LPITMR_MCTRL_DBGEN                                                 */
#define LPITMR_MCTRL_DBGEN_0                   0U      /* 0 : Timer channels are stopped in Debug mode                       */
#define LPITMR_MCTRL_DBGEN_1                   1U      /* 1 : Timer channels continue to run in Debug mode                   */

/* =========================================================  MSTS  ========================================================== */
/* ==============================================  LPITMR MSTS TITFLG0 [0..0]  =============================================== */
                                  /* LPITMR_MSTS_TITFLG0                                                */
#define LPITMR_MSTS_TITFLG0_0                  0U      /* 0 : Timer has not timed out                                        */
#define LPITMR_MSTS_TITFLG0_1                  1U      /* 1 : Timeout has occurred                                           */

/* ==============================================  LPITMR MSTS TITFLG1 [1..1]  =============================================== */
                                 /* LPITMR_MSTS_TITFLG1                                                */
#define LPITMR_MSTS_TITFLG1_0                  0U      /* 0 : Timer has not timed out                                        */
#define LPITMR_MSTS_TITFLG1_1                  1U      /* 1 : Timeout has occurred                                           */

/* ==============================================  LPITMR MSTS TITFLG2 [2..2]  =============================================== */
                                  /* LPITMR_MSTS_TITFLG2                                                */
#define LPITMR_MSTS_TITFLG2_0                  0U      /* 0 : Timer has not timed out                                        */
#define LPITMR_MSTS_TITFLG2_1                  1U      /* 1 : Timeout has occurred                                           */

/* ==============================================  LPITMR MSTS TITFLG3 [3..3]  =============================================== */
                                  /* LPITMR_MSTS_TITFLG3                                                */
#define LPITMR_MSTS_TITFLG3_0                  0U      /* 0 : Timer has not timed out                                        */
#define LPITMR_MSTS_TITFLG3_1                  1U      /* 1 : Timeout has occurred                                           */

/* =========================================================  MIEN  ========================================================== */
/* ===============================================  LPITMR MIEN TIEN0 [0..0]  ================================================ */
                                 /* LPITMR_MIEN_TIEN0                                                  */
#define LPITMR_MIEN_TIEN0_0                    0U      /* 0 : Interrupt generation is disabled                               */
#define LPITMR_MIEN_TIEN0_1                    1U      /* 1 : Interrupt generation is enabled                                */

/* ===============================================  LPITMR MIEN TIEN1 [1..1]  ================================================ */
                                   /* LPITMR_MIEN_TIEN1                                                  */
#define LPITMR_MIEN_TIEN1_0                    0U      /* 0 : Interrupt generation is disabled                               */
#define LPITMR_MIEN_TIEN1_1                    1U      /* 1 : Interrupt generation is enabled                                */

/* ===============================================  LPITMR MIEN TIEN2 [2..2]  ================================================ */
                                 /* LPITMR_MIEN_TIEN2                                                  */
#define LPITMR_MIEN_TIEN2_0                    0U      /* 0 : Interrupt generation is disabled                               */
#define LPITMR_MIEN_TIEN2_1                    1U      /* 1 : Interrupt generation is enabled                                */

/* ===============================================  LPITMR MIEN TIEN3 [3..3]  ================================================ */
                                  /* LPITMR_MIEN_TIEN3                                                  */
#define LPITMR_MIEN_TIEN3_0                    0U      /* 0 : Interrupt generation is disabled                               */
#define LPITMR_MIEN_TIEN3_1                    1U      /* 1 : Interrupt generation is enabled                                */

/* ========================================================  STMREN  ========================================================= */
/* ==============================================  LPITMR STMREN TENCH0 [0..0]  ============================================== */
                                  /* LPITMR_STMREN_TENCH0                                               */
#define LPITMR_STMREN_TENCH0_0                 0U      /* 0 : No effect                                                      */
#define LPITMR_STMREN_TENCH0_1                 1U      /* 1 : Enables the Timer Channel 0                                    */

/* ==============================================  LPITMR STMREN TENCH1 [1..1]  ============================================== */
                                  /* LPITMR_STMREN_TENCH1                                               */
#define LPITMR_STMREN_TENCH1_0                 0U      /* 0 : No Effect                                                      */
#define LPITMR_STMREN_TENCH1_1                 1U      /* 1 : Enables the Timer Channel 1                                    */

/* ==============================================  LPITMR STMREN TENCH2 [2..2]  ============================================== */
                                 /* LPITMR_STMREN_TENCH2                                               */
#define LPITMR_STMREN_TENCH2_0                 0U      /* 0 : No Effect                                                      */
#define LPITMR_STMREN_TENCH2_1                 1U      /* 1 : Enables the Timer Channel 2                                    */

/* ==============================================  LPITMR STMREN TENCH3 [3..3]  ============================================== */
                                  /* LPITMR_STMREN_TENCH3                                               */
#define LPITMR_STMREN_TENCH3_0                 0U      /* 0 : No effect                                                      */
#define LPITMR_STMREN_TENCH3_1                 1U      /* 1 : Enables the Timer Channel 3                                    */

/* =======================================================  CLRTMREN  ======================================================== */
/* ===========================================  LPITMR CLRTMREN CLRTMREN0 [0..0]  ============================================ */
                                  /* LPITMR_CLRTMREN_CLRTMREN0                                          */
#define LPITMR_CLRTMREN_CLRTMREN0_0            0U      /* 0 : No action                                                      */
#define LPITMR_CLRTMREN_CLRTMREN0_1            1U      /* 1 : Clear T_EN bit for Timer Channel 0                             */

