MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ===========================================  LPITMR TMRCTRL TRGSSEL [23..23]  ============================================ */
                                  /* LPITMR_TMRCTRL_TRGSSEL                                            */
#define LPITMR_TMRCTRL_TRGSSEL_0              0U      /* 0 : Trigger source selected in external                            */
#define LPITMR_TMRCTRL_TRGSSEL_1              1U      /* 1 : Trigger source selected is the internal trigger                */




/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  TIMSEC  ========================================================= */
/* ========================================================  TIMPSC  ========================================================= */
/* ========================================================  TIMALR  ========================================================= */
/* =========================================================  TIMC  ========================================================== */
/* ================================================  RTC TIMC TIMCCFG [0..7]  ================================================ */
                                  /* RTC_TIMC_TIMCCFG                                                   */
#define RTC_TIMC_TIMCCFG_10000000              128U    /* 10000000 : Time Prescaler Register overflows every 32896 clock
                                                     cycles.                                                            */
#define RTC_TIMC_TIMCCFG_10000001              129U    /* 10000001 : Time Prescaler Register overflows every 32895 clock
                                                     cycles.                                                            */
#define RTC_TIMC_TIMCCFG_11111111              255U    /* 11111111 : Time Prescaler Register overflows every 32769 clock
                                                     cycles.                                                            */
#define RTC_TIMC_TIMCCFG_00000000              0U      /* 00000000 : Time Prescaler Register overflows every 32768 clock
                                                     cycles.                                                            */
#define RTC_TIMC_TIMCCFG_00000001              1U      /* 00000001 : Time Prescaler Register overflows every 32767 clock
                                                     cycles.                                                            */
#define RTC_TIMC_TIMCCFG_01111110              126U    /* 01111110 : Time Prescaler Register overflows every 32642 clock
                                                     cycles.                                                            */
#define RTC_TIMC_TIMCCFG_01111111              127U    /* 01111111 : Time Prescaler Register overflows every 32641 clock
                                                     cycles.                                                            */

/* =========================================================  CTRL  ========================================================== */
/* =================================================  RTC CTRL SWREN [0..0]  ================================================= */
                                  /* RTC_CTRL_SWREN                                                     */
#define RTC_CTRL_SWREN_0                       0U      /* 0 : No effect.                                                     */


/* ===============================================  RTC CTRL SACCCTRL [2..2]  ================================================ */
                                 /* RTC_CTRL_SACCCTRL                                                  */
#define RTC_CTRL_SACCCTRL_0                    0U      /* 0 : Non-supervisor mode write accesses are not supported and
                                                     generate a bus error.                                              */
#define RTC_CTRL_SACCCTRL_1                    1U      /* 1 : Non-supervisor mode write accesses are supported.              */

/* =================================================  RTC CTRL UMEN [3..3]  ================================================== */
                                  /* RTC_CTRL_UMEN                                                      */
#define RTC_CTRL_UMEN_0                        0U      /* 0 : Registers cannot be written when locked.                       */
#define RTC_CTRL_UMEN_1                        1U      /* 1 : Registers can be written when locked under limited conditions. */

/* ===============================================  RTC CTRL CLKPOSEL [5..5]  ================================================ */
                                 /* RTC_CTRL_CLKPOSEL                                                  */
#define RTC_CTRL_CLKPOSEL_0                    0U      /* 0 : The prescaler output clock (as configured by TSIC) is output
                                                     on RTC_CLKOUT.                                                     */
#define RTC_CTRL_CLKPOSEL_1                    1U      /* 1 : The RTC 32.768 kHz clock is output on RTC_CLKOUT  provided
                                                     it is output to other peripherals.                                 */

/* ================================================  RTC CTRL LPOCSEL [7..7]  ================================================ */
                                 /* RTC_CTRL_LPOCSEL                                                   */
#define RTC_CTRL_LPOCSEL_0                     0U      /* 0 : RTC prescaler increments using 32.768 kHz clock.               */
#define RTC_CTRL_LPOCSEL_1                     1U      /* 1 : RTC prescaler increments using 1 kHz LPO  bits [4:0] of
                                                     the prescaler are ignored.                                         */

/* ===============================================  RTC CTRL CLKOOUTEN [9..9]  =============================================== */
                                  /* RTC_CTRL_CLKOOUTEN                                                 */
#define RTC_CTRL_CLKOOUTEN_0                   0U      /* 0 : The 32 kHz clock is output to other peripherals.               */
#define RTC_CTRL_CLKOOUTEN_1                   1U      /* 1 : The 32 kHz clock is not output to other peripherals.           */

