MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ===============================================  RTC CTRL CLKPEN [24..24]  ================================================ */
                                  /* RTC_CTRL_CLKPEN                                                    */
#define RTC_CTRL_CLKPEN_0                      0U      /* 0 : The RTC_CLKOUT function is disabled.                           */
#define RTC_CTRL_CLKPEN_1                      1U      /* 1 : Enable RTC_CLKOUT function.                                    */

/* ==========================================================  STS  ========================================================== */
/* ===============================================  RTC STS TIMINVFLG [0..0]  ================================================ */
                                  /* RTC_STS_TIMINVFLG                                                  */
#define RTC_STS_TIMINVFLG_0                    0U      /* 0 : Time is valid.                                                 */
#define RTC_STS_TIMINVFLG_1                    1U      /* 1 : Time is invalid and time counter is read as zero.              */

/* ===============================================  RTC STS TIMOVRFLG [1..1]  ================================================ */
                                  /* RTC_STS_TIMOVRFLG                                                  */
#define RTC_STS_TIMOVRFLG_0                    0U      /* 0 : Time overflow has not occurred.                                */
#define RTC_STS_TIMOVRFLG_1                    1U      /* 1 : Time overflow has occurred and time counter is read as zero.   */

/* ===============================================  RTC STS TIMALRFLG [2..2]  ================================================ */
                                   /* RTC_STS_TIMALRFLG                                                  */
#define RTC_STS_TIMALRFLG_0                    0U      /* 0 : Time alarm has not occurred.                                   */
#define RTC_STS_TIMALRFLG_1                    1U      /* 1 : Time alarm has occurred.                                       */

/* ================================================  RTC STS TIMCNTEN [4..4]  ================================================ */
                                   /* RTC_STS_TIMCNTEN                                                   */
#define RTC_STS_TIMCNTEN_0                     0U      /* 0 : Time counter is disabled.                                      */
#define RTC_STS_TIMCNTEN_1                     1U      /* 1 : Time counter is enabled.                                       */

/* =========================================================  LOCK  ========================================================== */
/* ================================================  RTC LOCK TIMCPRO [3..3]  ================================================ */
                               /* RTC_LOCK_TIMCPRO                                                   */
#define RTC_LOCK_TIMCPRO_0                     0U      /* 0 : Time Compensation Register is locked and writes are ignored.   */
#define RTC_LOCK_TIMCPRO_1                     1U      /* 1 : Time Compensation Register is not locked and writes complete
                                                     as normal.                                                         */

/* ================================================  RTC LOCK CTRLPRO [4..4]  ================================================ */
                                 /* RTC_LOCK_CTRLPRO                                                   */
#define RTC_LOCK_CTRLPRO_0                     0U      /* 0 : Control Register is locked and writes are ignored.             */
#define RTC_LOCK_CTRLPRO_1                     1U      /* 1 : Control Register is not locked and writes complete as normal.  */

/* ================================================  RTC LOCK STSPRO [5..5]  ================================================= */
                                  /* RTC_LOCK_STSPRO                                                    */
#define RTC_LOCK_STSPRO_0                      0U      /* 0 : Status Register is locked and writes are ignored.              */
#define RTC_LOCK_STSPRO_1                      1U      /* 1 : Status Register is not locked and writes complete as normal.   */

/* ================================================  RTC LOCK LOCKPRO [6..6]  ================================================ */
                                  /* RTC_LOCK_LOCKPRO                                                   */
#define RTC_LOCK_LOCKPRO_0                     0U      /* 0 : Lock Register is locked and writes are ignored.                */
#define RTC_LOCK_LOCKPRO_1                     1U      /* 1 : Lock Register is not locked and writes complete as normal.     */

/* =========================================================  IEN  ========================================================= */
/* ================================================  RTC IEN INVIEN [0..0]  ================================================ */
                                  /* RTC_IEN_INVIEN                                                   */
#define RTC_IEN_INVIEN_0                     0U      /* 0 : Time invalid flag does not generate an interrupt.              */
#define RTC_IEN_INVIEN_1                     1U      /* 1 : Time invalid flag does generate an interrupt.                  */

/* ================================================  RTC IEN OVRIEN [1..1]  ================================================ */
                                  /* RTC_IEN_OVRIEN                                                   */
#define RTC_IEN_OVRIEN_0                     0U      /* 0 : Time overflow flag does not generate an interrupt.             */
#define RTC_IEN_OVRIEN_1                     1U      /* 1 : Time overflow flag does generate an interrupt.                 */

/* ================================================  RTC IEN ALRIEN [2..2]  ================================================ */
                                  /* RTC_IEN_ALRIEN                                                   */
#define RTC_IEN_ALRIEN_0                     0U      /* 0 : Time alarm flag does not generate an interrupt.                */
#define RTC_IEN_ALRIEN_1                     1U      /* 1 : Time alarm flag does generate an interrupt.                    */

