MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ========================================  SIM CFGTMROPT0 CFGTMR2EXCLKPINSEL [28..29]  ========================================= */
                                  /* SIM_CFGTMROPT0_CFGTMR2EXCLKPINSEL                                      */
#define SIM_CFGTMROPT0_CFGTMR2EXCLKPINSEL_00       0U      /* 00 : CFGTMR2 external clock driven by TCLK0 pin.                      */
#define SIM_CFGTMROPT0_CFGTMR2EXCLKPINSEL_01       1U      /* 01 : CFGTMR2 external clock driven by TCLK1 pin.                      */
#define SIM_CFGTMROPT0_CFGTMR2EXCLKPINSEL_10       2U      /* 10 : CFGTMR2 external clock driven by TCLK2 pin.                      */
#define SIM_CFGTMROPT0_CFGTMR2EXCLKPINSEL_11       3U      /* 11 : No clock input                                                */

/* ========================================  SIM CFGTMROPT0 CFGTMR3EXCLKPINSEL [30..31]  ========================================= */
                                  /* SIM_CFGTMROPT0_CFGTMR3EXCLKPINSEL                                      */
#define SIM_CFGTMROPT0_CFGTMR3EXCLKPINSEL_00       0U      /* 00 : CFGTMR3 external clock driven by TCLK0 pin.                      */
#define SIM_CFGTMROPT0_CFGTMR3EXCLKPINSEL_01       1U      /* 01 : CFGTMR3 external clock driven by TCLK1 pin.                      */
#define SIM_CFGTMROPT0_CFGTMR3EXCLKPINSEL_10       2U      /* 10 : CFGTMR3 external clock driven by TCLK2 pin.                      */
#define SIM_CFGTMROPT0_CFGTMR3EXCLKPINSEL_11       3U      /* 11 : No clock input                                                */

/* =======================================================  LPOCLKSEL  ======================================================= */
/* ===========================================  SIM LPOCLKSEL LPO1KCLKOEN [0..0]  ============================================ */
                                 /* SIM_LPOCLKSEL_LPO1KCLKOEN                                          */
#define SIM_LPOCLKSEL_LPO1KCLKOEN_0            0U      /* 0 : Disable 1 kHz LPO_CLK output                                   */
#define SIM_LPOCLKSEL_LPO1KCLKOEN_1            1U      /* 1 : Enable 1 kHz LPO_CLK output                                    */

/* ===========================================  SIM LPOCLKSEL LPO32KCLKOEN [1..1]  =========================================== */
                                   /* SIM_LPOCLKSEL_LPO32KCLKOEN                                         */
#define SIM_LPOCLKSEL_LPO32KCLKOEN_0           0U      /* 0 : Disable 32 kHz LPO_CLK output                                  */
#define SIM_LPOCLKSEL_LPO32KCLKOEN_1           1U      /* 1 : Enable 32 kHz LPO_CLK output                                   */

/* ============================================  SIM LPOCLKSEL CLKLPOSSEL [2..3]  ============================================ */
                                  /* SIM_LPOCLKSEL_CLKLPOSSEL                                           */
#define SIM_LPOCLKSEL_CLKLPOSSEL_00            0U      /* 00 : 128 kHz LPO_CLK                                               */
#define SIM_LPOCLKSEL_CLKLPOSSEL_01            1U      /* 01 : No clock                                                      */
#define SIM_LPOCLKSEL_CLKLPOSSEL_10            2U      /* 10 : 32 kHz LPO_CLK which is derived from the 128 kHz LPO_CLK      */
#define SIM_LPOCLKSEL_CLKLPOSSEL_11            3U      /* 11 : 1 kHz LPO_CLK which is derived from the 128 kHz LPO_CLK       */

/* ============================================  SIM LPOCLKSEL CLK32KSSEL [4..5]  ============================================ */
                                  /* SIM_LPOCLKSEL_CLK32KSSEL                                           */
#define SIM_LPOCLKSEL_CLK32KSSEL_00            0U      /* 00 : SYSOSCDIV1_CLK                                                  */
#define SIM_LPOCLKSEL_CLK32KSSEL_01            1U      /* 01 : 32 kHz LPO_CLK                                                */
#define SIM_LPOCLKSEL_CLK32KSSEL_10            2U      /* 10 : RTC_CLKIN clock                                               */
#define SIM_LPOCLKSEL_CLK32KSSEL_11            3U      /* 11 : HSIDIV1_CLK                                                  */

/* ========================================================  ADCOPT  ========================================================= */
/* =============================================  SIM ADCOPT ADC0TRGSSEL [0..0]  ============================================= */
                                   /* SIM_ADCOPT_ADC0TRGSSEL                                             */
#define SIM_ADCOPT_ADC0TRGSSEL_0               0U      /* 0 : PDU output                                                     */
#define SIM_ADCOPT_ADC0TRGSSEL_1               1U      /* 1 : TRGMUX output                                                  */

/* =============================================  SIM ADCOPT ADC0SWPTSEL [1..3]  ============================================= */
                                   /* SIM_ADCOPT_ADC0SWPTSEL                                             */
#define SIM_ADCOPT_ADC0SWPTSEL_000             0U      /* 000 : Software pretrigger disabled                                 */
#define SIM_ADCOPT_ADC0SWPTSEL_001             1U      /* 001 : Reserved (do not use)                                        */
#define SIM_ADCOPT_ADC0SWPTSEL_010             2U      /* 010 : Reserved (do not use)                                        */
#define SIM_ADCOPT_ADC0SWPTSEL_011             3U      /* 011 : Reserved (do not use)                                        */
#define SIM_ADCOPT_ADC0SWPTSEL_100             4U      /* 100 : Software pretrigger 0                                        */
#define SIM_ADCOPT_ADC0SWPTSEL_101             5U      /* 101 : Software pretrigger 1                                        */
#define SIM_ADCOPT_ADC0SWPTSEL_110             6U      /* 110 : Software pretrigger 2                                        */
#define SIM_ADCOPT_ADC0SWPTSEL_111             7U      /* 111 : Software pretrigger 3                                        */

/* =============================================  SIM ADCOPT ADC0PTSSEL [4..5]  ============================================== */
                                  /* SIM_ADCOPT_ADC0PTSSEL                                              */
#define SIM_ADCOPT_ADC0PTSSEL_00               0U      /* 00 : PDU pretrigger (default)                                      */
#define SIM_ADCOPT_ADC0PTSSEL_01               1U      /* 01 : TRGMUX pretrigger                                             */
#define SIM_ADCOPT_ADC0PTSSEL_10               2U      /* 10 : Software pretrigger                                           */

/* =============================================  SIM ADCOPT ADC1TRGSSEL [8..8]  ============================================= */
                                  /* SIM_ADCOPT_ADC1TRGSSEL                                             */
#define SIM_ADCOPT_ADC1TRGSSEL_0               0U      /* 0 : PDU output                                                     */
#define SIM_ADCOPT_ADC1TRGSSEL_1               1U      /* 1 : TRGMUX output                                                  */

/* ============================================  SIM ADCOPT ADC1SWPTSEL [9..11]  ============================================= */
                                /* SIM_ADCOPT_ADC1SWPTSEL                                             */
#define SIM_ADCOPT_ADC1SWPTSEL_000             0U      /* 000 : Software pretrigger disabled                                 */
#define SIM_ADCOPT_ADC1SWPTSEL_001             1U      /* 001 : Reserved (do not use)                                        */
#define SIM_ADCOPT_ADC1SWPTSEL_010             2U      /* 010 : Reserved (do not use)                                        */
#define SIM_ADCOPT_ADC1SWPTSEL_011             3U      /* 011 : Reserved (do not use)                                        */
#define SIM_ADCOPT_ADC1SWPTSEL_100             4U      /* 100 : Software pretrigger 0                                        */
#define SIM_ADCOPT_ADC1SWPTSEL_101             5U      /* 101 : Software pretrigger 1                                        */
#define SIM_ADCOPT_ADC1SWPTSEL_110             6U      /* 110 : Software pretrigger 2                                        */
#define SIM_ADCOPT_ADC1SWPTSEL_111             7U      /* 111 : Software pretrigger 3                                        */

