MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ==============================================  CFGIO TMRCTRL TMROPCFG [16..17]  =============================================== */
                                  /* CFGIO_TMRCTRL_TMROPCFG                                                  */
#define CFGIO_TMRCTRL_TMROPCFG_0                    0U      /* 0 : Timer pin output disabled                                      */
#define CFGIO_TMRCTRL_TMROPCFG_1                    1U      /* 1 : Timer pin open drain or bidirectional output enable            */
#define CFGIO_TMRCTRL_TMROPCFG_10                   2U      /* 10 : Timer pin bidirectional output data                           */
#define CFGIO_TMRCTRL_TMROPCFG_11                   3U      /* 11 : Timer pin output                                              */

/* =============================================  CFGIO TMRCTRL TRGSSEL [22..22]  ============================================= */
                                   /* CFGIO_TMRCTRL_TRGSSEL                                               */
#define CFGIO_TMRCTRL_TRGSSEL_0                 0U      /* 0 : External trigger selected                                      */
#define CFGIO_TMRCTRL_TRGSSEL_1                 1U      /* 1 : Internal trigger selected                                      */

/* =============================================  CFGIO TMRCTRL TRGPOLCFG [23..23]  ============================================= */
                                 /* CFGIO_TMRCTRL_TRGPOLCFG                                               */
#define CFGIO_TMRCTRL_TRGPOLCFG_0                 0U      /* 0 : Trigger active high                                            */
#define CFGIO_TMRCTRL_TRGPOLCFG_1                 1U      /* 1 : Trigger active low                                             */

/* ========================================================  TMRCFG  ======================================================== */
/* ==============================================  CFGIO TMRCFG TMRSTAEN [1..1]  =============================================== */
                                 /* CFGIO_TMRCFG_TMRSTAEN                                                */
#define CFGIO_TMRCFG_TMRSTAEN_0                  0U      /* 0 : Start bit disabled                                             */
#define CFGIO_TMRCFG_TMRSTAEN_1                  1U      /* 1 : Start bit enabled                                              */

/* =============================================  CFGIO TMRCFG TMRSTOPFSEL [4..5]  ============================================= */
                                   /* CFGIO_TMRCFG_TMRSTOPFSEL                                             */
#define CFGIO_TMRCFG_TMRSTOPFSEL_0               0U      /* 0 : Stop bit disabled                                              */
#define CFGIO_TMRCFG_TMRSTOPFSEL_1               1U      /* 1 : Stop bit is enabled on timer compare                           */
#define CFGIO_TMRCFG_TMRSTOPFSEL_10              2U      /* 10 : Stop bit is enabled on timer disable                          */
#define CFGIO_TMRCFG_TMRSTOPFSEL_11              3U      /* 11 : Stop bit is enabled on timer compare and timer disable        */

/* ==============================================  CFGIO TMRCFG TMRENCFG [8..10]  ============================================== */
                                  /* CFGIO_TMRCFG_TMRENCFG                                                */
#define CFGIO_TMRCFG_TMRENCFG_0                  0U      /* 0 : Timer always enabled                                           */
#define CFGIO_TMRCFG_TMRENCFG_1                  1U      /* 1 : Timer enabled on Timer N-1 enable                              */
#define CFGIO_TMRCFG_TMRENCFG_10                 2U      /* 10 : Timer enabled on Trigger high                                 */
#define CFGIO_TMRCFG_TMRENCFG_11                 3U      /* 11 : Timer enabled on Trigger high and Pin high                    */
#define CFGIO_TMRCFG_TMRENCFG_100                4U      /* 100 : Timer enabled on Pin rising edge                             */
#define CFGIO_TMRCFG_TMRENCFG_101                5U      /* 101 : Timer enabled on Pin rising edge and Trigger high            */
#define CFGIO_TMRCFG_TMRENCFG_110                6U      /* 110 : Timer enabled on Trigger rising edge                         */
#define CFGIO_TMRCFG_TMRENCFG_111                7U      /* 111 : Timer enabled on Trigger rising or falling edge              */

/* =============================================  CFGIO TMRCFG TMRDISCFG [12..14]  ============================================= */
                                   /* CFGIO_TMRCFG_TMRDISCFG                                               */
#define CFGIO_TMRCFG_TMRDISCFG_0                 0U      /* 0 : Timer never disabled                                           */
#define CFGIO_TMRCFG_TMRDISCFG_1                 1U      /* 1 : Timer disabled on Timer N-1 disable                            */
#define CFGIO_TMRCFG_TMRDISCFG_10                2U      /* 10 : Timer disabled on Timer compare                               */
#define CFGIO_TMRCFG_TMRDISCFG_11                3U      /* 11 : Timer disabled on Timer compare and Trigger Low               */
#define CFGIO_TMRCFG_TMRDISCFG_100               4U      /* 100 : Timer disabled on Pin rising or falling edge                 */
#define CFGIO_TMRCFG_TMRDISCFG_101               5U      /* 101 : Timer disabled on Pin rising or falling edge provided
                                                     Trigger is high                                                    */
#define CFGIO_TMRCFG_TMRDISCFG_110               6U      /* 110 : Timer disabled on Trigger falling edge                       */

/* =============================================  CFGIO TMRCFG TMRRSTCFG [16..18]  ============================================= */
                                   /* CFGIO_TMRCFG_TMRRSTCFG                                               */
#define CFGIO_TMRCFG_TMRRSTCFG_0                 0U      /* 0 : Timer never reset                                              */
#define CFGIO_TMRCFG_TMRRSTCFG_10                2U      /* 10 : Timer reset on Timer Pin equal to Timer Output                */
#define CFGIO_TMRCFG_TMRRSTCFG_11                3U      /* 11 : Timer reset on Timer Trigger equal to Timer Output            */
#define CFGIO_TMRCFG_TMRRSTCFG_100               4U      /* 100 : Timer reset on Timer Pin rising edge                         */
#define CFGIO_TMRCFG_TMRRSTCFG_110               6U      /* 110 : Timer reset on Trigger rising edge                           */
#define CFGIO_TMRCFG_TMRRSTCFG_111               7U      /* 111 : Timer reset on Trigger rising or falling edge                */

