MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ==============================================  CFGIO TMRCFG TMRDCFG [20..21]  ============================================== */
                                  /* CFGIO_TMRCFG_TMRDCFG                                                 */
#define CFGIO_TMRCFG_TMRDCFG_0                   0U      /* 0 : Decrement counter on CFGIO clock  Shift clock equals Timer
                                                     output.                                                            */
#define CFGIO_TMRCFG_TMRDCFG_1                   1U      /* 1 : Decrement counter on Trigger input (both edges)  Shift clock
                                                     equals Timer output.                                               */
#define CFGIO_TMRCFG_TMRDCFG_10                  2U      /* 10 : Decrement counter on Pin input (both edges)  Shift clock
                                                     equals Pin input.                                                  */
#define CFGIO_TMRCFG_TMRDCFG_11                  3U      /* 11 : Decrement counter on Trigger input (both edges)  Shift
                                                     clock equals Trigger input.                                        */

/* ==============================================  CFGIO TMRCFG TMROCFG [24..25]  ============================================== */
                                  /* CFGIO_TMRCFG_TMROCFG                                                 */
#define CFGIO_TMRCFG_TMROCFG_0                   0U      /* 0 : Timer output is logic one when enabled and is not affected
                                                     by timer reset                                                     */
#define CFGIO_TMRCFG_TMROCFG_1                   1U      /* 1 : Timer output is logic zero when enabled and is not affected
                                                     by timer reset                                                     */
#define CFGIO_TMRCFG_TMROCFG_10                  2U      /* 10 : Timer output is logic one when enabled and on timer reset     */
#define CFGIO_TMRCFG_TMROCFG_11                  3U      /* 11 : Timer output is logic zero when enabled and on timer reset    */

/* =======================================================  TMRCOMP  ======================================================== */


/* =========================================================================================================================== */
/* ================                                           EWDT                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL  ========================================================== */
/* ================================================  EWDT CTRL EWDTEN [0..0]  ================================================ */
                                  /* EWDT_CTRL_EWDTEN                                                          */
#define  EWDT_CTRL_EWDTEN_0                  0U     /* 0 : Disable External Watchdog Timer.                                      */
#define  EWDT_CTRL_EWDTEN_1                  1U     /* 1 : Enable External Watchdog Timer.                                       */


/* ===============================================  EWDT CTRL INSIGSEL [1..1]  =============================================== */
                                  /* EWDT_CTRL_INSIGSEL                                                        */
#define  EWDT_CTRL_INSIGSEL_0                0U     /* 0 : EWM_in's Assertion State is logic zero.                               */
#define  EWDT_CTRL_INSIGSEL_1                1U     /* 1 : EWM_in's Assertion State is logic one.                                */


/* ================================================  EWDT CTRL INPEN [2..2]  ================================================= */
                                  /* EWDT_CTRL_INPEN                                                           */
#define  EWDT_CTRL_INPEN_0                   0U     /* 0 : Disable the EWM_in port.                                              */
#define  EWDT_CTRL_INPEN_1                   1U     /* 1 : Enables the EWM_in port.                                              */


/* ===============================================  EWDT CTRL INTREQEN [3..3]  =============================================== */
                                  /* EWDT_CTRL_INTREQEN                                                        */
#define  EWDT_CTRL_INTREQEN_0                0U     /* 0 : Disable External Watchdog Timer Interrupt.                            */
#define  EWDT_CTRL_INTREQEN_1                1U     /* 1 : Enable External Watchdog Timer Interrupt.                             */

/* ==========================================================  SEQ  ========================================================== */
/* =========================================================  COMPL  ========================================================= */
/* =========================================================  COMPH  ========================================================= */
/* ========================================================  CLKPSC  ========================================================= */


/* =========================================================================================================================== */
/* ================                                            TMC                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  DMACHM0CFG  ======================================================== */
/* ===============================================  TMC DMACHM0CFG LOCK [31..31]  =============================================== */
                                  /* TMC_DMAMUX0CFG_LOCK                                                   */
#define TMC_DMACHM0CFG_LOCK_0                     0U      /* 0 : Register can be written.                                       */
#define TMC_DMACHM0CFG_LOCK_1                     1U      /* 1 : Register cannot be written until the next system Reset.        */

