MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ========================================================  EXTOUT0CFG  ======================================================== */
/* ===============================================  TMC EXTOUT0CFG LOCK [31..31]  =============================================== */
                                  /* TMC_EXTOUT0CFG_LOCK                                                   */
#define TMC_EXTOUT0CFG_LOCK_0                     0U      /* 0 : Register can be written.                                       */
#define TMC_EXTOUT0CFG_LOCK_1                     1U      /* 1 : Register cannot be written until the next system Reset.        */

/* ========================================================  EXTOUT1CFG  ======================================================== */
/* ===============================================  TMC EXTOUT1CFG LOCK [31..31]  =============================================== */
                                   /* TMC_EXTOUT1CFG_LOCK                                                   */
#define TMC_EXTOUT1CFG_LOCK_0                     0U      /* 0 : Register can be written.                                       */
#define TMC_EXTOUT1CFG_LOCK_1                     1U      /* 1 : Register cannot be written until the next system Reset.        */

/* =========================================================  ADC0CFG  ========================================================== */
/* ================================================  TMC ADC0CFG LOCK [31..31]  ================================================= */
                                  /* TMC_ADC0CFG_LOCK                                                      */
#define TMC_ADC0CFG_LOCK_0                        0U      /* 0 : Register can be written.                                       */
#define TMC_ADC0CFG_LOCK_1                        1U      /* 1 : Register cannot be written until the next system Reset.        */

/* =========================================================  ADC1CFG  ========================================================== */
/* ================================================  TMC ADC1CFG LOCK [31..31]  ================================================= */
                                 /* TMC_ADC1CFG_LOCK                                                      */
#define TMC_ADC1CFG_LOCK_0                        0U      /* 0 : Register can be written.                                       */
#define TMC_ADC1CFG_LOCK_1                        1U      /* 1 : Register cannot be written until the next system Reset.        */

/* =========================================================  COMPCFG  ========================================================= */
/* ================================================  TMC COMPCFG LOCK [31..31]  ================================================ */
                                  /* TMC_COMPCFG_LOCK                                                     */
#define TMC_COMPCFG_LOCK_0                       0U      /* 0 : Register can be written.                                       */
#define TMC_COMPCFG_LOCK_1                       1U      /* 1 : Register cannot be written until the next system Reset.        */

/* =========================================================  CFGTMR0CFG  ========================================================= */
/* ================================================  TMC CFGTMR0CFG LOCK [31..31]  ================================================ */
                                   /* TMC_CFGTMR0CFG_LOCK                                                     */
#define TMC_CFGTMR0CFG_LOCK_0                       0U      /* 0 : Register can be written.                                       */
#define TMC_CFGTMR0CFG_LOCK_1                       1U      /* 1 : Register cannot be written until the next system Reset.        */

/* =========================================================  CFGTMR1CFG  ========================================================= */
/* ================================================  TMC CFGTMR1CFG LOCK [31..31]  ================================================ */
                                 /* TMC_CFGTMR1CFG_LOCK                                                     */
#define TMC_CFGTMR1CFG_LOCK_0                       0U      /* 0 : Register can be written.                                       */
#define TMC_CFGTMR1CFG_LOCK_1                       1U      /* 1 : Register cannot be written until the next system Reset.        */

/* =========================================================  CFGTMR2CFG  ========================================================= */
/* ================================================  TMC CFGTMR2CFG LOCK [31..31]  ================================================ */
                                   /* TMC_CFGTMR2CFG_LOCK                                                     */
#define TMC_CFGTMR2CFG_LOCK_0                       0U      /* 0 : Register can be written.                                       */
#define TMC_CFGTMR2CFG_LOCK_1                       1U      /* 1 : Register cannot be written until the next system Reset.        */

/* =========================================================  CFGTMR3CFG  ========================================================= */
/* ================================================  TMC CFGTMR3CFG LOCK [31..31]  ================================================ */
                                  /* TMC_CFGTMR3CFG_LOCK                                                     */
#define TMC_CFGTMR3CFG_LOCK_0                       0U      /* 0 : Register can be written.                                       */
#define TMC_CFGTMR3CFG_LOCK_1                       1U      /* 1 : Register cannot be written until the next system Reset.        */

/* =========================================================  PRD0CFG  ========================================================== */
/* ================================================  TMC PRD0CFG LOCK [31..31]  ================================================= */
                                  /* TMC_PRD0CFG_LOCK                                                      */
#define TMC_PRD0CFG_LOCK_0                        0U      /* 0 : Register can be written.                                       */
#define TMC_PRD0CFG_LOCK_1                        1U      /* 1 : Register cannot be written until the next system Reset.        */

