MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* =========================================================  PRD1CFG  ========================================================== */
/* ================================================  TMC PRD1CFG LOCK [31..31]  ================================================= */
                                  /* TMC_PRD1CFG_LOCK                                                      */
#define TMC_PRD1CFG_LOCK_0                        0U      /* 0 : Register can be written.                                       */
#define TMC_PRD1CFG_LOCK_1                        1U      /* 1 : Register cannot be written until the next system Reset.        */

/* ==========================================================  CFGIOCFG  =========================================================== */
/* =================================================  TMC CFGIOCFG LOCK [31..31]  ================================================== */
                                  /* TMC_CFGIOCFG_LOCK                                                        */
#define TMC_CFGIOCFG_LOCK_0                          0U      /* 0 : Register can be written.                                       */
#define TMC_CFGIOCFG_LOCK_1                          1U      /* 1 : Register cannot be written until the next system Reset.        */

/* ========================================================  LPITMRCFG  ======================================================== */
/* ===============================================  TMC LPITMRCFG LOCK [31..31]  =============================================== */
                                   /* TMC_LPITMRCFG_LOCK                                                   */
#define TMC_LPITMRCFG_LOCK_0                     0U      /* 0 : Register can be written.                                       */
#define TMC_LPITMRCFG_LOCK_1                     1U      /* 1 : Register cannot be written until the next system Reset.        */

/* ========================================================  LPUART0CFG  ======================================================== */
/* ===============================================  TMC LPUART0CFG LOCK [31..31]  =============================================== */
                                  /* TMC_LPUART0CFG_LOCK                                                   */
#define TMC_LPUART0CFG_LOCK_0                     0U      /* 0 : Register can be written.                                       */
#define TMC_LPUART0CFG_LOCK_1                     1U      /* 1 : Register cannot be written until the next system Reset.        */

/* ========================================================  LPUART1CFG  ======================================================== */
/* ===============================================  TMC LPUART1CFG LOCK [31..31]  =============================================== */
                                  /* TMC_LPUART1CFG_LOCK                                                   */
#define TMC_LPUART1CFG_LOCK_0                     0U      /* 0 : Register can be written.                                       */
#define TMC_LPUART1CFG_LOCK_1                     1U      /* 1 : Register cannot be written until the next system Reset.        */

/* ========================================================  LPI2CCFG  ========================================================= */
/* ===============================================  TMC LPI2CCFG LOCK [31..31]  ================================================ */
                                   /* TMC_LPI2CCFG_LOCK                                                    */
#define TMC_LPI2CCFG_LOCK_0                      0U      /* 0 : Register can be written.                                       */
#define TMC_LPI2CCFG_LOCK_1                      1U      /* 1 : Register cannot be written until the next system Reset.        */

/* ========================================================  LPSPI0CFG  ========================================================= */
/* ===============================================  TMC LPSPI0CFG LOCK [31..31]  ================================================ */
                                   /* TMC_LPSPI0CFG_LOCK                                                    */
#define TMC_LPSPI0CFG_LOCK_0                      0U      /* 0 : Register can be written.                                       */
#define TMC_LPSPI0CFG_LOCK_1                      1U      /* 1 : Register cannot be written until the next system Reset.        */

/* ========================================================  LPSPI1CFG  ========================================================= */
/* ===============================================  TMC LPSPI1CFG LOCK [31..31]  ================================================ */
                                  /* TMC_LPSPI1CFG_LOCK                                                    */
#define TMC_LPSPI1CFG_LOCK_0                      0U      /* 0 : Register can be written.                                       */
#define TMC_LPSPI1CFG_LOCK_1                      1U      /* 1 : Register cannot be written until the next system Reset.        */

/* ========================================================  LPTMRCFG  ========================================================= */
/* ===============================================  TMC LPTMRCFG LOCK [31..31]  ================================================ */
                                   /* TMC_LPTMRCFG_LOCK                                                    */
#define TMC_LPTMRCFG_LOCK_0                      0U      /* 0 : Register can be written.                                       */
#define TMC_LPTMRCFG_LOCK_1                      1U      /* 1 : Register cannot be written until the next system Reset.        */

/* =========================================================  CFGTMR4CFG  ========================================================= */
/* ================================================  TMC CFGTMR4CFG LOCK [31..31]  ================================================ */
                                  /* TMC_CFGTMR4CFG_LOCK                                                     */
#define TMC_CFGTMR4CFG_LOCK_0                       0U      /* 0 : Register can be written.                                       */
#define TMC_CFGTMR4CFG_LOCK_1                       1U      /* 1 : Register cannot be written until the next system Reset.        */

/* =========================================================  CFGTMR5CFG  ========================================================= */
/* ================================================  TMC CFGTMR5CFG LOCK [31..31]  ================================================ */
                                  /* TMC_CFGTMR5CFG_LOCK                                                     */
#define TMC_CFGTMR5CFG_LOCK_0                       0U      /* 0 : Register can be written.                                       */
#define TMC_CFGTMR5CFG_LOCK_1                       1U      /* 1 : Register cannot be written until the next system Reset.        */


/* =========================================================================================================================== */
/* ================                                            SCG                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  VERID  ========================================================= */
/* =========================================================  PARA  ========================================================== */
/* ========================================================  CLKCFG  ========================================================= */
/* =============================================  SCG CLKCFG SCLKDIVRCFG [0..3]  ============================================= */
                                  /* SCG_CLKCFG_SCLKDIVRCFG                                                    */
#define SCG_CLKCFG_SCLKDIVRCFG_0000         0U    /* 0000 : Divide-by-1                                                        */
#define SCG_CLKCFG_SCLKDIVRCFG_0001         1U    /* 0001 : Divide-by-2                                                        */
#define SCG_CLKCFG_SCLKDIVRCFG_0010         2U    /* 0010 : Divide-by-3                                                        */
#define SCG_CLKCFG_SCLKDIVRCFG_0011         3U    /* 0011 : Divide-by-4                                                        */
#define SCG_CLKCFG_SCLKDIVRCFG_0100         4U    /* 0100 : Divide-by-5                                                        */
#define SCG_CLKCFG_SCLKDIVRCFG_0101         5U    /* 0101 : Divide-by-6                                                        */
#define SCG_CLKCFG_SCLKDIVRCFG_0110         6U    /* 0110 : Divide-by-7                                                        */
#define SCG_CLKCFG_SCLKDIVRCFG_0111         7U    /* 0111 : Divide-by-8                                                        */


