MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ==========================================  SCG HSRUNCLKCTRL BCLKDIVRCFG [4..7]  ========================================== */
                                  /* SCG_HSRUNCLKCTRL_BCLKDIVRCFG                                              */
#define SCG_HSRUNCLKCTRL_BCLKDIVRCFG_0000   0U    /* 0000 : Divide-by-1                                                        */
#define SCG_HSRUNCLKCTRL_BCLKDIVRCFG_0001   1U    /* 0001 : Divide-by-2                                                        */
#define SCG_HSRUNCLKCTRL_BCLKDIVRCFG_0010   2U    /* 0010 : Divide-by-3                                                        */
#define SCG_HSRUNCLKCTRL_BCLKDIVRCFG_0011   3U    /* 0011 : Divide-by-4                                                        */
#define SCG_HSRUNCLKCTRL_BCLKDIVRCFG_0100   4U    /* 0100 : Divide-by-5                                                        */
#define SCG_HSRUNCLKCTRL_BCLKDIVRCFG_0101   5U    /* 0101 : Divide-by-6                                                        */
#define SCG_HSRUNCLKCTRL_BCLKDIVRCFG_0110   6U    /* 0110 : Divide-by-7                                                        */
#define SCG_HSRUNCLKCTRL_BCLKDIVRCFG_0111   7U    /* 0111 : Divide-by-8                                                        */
#define SCG_HSRUNCLKCTRL_BCLKDIVRCFG_1000   8U    /* 1000 : Divide-by-9                                                        */
#define SCG_HSRUNCLKCTRL_BCLKDIVRCFG_1001   9U    /* 1001 : Divide-by-10                                                       */
#define SCG_HSRUNCLKCTRL_BCLKDIVRCFG_1010   10U   /* 1010 : Divide-by-11                                                       */
#define SCG_HSRUNCLKCTRL_BCLKDIVRCFG_1011   11U   /* 1011 : Divide-by-12                                                       */
#define SCG_HSRUNCLKCTRL_BCLKDIVRCFG_1100   12U   /* 1100 : Divide-by-13                                                       */
#define SCG_HSRUNCLKCTRL_BCLKDIVRCFG_1101   13U   /* 1101 : Divide-by-14                                                       */
#define SCG_HSRUNCLKCTRL_BCLKDIVRCFG_1110   14U   /* 1110 : Divide-by-15                                                       */
#define SCG_HSRUNCLKCTRL_BCLKDIVRCFG_1111   15U   /* 1111 : Divide-by-16                                                       */


/* =========================================  SCG HSRUNCLKCTRL CCLKDIVRCFG [16..19]  ========================================= */
                                  /* SCG_HSRUNCLKCTRL_CCLKDIVRCFG                                              */
#define SCG_HSRUNCLKCTRL_CCLKDIVRCFG_0000   0U    /* 0000 : Divide-by-1                                                        */
#define SCG_HSRUNCLKCTRL_CCLKDIVRCFG_0001   1U    /* 0001 : Divide-by-2                                                        */
#define SCG_HSRUNCLKCTRL_CCLKDIVRCFG_0010   2U    /* 0010 : Divide-by-3                                                        */
#define SCG_HSRUNCLKCTRL_CCLKDIVRCFG_0011   3U    /* 0011 : Divide-by-4                                                        */
#define SCG_HSRUNCLKCTRL_CCLKDIVRCFG_0100   4U    /* 0100 : Divide-by-5                                                        */
#define SCG_HSRUNCLKCTRL_CCLKDIVRCFG_0101   5U    /* 0101 : Divide-by-6                                                        */
#define SCG_HSRUNCLKCTRL_CCLKDIVRCFG_0110   6U    /* 0110 : Divide-by-7                                                        */
#define SCG_HSRUNCLKCTRL_CCLKDIVRCFG_0111   7U    /* 0111 : Divide-by-8                                                        */
#define SCG_HSRUNCLKCTRL_CCLKDIVRCFG_1000   8U    /* 1000 : Divide-by-9                                                        */
#define SCG_HSRUNCLKCTRL_CCLKDIVRCFG_1001   9U    /* 1001 : Divide-by-10                                                       */
#define SCG_HSRUNCLKCTRL_CCLKDIVRCFG_1010   10U   /* 1010 : Divide-by-11                                                       */
#define SCG_HSRUNCLKCTRL_CCLKDIVRCFG_1011   11U   /* 1011 : Divide-by-12                                                       */
#define SCG_HSRUNCLKCTRL_CCLKDIVRCFG_1100   12U   /* 1100 : Divide-by-13                                                       */
#define SCG_HSRUNCLKCTRL_CCLKDIVRCFG_1101   13U   /* 1101 : Divide-by-14                                                       */
#define SCG_HSRUNCLKCTRL_CCLKDIVRCFG_1110   14U   /* 1110 : Divide-by-15                                                       */
#define SCG_HSRUNCLKCTRL_CCLKDIVRCFG_1111   15U   /* 1111 : Divide-by-16                                                       */


/* =========================================  SCG HSRUNCLKCTRL SYSCLKSSEL [24..27]  ========================================== */
                                  /* SCG_HSRUNCLKCTRL_SYSCLKSSEL                                               */
#define SCG_HSRUNCLKCTRL_SYSCLKSSEL_0011    3U    /* 0011 : High speed internal oscillator (HSI_CLK)                                                */
#define SCG_HSRUNCLKCTRL_SYSCLKSSEL_0110    6U    /* 0110 : System PLL (SYSPLL_CLK)                                              */


/* ======================================================  SYSCLKOSEL  ======================================================= */
/* ==========================================  SCG SYSCLKOSEL SYSCLKOSEL [24..27]  =========================================== */
                                  /* SCG_SYSCLKOSEL_SYSCLKOSEL                                                 */
#define SCG_SYSCLKOSEL_SYSCLKOSEL_0000      0U    /* 0000 : SCG SLOW Clock                                                     */
#define SCG_SYSCLKOSEL_SYSCLKOSEL_0001      1U    /* 0001 : System OSC (SYSOSC_CLK)                                              */
#define SCG_SYSCLKOSEL_SYSCLKOSEL_0010      2U    /* 0010 : Low speed internal oscillator (LSI_CLK)                                                */
#define SCG_SYSCLKOSEL_SYSCLKOSEL_0011      3U    /* 0011 : High speed internal oscillator (HSI_CLK)                                                */
#define SCG_SYSCLKOSEL_SYSCLKOSEL_0110      6U    /* 0110 : System PLL (SYSPLL_CLK)                                              */


