MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* =========================================  SCG SYSPLLCSTS SYSPLLMRSTEN [17..17]  ========================================== */
                                  /* SCG_SYSPLLCSTS_SYSPLLMRSTEN                                               */
#define SCG_SYSPLLCSTS_SYSPLLMRSTEN_0       0U    /* 0 : Clock Monitor generates interrupt when error detected                 */
#define SCG_SYSPLLCSTS_SYSPLLMRSTEN_1       1U    /* 1 : Clock Monitor generates reset when error detected                     */


/* =============================================  SCG SYSPLLCSTS LOCK [23..23]  ============================================== */
                                  /* SCG_SYSPLLCSTS_LOCK                                                       */
#define SCG_SYSPLLCSTS_LOCK_0               0U    /* 0 : Control Status Register can be written.                               */
#define SCG_SYSPLLCSTS_LOCK_1               1U    /* 1 : Control Status Register cannot be written.                            */


/* =========================================  SCG SYSPLLCSTS SYSPLLVLDFLG [24..24]  ========================================== */
                                  /* SCG_SYSPLLCSTS_SYSPLLVLDFLG                                               */
#define SCG_SYSPLLCSTS_SYSPLLVLDFLG_0       0U    /* 0 : System PLL is not enabled or clock is not valid                       */
#define SCG_SYSPLLCSTS_SYSPLLVLDFLG_1       1U    /* 1 : System PLL is enabled and output clock is valid                       */


/* ===========================================  SCG SYSPLLCSTS SYSPLLSEL [25..25]  =========================================== */
                                  /* SCG_SYSPLLCSTS_SYSPLLSEL                                                  */
#define SCG_SYSPLLCSTS_SYSPLLSEL_0          0U    /* 0 : System PLL is not the system clock source                             */
#define SCG_SYSPLLCSTS_SYSPLLSEL_1          1U    /* 1 : System PLL is the system clock source                                 */


/* =========================================  SCG SYSPLLCSTS SYSPLLCLKEFLG [26..26]  ========================================= */
                                  /* SCG_SYSPLLCSTS_SYSPLLCLKEFLG                                              */
#define SCG_SYSPLLCSTS_SYSPLLCLKEFLG_0      0U    /* 0 : System PLL Clock Monitor is disabled or has not detected
                                                     an error                                                                  */
#define SCG_SYSPLLCSTS_SYSPLLCLKEFLG_1      1U    /* 1 : System PLL Clock Monitor is enabled and detected an error.
                                                     System PLL Clock Error flag will not set when System OSC
                                                     is selected as its source and SYSOSCERR has set.                            */


/* =======================================================  SYSPLLDIV  ======================================================= */
/* ==========================================  SCG SYSPLLDIV SYSPLLDIVCFG1 [0..2]  =========================================== */
                                  /* SCG_SYSPLLDIV_SYSPLLDIVCFG1                                               */
#define SCG_SYSPLLDIV_SYSPLLDIVCFG1_000     0U    /* 000 : Clock disabled                                                      */
#define SCG_SYSPLLDIV_SYSPLLDIVCFG1_001     1U    /* 001 : Divide by 1                                                         */
#define SCG_SYSPLLDIV_SYSPLLDIVCFG1_010     2U    /* 010 : Divide by 2                                                         */
#define SCG_SYSPLLDIV_SYSPLLDIVCFG1_011     3U    /* 011 : Divide by 4                                                         */
#define SCG_SYSPLLDIV_SYSPLLDIVCFG1_100     4U    /* 100 : Divide by 8                                                         */
#define SCG_SYSPLLDIV_SYSPLLDIVCFG1_101     5U    /* 101 : Divide by 16                                                        */
#define SCG_SYSPLLDIV_SYSPLLDIVCFG1_110     6U    /* 110 : Divide by 32                                                        */
#define SCG_SYSPLLDIV_SYSPLLDIVCFG1_111     7U    /* 111 : Divide by 64                                                        */


/* ==========================================  SCG SYSPLLDIV SYSPLLDIVCFG2 [8..10]  ========================================== */
                                  /* SCG_SYSPLLDIV_SYSPLLDIVCFG2                                               */
#define SCG_SYSPLLDIV_SYSPLLDIVCFG2_000     0U    /* 000 : Clock disabled                                                      */
#define SCG_SYSPLLDIV_SYSPLLDIVCFG2_001     1U    /* 001 : Divide by 1                                                         */
#define SCG_SYSPLLDIV_SYSPLLDIVCFG2_010     2U    /* 010 : Divide by 2                                                         */
#define SCG_SYSPLLDIV_SYSPLLDIVCFG2_011     3U    /* 011 : Divide by 4                                                         */
#define SCG_SYSPLLDIV_SYSPLLDIVCFG2_100     4U    /* 100 : Divide by 8                                                         */
#define SCG_SYSPLLDIV_SYSPLLDIVCFG2_101     5U    /* 101 : Divide by 16                                                        */
#define SCG_SYSPLLDIV_SYSPLLDIVCFG2_110     6U    /* 110 : Divide by 32                                                        */
#define SCG_SYSPLLDIV_SYSPLLDIVCFG2_111     7U    /* 111 : Divide by 64                                                        */


/* =======================================================  SYSPLLCFG  ======================================================= */
/* ===========================================  SCG SYSPLLCFG PLLRDIVCFG [8..10]  ============================================ */
                                  /* SCG_SYSPLLCFG_PLLRDIVCFG                                                  */
#define  SCG_SYSPLLCFG_PLLRDIVCFG_000          0U    /* 000 : Divide Factor is 1                                                    */
#define  SCG_SYSPLLCFG_PLLRDIVCFG_001          1U    /* 001 : Divide Factor is 2                                                    */
#define  SCG_SYSPLLCFG_PLLRDIVCFG_010          2U    /* 010 : Divide Factor is 3                                                    */
#define  SCG_SYSPLLCFG_PLLRDIVCFG_011          3U    /* 011 : Divide Factor is 4                                                    */
#define  SCG_SYSPLLCFG_PLLRDIVCFG_100          4U    /* 100 : Divide Factor is 5                                                    */
#define  SCG_SYSPLLCFG_PLLRDIVCFG_101          5U    /* 101 : Divide Factor is 6                                                    */
#define  SCG_SYSPLLCFG_PLLRDIVCFG_110          6U    /* 110 : Divide Factor is 7                                                    */
#define  SCG_SYSPLLCFG_PLLRDIVCFG_111          7U    /* 111 : Divide Factor is 8                                                    */





/* =========================================================================================================================== */
/* ================                                            PCM                                            ================ */
/* =========================================================================================================================== */

