MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* =========================================================  FLASHCLK  ========================================================= */
/* ==============================================  PCM FLASHCLK FLASHEN [30..30]  =============================================== */
                                  /* PCM_FLASHCLK_FLASHEN                                                  */
#define PCM_FLASHCLK_FLASHEN_0                    0U      /* 0 : Clock disabled                                                 */
#define PCM_FLASHCLK_FLASHEN_1                    1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* ===============================================  PCM FLASHCLK PSTFLG [31..31]  =============================================== */
                                   /* PCM_FLASHCLK_PSTFLG                                                   */
#define PCM_FLASHCLK_PSTFLG_0                     0U      /* 0 : Peripheral is not present.                                     */
#define PCM_FLASHCLK_PSTFLG_1                     1U      /* 1 : Peripheral is present.                                         */

/* ========================================================  DMACHMCLK  ========================================================= */
/* =============================================  PCM DMACHMCLK DMACHMEN [30..30]  ============================================== */
                                  /* PCM_DMACHMCLK_DMACHMEN                                                */
#define PCM_DMACHMCLK_DMACHMEN_0                  0U      /* 0 : Clock disabled                                                 */
#define PCM_DMACHMCLK_DMACHMEN_1                  1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* ==============================================  PCM DMACHMCLK PSTFLG [31..31]  =============================================== */
                                  /* PCM_DMACHMCLK_PSTFLG                                                  */
#define PCM_DMACHMCLK_PSTFLG_0                    0U      /* 0 : Peripheral is not present.                                     */
#define PCM_DMACHMCLK_PSTFLG_1                    1U      /* 1 : Peripheral is present.                                         */

/* =======================================================  CAN0CLK  ======================================================== */
/* =============================================  PCM CAN0CLK CAN0EN [30..30]  ============================================== */
                                 /* PCM_CAN0CLK_CAN0EN                                                */
#define PCM_CAN0CLK_CAN0EN_0                  0U      /* 0 : Clock disabled                                                 */
#define PCM_CAN0CLK_CAN0EN_1                  1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* =============================================  PCM CAN0CLK PSTFLG [31..31]  ============================================== */
                                   /* PCM_CAN0CLK_PSTFLG                                                */
#define PCM_CAN0CLK_PSTFLG_0                  0U      /* 0 : Peripheral is not present.                                     */
#define PCM_CAN0CLK_PSTFLG_1                  1U      /* 1 : Peripheral is present.                                         */

/* =======================================================  CAN1CLK  ======================================================== */
/* =============================================  PCM CAN1CLK CAN1EN [30..30]  ============================================== */
                                  /* PCM_CAN1CLK_CAN1EN                                                */
#define PCM_CAN1CLK_CAN1EN_0                  0U      /* 0 : Clock disabled                                                 */
#define PCM_CAN1CLK_CAN1EN_1                  1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* =============================================  PCM CAN1CLK PSTFLG [31..31]  ============================================== */
                                  /* PCM_CAN1CLK_PSTFLG                                                */
#define PCM_CAN1CLK_PSTFLG_0                  0U      /* 0 : Peripheral is not present.                                     */
#define PCM_CAN1CLK_PSTFLG_1                  1U      /* 1 : Peripheral is present.                                         */

/* =========================================================  CFGTMR3CLK  ========================================================= */
/* ============================================  PCM CFGTMR3CLK CFGTMR3CSSEL [24..26]  ============================================= */
                                   /* PCM_CFGTMR3CLK_CFGTMR3CSSEL                                              */
#define PCM_CFGTMR3CLK_CFGTMR3CSSEL_000              0U      /* 000 : Clock is off. An external clock can be enabled for this
                                                     peripheral.                                                        */
#define PCM_CFGTMR3CLK_CFGTMR3CSSEL_001              1U      /* 001 : Clock option 1                                               */
#define PCM_CFGTMR3CLK_CFGTMR3CSSEL_010              2U      /* 010 : Clock option 2                                               */
#define PCM_CFGTMR3CLK_CFGTMR3CSSEL_011              3U      /* 011 : Clock option 3                                               */
#define PCM_CFGTMR3CLK_CFGTMR3CSSEL_100              4U      /* 100 : Clock option 4                                               */
#define PCM_CFGTMR3CLK_CFGTMR3CSSEL_101              5U      /* 101 : Clock option 5                                               */
#define PCM_CFGTMR3CLK_CFGTMR3CSSEL_110              6U      /* 110 : Clock option 6                                               */
#define PCM_CFGTMR3CLK_CFGTMR3CSSEL_111              7U      /* 111 : Clock option 7                                               */

