MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ==============================================  PCM CFGTMR3CLK CFGTMR3EN [30..30]  =============================================== */
                                   /* PCM_CFGTMR3CLK_CFGTMR3EN                                                  */
#define PCM_CFGTMR3CLK_CFGTMR3EN_0                    0U      /* 0 : Clock disabled                                                 */
#define PCM_CFGTMR3CLK_CFGTMR3EN_1                    1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* ===============================================  PCM CFGTMR3CLK PSTFLG [31..31]  =============================================== */
                                   /* PCM_CFGTMR3CLK_PSTFLG                                                   */
#define PCM_CFGTMR3CLK_PSTFLG_0                     0U      /* 0 : Peripheral is not present.                                     */
#define PCM_CFGTMR3CLK_PSTFLG_1                     1U      /* 1 : Peripheral is present.                                         */

/* =========================================================  ADC1CLK  ========================================================== */
/* ==============================================  PCM ADC1CLK ADC1CSSEL [24..26]  ============================================== */
                                   /* PCM_ADC1CLK_ADC1CSSEL                                                 */
#define PCM_ADC1CLK_ADC1CSSEL_000                 0U      /* 000 : Clock is off.                                                */
#define PCM_ADC1CLK_ADC1CSSEL_001                 1U      /* 001 : Clock option 1                                               */
#define PCM_ADC1CLK_ADC1CSSEL_010                 2U      /* 010 : Clock option 2                                               */
#define PCM_ADC1CLK_ADC1CSSEL_011                 3U      /* 011 : Clock option 3                                               */
#define PCM_ADC1CLK_ADC1CSSEL_100                 4U      /* 100 : Clock option 4                                               */
#define PCM_ADC1CLK_ADC1CSSEL_101                 5U      /* 101 : Clock option 5                                               */
#define PCM_ADC1CLK_ADC1CSSEL_110                 6U      /* 110 : Clock option 6                                               */
#define PCM_ADC1CLK_ADC1CSSEL_111                 7U      /* 111 : Clock option 7                                               */

/* ===============================================  PCM ADC1CLK ADC1EN [30..30]  ================================================ */
                                  /* PCM_ADC1CLK_ADC1EN                                                    */
#define PCM_ADC1CLK_ADC1EN_0                      0U      /* 0 : Clock disabled                                                 */
#define PCM_ADC1CLK_ADC1EN_1                      1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* ===============================================  PCM ADC1CLK PSTFLG [31..31]  ================================================ */
                                 /* PCM_ADC1CLK_PSTFLG                                                    */
#define PCM_ADC1CLK_PSTFLG_0                      0U      /* 0 : Peripheral is not present.                                     */
#define PCM_ADC1CLK_PSTFLG_1                      1U      /* 1 : Peripheral is present.                                         */

/* =========================================================  CAN2CLK  ========================================================== */
/* ===============================================  PCM CAN2CLK CAN2EN [30..30]  ================================================ */
                                   /* PCM_CAN2CLK_CAN2EN                                                    */
#define PCM_CAN2CLK_CAN2EN_0                      0U      /* 0 : Clock disabled                                                 */
#define PCM_CAN2CLK_CAN2EN_1                      1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* ===============================================  PCM CAN2CLK PSTFLG [31..31]  ================================================ */
                                   /* PCM_CAN2CLK_PSTFLG                                                    */
#define PCM_CAN2CLK_PSTFLG_0                      0U      /* 0 : Peripheral is not present.                                     */
#define PCM_CAN2CLK_PSTFLG_1                      1U      /* 1 : Peripheral is present.                                         */

/* ========================================================  LPSPI0CLK  ========================================================= */
/* =============================================  PCM LPSPI0CLK SPI0CSSEL [24..26]  ============================================= */
                                   /* PCM_LPSPI0CLK_SPI0CSSEL                                               */
#define PCM_LPSPI0CLK_SPI0CSSEL_000               0U      /* 000 : Clock is off.                                                */
#define PCM_LPSPI0CLK_SPI0CSSEL_001               1U      /* 001 : Clock option 1                                               */
#define PCM_LPSPI0CLK_SPI0CSSEL_010               2U      /* 010 : Clock option 2                                               */
#define PCM_LPSPI0CLK_SPI0CSSEL_011               3U      /* 011 : Clock option 3                                               */
#define PCM_LPSPI0CLK_SPI0CSSEL_100               4U      /* 100 : Clock option 4                                               */
#define PCM_LPSPI0CLK_SPI0CSSEL_101               5U      /* 101 : Clock option 5                                               */
#define PCM_LPSPI0CLK_SPI0CSSEL_110               6U      /* 110 : Clock option 6                                               */
#define PCM_LPSPI0CLK_SPI0CSSEL_111               7U      /* 111 : Clock option 7                                               */

/* =============================================  PCM LPSPI0CLK LPSPI0EN [30..30]  ============================================== */
                                   /* PCM_LPSPI0CLK_LPSPI0EN                                                */
#define PCM_LPSPI0CLK_LPSPI0EN_0                  0U      /* 0 : Clock disabled                                                 */
#define PCM_LPSPI0CLK_LPSPI0EN_1                  1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

