MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ==============================================  PCM LPSPI0CLK PSTFLG [31..31]  =============================================== */
                                   /* PCM_LPSPI0CLK_PSTFLG                                                  */
#define PCM_LPSPI0CLK_PSTFLG_0                    0U      /* 0 : Peripheral is not present.                                     */
#define PCM_LPSPI0CLK_PSTFLG_1                    1U      /* 1 : Peripheral is present.                                         */

/* ========================================================  LPSPI1CLK  ========================================================= */
/* =============================================  PCM LPSPI1CLK SPI1CSSEL [24..26]  ============================================= */
                                   /* PCM_LPSPI1CLK_SPI1CSSEL                                               */
#define PCM_LPSPI1CLK_SPI1CSSEL_000               0U      /* 000 : Clock is off.                                                */
#define PCM_LPSPI1CLK_SPI1CSSEL_001               1U      /* 001 : Clock option 1                                               */
#define PCM_LPSPI1CLK_SPI1CSSEL_010               2U      /* 010 : Clock option 2                                               */
#define PCM_LPSPI1CLK_SPI1CSSEL_011               3U      /* 011 : Clock option 3                                               */
#define PCM_LPSPI1CLK_SPI1CSSEL_100               4U      /* 100 : Clock option 4                                               */
#define PCM_LPSPI1CLK_SPI1CSSEL_101               5U      /* 101 : Clock option 5                                               */
#define PCM_LPSPI1CLK_SPI1CSSEL_110               6U      /* 110 : Clock option 6                                               */
#define PCM_LPSPI1CLK_SPI1CSSEL_111               7U      /* 111 : Clock option 7                                               */

/* =============================================  PCM LPSPI1CLK LPSPI1EN [30..30]  ============================================== */
                                  /* PCM_LPSPI1CLK_LPSPI1EN                                                */
#define PCM_LPSPI1CLK_LPSPI1EN_0                  0U      /* 0 : Clock disabled                                                 */
#define PCM_LPSPI1CLK_LPSPI1EN_1                  1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* ==============================================  PCM LPSPI1CLK PSTFLG [31..31]  =============================================== */
                                  /* PCM_LPSPI1CLK_PSTFLG                                                  */
#define PCM_LPSPI1CLK_PSTFLG_0                    0U      /* 0 : Peripheral is not present.                                     */
#define PCM_LPSPI1CLK_PSTFLG_1                    1U      /* 1 : Peripheral is present.                                         */

/* ========================================================  LPSPI2CLK  ========================================================= */
/* =============================================  PCM LPSPI2CLK SPI2CSSEL [24..26]  ============================================= */
                                  /* PCM_LPSPI2CLK_SPI2CSSEL                                               */
#define PCM_LPSPI2CLK_SPI2CSSEL_000               0U      /* 000 : Clock is off.                                                */
#define PCM_LPSPI2CLK_SPI2CSSEL_001               1U      /* 001 : Clock option 1                                               */
#define PCM_LPSPI2CLK_SPI2CSSEL_010               2U      /* 010 : Clock option 2                                               */
#define PCM_LPSPI2CLK_SPI2CSSEL_011               3U      /* 011 : Clock option 3                                               */
#define PCM_LPSPI2CLK_SPI2CSSEL_100               4U      /* 100 : Clock option 4                                               */
#define PCM_LPSPI2CLK_SPI2CSSEL_101               5U      /* 101 : Clock option 5                                               */
#define PCM_LPSPI2CLK_SPI2CSSEL_110               6U      /* 110 : Clock option 6                                               */
#define PCM_LPSPI2CLK_SPI2CSSEL_111               7U      /* 111 : Clock option 7                                               */

/* =============================================  PCM LPSPI2CLK LPSPI2EN [30..30]  ============================================== */
                                  /* PCM_LPSPI2CLK_LPSPI2EN                                                */
#define PCM_LPSPI2CLK_LPSPI2EN_0                  0U      /* 0 : Clock disabled                                                 */
#define PCM_LPSPI2CLK_LPSPI2EN_1                  1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* ==============================================  PCM LPSPI2CLK PSTFLG [31..31]  =============================================== */
                                  /* PCM_LPSPI2CLK_PSTFLG                                                  */
#define PCM_LPSPI2CLK_PSTFLG_0                    0U      /* 0 : Peripheral is not present.                                     */
#define PCM_LPSPI2CLK_PSTFLG_1                    1U      /* 1 : Peripheral is present.                                         */

/* =========================================================  PDU1CLK  ========================================================== */
/* ===============================================  PCM PDU1CLK PDU1EN [30..30]  ================================================ */
                                   /* PCM_PDU1CLK_PDU1EN                                                    */
#define PCM_PDU1CLK_PDU1EN_0                      0U      /* 0 : Clock disabled                                                 */
#define PCM_PDU1CLK_PDU1EN_1                      1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* ===============================================  PCM PDU1CLK PSTFLG [31..31]  ================================================ */
                                  /* PCM_PDU1CLK_PSTFLG                                                    */
#define PCM_PDU1CLK_PSTFLG_0                      0U      /* 0 : Peripheral is not present.                                     */
#define PCM_PDU1CLK_PSTFLG_1                      1U      /* 1 : Peripheral is present.                                         */

/* ==========================================================  CRCCLK  ========================================================== */
/* ================================================  PCM CRCCLK CRCEN [30..30]  ================================================= */
                                   /* PCM_CRCCLK_CRCEN                                                      */
#define PCM_CRCCLK_CRCEN_0                        0U      /* 0 : Clock disabled                                                 */
#define PCM_CRCCLK_CRCEN_1                        1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* ================================================  PCM CRCCLK PSTFLG [31..31]  ================================================ */
                                  /* PCM_CRCCLK_PSTFLG                                                     */
#define PCM_CRCCLK_PSTFLG_0                       0U      /* 0 : Peripheral is not present.                                     */
#define PCM_CRCCLK_PSTFLG_1                       1U      /* 1 : Peripheral is present.                                         */

