MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ==============================================  PCM CFGTMR1CLK CFGTMR1EN [30..30]  =============================================== */
                                  /* PCM_CFGTMR1CLK_CFGTMR1EN                                                  */
#define PCM_CFGTMR1CLK_CFGTMR1EN_0                    0U      /* 0 : Clock disabled                                                 */
#define PCM_CFGTMR1CLK_CFGTMR1EN_1                    1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* ===============================================  PCM CFGTMR1CLK PSTFLG [31..31]  =============================================== */
                                  /* PCM_CFGTMR1CLK_PSTFLG                                                   */
#define PCM_CFGTMR1CLK_PSTFLG_0                     0U      /* 0 : Peripheral is not present.                                     */
#define PCM_CFGTMR1CLK_PSTFLG_1                     1U      /* 1 : Peripheral is present.                                         */

/* =========================================================  CFGTMR2CLK  ========================================================= */
/* =============================================  PCM CFGTMR2CLK CFGTMR2CSSEL [24..26]  ============================================= */
                                  /* PCM_CFGTMR2CLK_CFGTMR2CSSEL                                               */
#define PCM_CFGTMR2CLK_CFGTMR2CSSEL_000               0U      /* 000 : Clock is off. An external clock can be enabled for this
                                                     peripheral.                                                        */
#define PCM_CFGTMR2CLK_CFGTMR2CSSEL_001               1U      /* 001 : Clock option 1                                               */
#define PCM_CFGTMR2CLK_CFGTMR2CSSEL_010               2U      /* 010 : Clock option 2                                               */
#define PCM_CFGTMR2CLK_CFGTMR2CSSEL_011               3U      /* 011 : Clock option 3                                               */
#define PCM_CFGTMR2CLK_CFGTMR2CSSEL_100               4U      /* 100 : Clock option 4                                               */
#define PCM_CFGTMR2CLK_CFGTMR2CSSEL_101               5U      /* 101 : Clock option 5                                               */
#define PCM_CFGTMR2CLK_CFGTMR2CSSEL_110               6U      /* 110 : Clock option 6                                               */
#define PCM_CFGTMR2CLK_CFGTMR2CSSEL_111               7U      /* 111 : Clock option 7                                               */

/* ==============================================  PCM CFGTMR2CLK CFGTMR2EN [30..30]  =============================================== */
                                 /* PCM_CFGTMR2CLK_CFGTMR2EN                                                  */
#define PCM_CFGTMR2CLK_CFGTMR2EN_0                    0U      /* 0 : Clock disabled                                                 */
#define PCM_CFGTMR2CLK_CFGTMR2EN_1                    1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* ===============================================  PCM CFGTMR2CLK PSTFLG [31..31]  =============================================== */
                                   /* PCM_CFGTMR2CLK_PSTFLG                                                   */
#define PCM_CFGTMR2CLK_PSTFLG_0                     0U      /* 0 : Peripheral is not present.                                     */
#define PCM_CFGTMR2CLK_PSTFLG_1                     1U      /* 1 : Peripheral is present.                                         */

/* =========================================================  ADC0CLK  ========================================================== */
/* ==============================================  PCM ADC0CLK ADC0CSSEL [24..26]  ============================================== */
                                  /* PCM_ADC0CLK_ADC0CSSEL                                                 */
#define PCM_ADC0CLK_ADC0CSSEL_000                 0U      /* 000 : Clock is off.                                                */
#define PCM_ADC0CLK_ADC0CSSEL_001                 1U      /* 001 : Clock option 1                                               */
#define PCM_ADC0CLK_ADC0CSSEL_010                 2U      /* 010 : Clock option 2                                               */
#define PCM_ADC0CLK_ADC0CSSEL_011                 3U      /* 011 : Clock option 3                                               */
#define PCM_ADC0CLK_ADC0CSSEL_100                 4U      /* 100 : Clock option 4                                               */
#define PCM_ADC0CLK_ADC0CSSEL_101                 5U      /* 101 : Clock option 5                                               */
#define PCM_ADC0CLK_ADC0CSSEL_110                 6U      /* 110 : Clock option 6                                               */
#define PCM_ADC0CLK_ADC0CSSEL_111                 7U      /* 111 : Clock option 7                                               */

/* ===============================================  PCM ADC0CLK ADC0EN [30..30]  ================================================ */
                                   /* PCM_ADC0CLK_ADC0EN                                                    */
#define PCM_ADC0CLK_ADC0EN_0                      0U      /* 0 : Clock disabled                                                 */
#define PCM_ADC0CLK_ADC0EN_1                      1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* ===============================================  PCM ADC0CLK PSTFLG [31..31]  ================================================ */
                                   /* PCM_ADC0CLK_PSTFLG                                                    */
#define PCM_ADC0CLK_PSTFLG_0                      0U      /* 0 : Peripheral is not present.                                     */
#define PCM_ADC0CLK_PSTFLG_1                      1U      /* 1 : Peripheral is present.                                         */

/* ==========================================================  RTCCLK  ========================================================== */
/* ================================================  PCM RTCCLK RTCEN [30..30]  ================================================= */
                                   /* PCM_RTCCLK_RTCEN                                                      */
#define PCM_RTCCLK_RTCEN_0                        0U      /* 0 : Clock disabled                                                 */
#define PCM_RTCCLK_RTCEN_1                        1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

