MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ========================================================  LPUART0CLK  ======================================================== */
/* ===========================================  PCM LPUART0CLK LPUART0CSSEL [24..26]  =========================================== */
                                  /* PCM_LPUART0CLK_LPUART0CSSEL                                           */
#define PCM_LPUART0CLK_LPUART0CSSEL_000           0U      /* 000 : Clock is off.                                                */
#define PCM_LPUART0CLK_LPUART0CSSEL_001           1U      /* 001 : Clock option 1                                               */
#define PCM_LPUART0CLK_LPUART0CSSEL_010           2U      /* 010 : Clock option 2                                               */
#define PCM_LPUART0CLK_LPUART0CSSEL_011           3U      /* 011 : Clock option 3                                               */
#define PCM_LPUART0CLK_LPUART0CSSEL_100           4U      /* 100 : Clock option 4                                               */
#define PCM_LPUART0CLK_LPUART0CSSEL_101           5U      /* 101 : Clock option 5                                               */
#define PCM_LPUART0CLK_LPUART0CSSEL_110           6U      /* 110 : Clock option 6                                               */
#define PCM_LPUART0CLK_LPUART0CSSEL_111           7U      /* 111 : Clock option 7                                               */

/* ============================================  PCM LPUART0CLK LPUART0EN [30..30]  ============================================= */
                                 /* PCM_LPUART0CLK_LPUART0EN                                              */
#define PCM_LPUART0CLK_LPUART0EN_0                0U      /* 0 : Clock disabled                                                 */
#define PCM_LPUART0CLK_LPUART0EN_1                1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* ==============================================  PCM LPUART0CLK PSTFLG [31..31]  ============================================== */
                                   /* PCM_LPUART0CLK_PSTFLG                                                 */
#define PCM_LPUART0CLK_PSTFLG_0                   0U      /* 0 : Peripheral is not present.                                     */
#define PCM_LPUART0CLK_PSTFLG_1                   1U      /* 1 : Peripheral is present.                                         */

/* ========================================================  LPUART1CLK  ======================================================== */
/* ===========================================  PCM LPUART1CLK LPUART1CSSEL [24..26]  =========================================== */
                                   /* PCM_LPUART1CLK_LPUART1CSSEL                                           */
#define PCM_LPUART1CLK_LPUART1CSSEL_000           0U      /* 000 : Clock is off.                                                */
#define PCM_LPUART1CLK_LPUART1CSSEL_001           1U      /* 001 : Clock option 1                                               */
#define PCM_LPUART1CLK_LPUART1CSSEL_010           2U      /* 010 : Clock option 2                                               */
#define PCM_LPUART1CLK_LPUART1CSSEL_011           3U      /* 011 : Clock option 3                                               */
#define PCM_LPUART1CLK_LPUART1CSSEL_100           4U      /* 100 : Clock option 4                                               */
#define PCM_LPUART1CLK_LPUART1CSSEL_101           5U      /* 101 : Clock option 5                                               */
#define PCM_LPUART1CLK_LPUART1CSSEL_110           6U      /* 110 : Clock option 6                                               */
#define PCM_LPUART1CLK_LPUART1CSSEL_111           7U      /* 111 : Clock option 7                                               */

/* ============================================  PCM LPUART1CLK LPUART1EN [30..30]  ============================================= */
                                   /* PCM_LPUART1CLK_LPUART1EN                                              */
#define PCM_LPUART1CLK_LPUART1EN_0                0U      /* 0 : Clock disabled                                                 */
#define PCM_LPUART1CLK_LPUART1EN_1                1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* ==============================================  PCM LPUART1CLK PSTFLG [31..31]  ============================================== */
                                  /* PCM_LPUART1CLK_PSTFLG                                                 */
#define PCM_LPUART1CLK_PSTFLG_0                   0U      /* 0 : Peripheral is not present.                                     */
#define PCM_LPUART1CLK_PSTFLG_1                   1U      /* 1 : Peripheral is present.                                         */

/* ========================================================  LPUART2CLK  ======================================================== */
/* ===========================================  PCM LPUART2CLK LPUART2CSSEL [24..26]  =========================================== */
                                   /* PCM_LPUART2CLK_LPUART2CSSEL                                           */
#define PCM_LPUART2CLK_LPUART2CSSEL_000           0U      /* 000 : Clock is off.                                                */
#define PCM_LPUART2CLK_LPUART2CSSEL_001           1U      /* 001 : Clock option 1                                               */
#define PCM_LPUART2CLK_LPUART2CSSEL_010           2U      /* 010 : Clock option 2                                               */
#define PCM_LPUART2CLK_LPUART2CSSEL_011           3U      /* 011 : Clock option 3                                               */
#define PCM_LPUART2CLK_LPUART2CSSEL_100           4U      /* 100 : Clock option 4                                               */
#define PCM_LPUART2CLK_LPUART2CSSEL_101           5U      /* 101 : Clock option 5                                               */
#define PCM_LPUART2CLK_LPUART2CSSEL_110           6U      /* 110 : Clock option 6                                               */
#define PCM_LPUART2CLK_LPUART2CSSEL_111           7U      /* 111 : Clock option 7                                               */

