MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ============================================  PCM LPUART2CLK LPUART2EN [30..30]  ============================================= */
                                  /* PCM_LPUART2CLK_LPUART2EN                                              */
#define PCM_LPUART2CLK_LPUART2EN_0                0U      /* 0 : Clock disabled                                                 */
#define PCM_LPUART2CLK_LPUART2EN_1                1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* ==============================================  PCM LPUART2CLK PSTFLG [31..31]  ============================================== */
                                   /* PCM_LPUART2CLK_PSTFLG                                                 */
#define PCM_LPUART2CLK_PSTFLG_0                   0U      /* 0 : Peripheral is not present.                                     */
#define PCM_LPUART2CLK_PSTFLG_1                   1U      /* 1 : Peripheral is present.                                         */

/* =========================================================  COMP0CLK  ========================================================= */
/* ==============================================  PCM COMP0CLK COMP0EN [30..30]  =============================================== */
                                  /* PCM_COMP0CLK_COMP0EN                                                  */
#define PCM_COMP0CLK_COMP0EN_0                    0U      /* 0 : Clock disabled                                                 */
#define PCM_COMP0CLK_COMP0EN_1                    1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* ===============================================  PCM COMP0CLK PSTFLG [31..31]  =============================================== */
                                   /* PCM_COMP0CLK_PSTFLG                                                   */
#define PCM_COMP0CLK_PSTFLG_0                     0U      /* 0 : Peripheral is not present.                                     */
#define PCM_COMP0CLK_PSTFLG_1                     1U      /* 1 : Peripheral is present.                                         */

/* ===============================================  PCM CFGTMR4CLK PSTFLG [31..31]  =============================================== */
                                   /* PCM_CFGTMR4CLK_PSTFLG                                                   */
#define PCM_CFGTMR4CLK_PSTFLG_0                     0U      /* 0 : Peripheral is not present.                                     */
#define PCM_CFGTMR4CLK_PSTFLG_1                     1U      /* 1 : Peripheral is present.                                         */

/* ===============================================  PCM CFGTMR5CLK PSTFLG [31..31]  =============================================== */
                                   /* PCM_CFGTMR5CLK_PSTFLG                                                   */
#define PCM_CFGTMR5CLK_PSTFLG_0                     0U      /* 0 : Peripheral is not present.                                     */
#define PCM_CFGTMR5CLK_PSTFLG_1                     1U      /* 1 : Peripheral is present.                                         */


/* =========================================================================================================================== */
/* ================                                           LPI2C                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  VERID  ======================================================== */
/* =============================================  LPI2C VERID FEATURE [0..15]  ============================================= */
                                  /* LPI2C_VERSION_FEATURE                                              */
#define LPI2C_VERID_FEATURE_0000000000000010   2U    /* 0000000000000010 : Master only with standard feature set.          */
#define LPI2C_VERID_FEATURE_0000000000000011   3U    /* 0000000000000011 : Master and slave with standard feature set.     */

/* ==========================================================  PARA  ========================================================== */
/* =========================================================  MCTRL  ========================================================= */
/* ================================================  LPI2C MCTRL MMEN [0..0]  ================================================ */
                                  /* LPI2C_MCTRL_MMEN                                                   */
#define LPI2C_MCTRL_MMEN_0                     0U      /* 0 : Master logic is disabled.                                      */
#define LPI2C_MCTRL_MMEN_1                     1U      /* 1 : Master logic is enabled.                                       */

/* ================================================  LPI2C MCTRL MRST [1..1]  ================================================ */
                                  /* LPI2C_MCTRL_MRST                                                   */
#define LPI2C_MCTRL_MRST_0                     0U      /* 0 : Master logic is not reset.                                     */
#define LPI2C_MCTRL_MRST_1                     1U      /* 1 : Master logic is reset.                                         */

/* ================================================  LPI2C MCTRL DOZEDIS [2..2]  ================================================ */
                                  /* LPI2C_MCTRL_DOZEDIS                                                   */
#define LPI2C_MCTRL_DOZEDIS_0                     0U      /* 0 : Master is enabled in Doze mode.                                */
#define LPI2C_MCTRL_DOZEDIS_1                     1U      /* 1 : Master is disabled in Doze mode.                               */

/* ================================================  LPI2C MCTRL DBGEN [3..3]  ================================================ */
                                   /* LPI2C_MCTRL_DBGEN                                                   */
#define LPI2C_MCTRL_DBGEN_0                     0U      /* 0 : Master is disabled in debug mode.                              */
#define LPI2C_MCTRL_DBGEN_1                     1U      /* 1 : Master is enabled in debug mode.                               */

/* ===============================================  LPI2C MCTRL TXFRST [8..8]  =============================================== */
                                  /* LPI2C_MCTRL_TXFRST                                                 */
#define LPI2C_MCTRL_TXFRST_0                   0U      /* 0 : No effect.                                                     */
#define LPI2C_MCTRL_TXFRST_1                   1U      /* 1 : Transmit FIFO is reset.                                        */

/* ===============================================  LPI2C MCTRL RXFRST [9..9]  =============================================== */
                                  /* LPI2C_MCTRL_RXFRST                                                 */
#define LPI2C_MCTRL_RXFRST_0                   0U      /* 0 : No effect.                                                     */
#define LPI2C_MCTRL_RXFRST_1                   1U      /* 1 : Receive FIFO is reset.                                         */

/* =========================================================  MSTS  ========================================================== */
/* ================================================  LPI2C MSTS TXFLG [0..0]  ================================================ */
                                  /* LPI2C_MSTS_TXFLG                                                   */
#define LPI2C_MSTS_TXFLG_0                     0U      /* 0 : Transmit data not requested.                                   */
#define LPI2C_MSTS_TXFLG_1                     1U      /* 1 : Transmit data is requested.                                    */

