MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ========================================================  MRXDATA  ======================================================== */
/* ==============================================  LPI2C MRXDATA RXFE [14..14]  ============================================== */
                                   /* LPI2C_MRXDATA_RXFE                                                 */
#define LPI2C_MRXDATA_RXFE_0                   0U      /* 0 : Receive FIFO is not empty.                                     */
#define LPI2C_MRXDATA_RXFE_1                   1U      /* 1 : Receive FIFO is empty.                                         */

/* =========================================================  SCTRL  ========================================================= */
/* ================================================  LPI2C SCTRL SMEN [0..0]  ================================================ */
                                   /* LPI2C_SCTRL_SMEN                                                   */
#define LPI2C_SCTRL_SMEN_0                     0U      /* 0 : Slave mode is disabled.                                        */
#define LPI2C_SCTRL_SMEN_1                     1U      /* 1 : Slave mode is enabled.                                         */

/* ================================================  LPI2C SCTRL SRST [1..1]  ================================================ */
                                   /* LPI2C_SCTRL_SRST                                                   */
#define LPI2C_SCTRL_SRST_0                     0U      /* 0 : Slave logic is not reset.                                      */
#define LPI2C_SCTRL_SRST_1                     1U      /* 1 : Slave logic is reset.                                          */

/* ===============================================  LPI2C SCTRL SMFEN [4..4]  ================================================ */
                                  /* LPI2C_SCTRL_SMFEN                                                  */
#define LPI2C_SCTRL_SMFEN_0                    0U      /* 0 : Disable digital filter and output delay counter for slave
                                                     mode.                                                              */
#define LPI2C_SCTRL_SMFEN_1                    1U      /* 1 : Enable digital filter and output delay counter for slave
                                                     mode.                                                              */

/* ================================================  LPI2C SCTRL FDDM [5..5]  ================================================ */
                                  /* LPI2C_SCTRL_FDDM                                                   */
#define LPI2C_SCTRL_FDDM_0                     0U      /* 0 : Filter remains enabled in Doze mode.                           */
#define LPI2C_SCTRL_FDDM_1                     1U      /* 1 : Filter is disabled in Doze mode.                               */

/* ===============================================  LPI2C SCTRL TXFRST [8..8]  =============================================== */
                                 /* LPI2C_SCTRL_TXFRST                                                 */
#define LPI2C_SCTRL_TXFRST_0                   0U      /* 0 : No effect                                                      */
#define LPI2C_SCTRL_TXFRST_1                   1U      /* 1 : Transmit Data Register is now empty                            */

/* ===============================================  LPI2C SCTRL RXFRST [9..9]  =============================================== */
                                  /* LPI2C_SCTRL_RXFRST                                                 */
#define LPI2C_SCTRL_RXFRST_0                   0U      /* 0 : No effect                                                      */
#define LPI2C_SCTRL_RXFRST_1                   1U      /* 1 : Receive Data Register is now empty                             */

/* =========================================================  SSTS  ========================================================== */
/* ===============================================  LPI2C SSTS TXFLG [0..0]  ================================================ */
                                 /* LPI2C_SSTS_TXFLG                                                  */
#define LPI2C_SSTS_TXFLG_0                    0U      /* 0 : Transmit data not requested.                                   */
#define LPI2C_SSTS_TXFLG_1                    1U      /* 1 : Transmit data is requested.                                    */

/* ===============================================  LPI2C SSTS RXFLG [1..1]  ================================================ */
                                  /* LPI2C_SSTS_RXFLG                                                  */
#define LPI2C_SSTS_RXFLG_0                    0U      /* 0 : Receive Data is not ready.                                     */
#define LPI2C_SSTS_RXFLG_1                    1U      /* 1 : Receive data is ready.                                         */

/* ================================================  LPI2C SSTS AVFLG [2..2]  ================================================ */
                                 /* LPI2C_SSTS_AVFLG                                                   */
#define LPI2C_SSTS_AVFLG_0                     0U      /* 0 : Address Status Register is not valid.                          */
#define LPI2C_SSTS_AVFLG_1                     1U      /* 1 : Address Status Register is valid.                              */

/* ================================================  LPI2C SSTS TAFLG [3..3]  ================================================ */
                                  /* LPI2C_SSTS_TAFLG                                                   */
#define LPI2C_SSTS_TAFLG_0                     0U      /* 0 : Transmit ACK/NACK is not required.                             */
#define LPI2C_SSTS_TAFLG_1                     1U      /* 1 : Transmit ACK/NACK is required.                                 */

/* ================================================  LPI2C SSTS RSFLG [8..8]  ================================================ */
                                   /* LPI2C_SSTS_RSFLG                                                   */
#define LPI2C_SSTS_RSFLG_0                     0U      /* 0 : Slave has not detected a Repeated START condition.             */
#define LPI2C_SSTS_RSFLG_1                     1U      /* 1 : Slave has detected a Repeated START condition.                 */

