MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ===============================================  LPI2C SSTS STOPFLG [9..9]  =============================================== */
                                  /* LPI2C_SSTS_STOPFLG                                                 */
#define LPI2C_SSTS_STOPFLG_0                   0U      /* 0 : Slave has not detected a STOP condition.                       */
#define LPI2C_SSTS_STOPFLG_1                   1U      /* 1 : Slave has detected a STOP condition.                           */

/* ===============================================  LPI2C SSTS BEFLG [10..10]  =============================================== */
                                 /* LPI2C_SSTS_BEFLG                                                   */
#define LPI2C_SSTS_BEFLG_0                     0U      /* 0 : Slave has not detected a bit error.                            */
#define LPI2C_SSTS_BEFLG_1                     1U      /* 1 : Slave has detected a bit error.                                */

/* ===============================================  LPI2C SSTS FEFLG [11..11]  =============================================== */
                                  /* LPI2C_SSTS_FEFLG                                                   */
#define LPI2C_SSTS_FEFLG_0                     0U      /* 0 : FIFO underflow or overflow not detected.                       */
#define LPI2C_SSTS_FEFLG_1                     1U      /* 1 : FIFO underflow or overflow detected.                           */

/* ==============================================  LPI2C SSTS A0MFLG [12..12]  =============================================== */
                                  /* LPI2C_SSTS_A0MFLG                                                  */
#define LPI2C_SSTS_A0MFLG_0                    0U      /* 0 : Have not received ADDR0 matching address.                      */
#define LPI2C_SSTS_A0MFLG_1                    1U      /* 1 : Have received ADDR0 matching address.                          */

/* ==============================================  LPI2C SSTS A1MFLG [13..13]  =============================================== */
                                 /* LPI2C_SSTS_A1MFLG                                                  */
#define LPI2C_SSTS_A1MFLG_0                    0U      /* 0 : Have not received ADDR1 or ADDR0/ADDR1 range matching address. */
#define LPI2C_SSTS_A1MFLG_1                    1U      /* 1 : Have received ADDR1 or ADDR0/ADDR1 range matching address.     */

/* ==============================================  LPI2C SSTS GCAFLG [14..14]  =============================================== */
                                  /* LPI2C_SSTS_GCAFLG                                                  */
#define LPI2C_SSTS_GCAFLG_0                    0U      /* 0 : Slave has not detected the General Call Address or General
                                                     Call Address disabled.                                             */
#define LPI2C_SSTS_GCAFLG_1                    1U      /* 1 : Slave has detected the General Call Address.                   */

/* ==============================================  LPI2C SSTS SARFLG [15..15]  =============================================== */
                                  /* LPI2C_SSTS_SARFLG                                                  */
#define LPI2C_SSTS_SARFLG_0                    0U      /* 0 : SMBus Alert Response disabled or not detected.                 */
#define LPI2C_SSTS_SARFLG_1                    1U      /* 1 : SMBus Alert Response enabled and detected.                     */

/* ==============================================  LPI2C SSTS SBSYFLG [24..24]  ============================================== */
                                  /* LPI2C_SSTS_SBSYFLG                                                 */
#define LPI2C_SSTS_SBSYFLG_0                   0U      /* 0 : I2C Slave is idle.                                             */
#define LPI2C_SSTS_SBSYFLG_1                   1U      /* 1 : I2C Slave is busy.                                             */

/* ==============================================  LPI2C SSTS BBSYFLG [25..25]  ============================================== */
                                  /* LPI2C_SSTS_BBSYFLG                                                 */
#define LPI2C_SSTS_BBSYFLG_0                   0U      /* 0 : I2C Bus is idle.                                               */
#define LPI2C_SSTS_BBSYFLG_1                   1U      /* 1 : I2C Bus is busy.                                               */

/* ========================================================  SINTEN  ========================================================= */
/* ==============================================  LPI2C SINTEN TXIEN [0..0]  =============================================== */
                                  /* LPI2C_SINTEN_TXIEN                                                */
#define LPI2C_SINTEN_TXIEN_0                  0U      /* 0 : Interrupt disabled.                                            */
#define LPI2C_SINTEN_TXIEN_1                  1U      /* 1 : Interrupt enabled                                              */

/* ==============================================  LPI2C SINTEN RXIEN [1..1]  =============================================== */
                                 /* LPI2C_SINTEN_RXIEN                                                */
#define LPI2C_SINTEN_RXIEN_0                  0U      /* 0 : Interrupt disabled.                                            */
#define LPI2C_SINTEN_RXIEN_1                  1U      /* 1 : Interrupt enabled.                                             */

/* ===============================================  LPI2C SINTEN AVIEN [2..2]  =============================================== */
                                  /* LPI2C_SINTEN_AVIEN                                                 */
#define LPI2C_SINTEN_AVIEN_0                   0U      /* 0 : Interrupt disabled.                                            */
#define LPI2C_SINTEN_AVIEN_1                   1U      /* 1 : Interrupt enabled.                                             */

/* ===============================================  LPI2C SINTEN TAIEN [3..3]  =============================================== */
                                  /* LPI2C_SINTEN_TAIEN                                                 */
#define LPI2C_SINTEN_TAIEN_0                   0U      /* 0 : Interrupt disabled.                                            */
#define LPI2C_SINTEN_TAIEN_1                   1U      /* 1 : Interrupt enabled.                                             */

/* ===============================================  LPI2C SINTEN RSIEN [8..8]  =============================================== */
                                 /* LPI2C_SINTEN_RSIEN                                                 */
#define LPI2C_SINTEN_RSIEN_0                   0U      /* 0 : Interrupt disabled.                                            */
#define LPI2C_SINTEN_RSIEN_1                   1U      /* 1 : Interrupt enabled.                                             */

/* ==============================================  LPI2C SINTEN STOPIEN [9..9]  ============================================== */
                                  /* LPI2C_SINTEN_STOPIEN                                               */
#define LPI2C_SINTEN_STOPIEN_0                 0U      /* 0 : Interrupt disabled.                                            */
#define LPI2C_SINTEN_STOPIEN_1                 1U      /* 1 : Interrupt enabled.                                             */

