MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ==============================================  LPI2C SINTEN BEIEN [10..10]  ============================================== */
                                  /* LPI2C_SINTEN_BEIEN                                                 */
#define LPI2C_SINTEN_BEIEN_0                   0U      /* 0 : Interrupt disabled.                                            */
#define LPI2C_SINTEN_BEIEN_1                   1U      /* 1 : Interrupt enabled.                                             */

/* ==============================================  LPI2C SINTEN FEIEN [11..11]  ============================================== */
                                 /* LPI2C_SINTEN_FEIEN                                                 */
#define LPI2C_SINTEN_FEIEN_0                   0U      /* 0 : Interrupt disabled.                                            */
#define LPI2C_SINTEN_FEIEN_1                   1U      /* 1 : Interrupt enabled.                                             */

/* =============================================  LPI2C SINTEN A0MIEN [12..12]  ============================================== */
                                  /* LPI2C_SINTEN_A0MIEN                                                */
#define LPI2C_SINTEN_A0MIEN_0                  0U      /* 0 : Interrupt enabled.                                             */
#define LPI2C_SINTEN_A0MIEN_1                  1U      /* 1 : Interrupt disabled.                                            */

/* =============================================  LPI2C SINTEN A1MIEN [13..13]  ============================================== */
                                  /* LPI2C_SINTEN_A1MIEN                                                */
#define LPI2C_SINTEN_A1MIEN_0                  0U      /* 0 : Interrupt disabled.                                            */
#define LPI2C_SINTEN_A1MIEN_1                  1U      /* 1 : Interrupt enabled.                                             */

/* =============================================  LPI2C SINTEN GCAIEN [14..14]  ============================================== */
                                   /* LPI2C_SINTEN_GCAIEN                                                */
#define LPI2C_SINTEN_GCAIEN_0                  0U      /* 0 : Interrupt disabled.                                            */
#define LPI2C_SINTEN_GCAIEN_1                  1U      /* 1 : Interrupt enabled.                                             */

/* =============================================  LPI2C SINTEN SARIEN [15..15]  ============================================== */
                                 /* LPI2C_SINTEN_SARIEN                                                */
#define LPI2C_SINTEN_SARIEN_0                  0U      /* 0 : Interrupt disabled.                                            */
#define LPI2C_SINTEN_SARIEN_1                  1U      /* 1 : Interrupt enabled.                                             */

/* ========================================================  SDMAEN  ========================================================= */
/* ==============================================  LPI2C SDMAEN TXDMAEN [0..0]  ============================================== */
                                  /* LPI2C_SDMAEN_TXDMAEN                                               */
#define LPI2C_SDMAEN_TXDMAEN_0                 0U      /* 0 : DMA request disabled.                                          */
#define LPI2C_SDMAEN_TXDMAEN_1                 1U      /* 1 : DMA request enabled                                            */

/* ==============================================  LPI2C SDMAEN RXDMAEN [1..1]  ============================================== */
                                 /* LPI2C_SDMAEN_RXDMAEN                                               */
#define LPI2C_SDMAEN_RXDMAEN_0                 0U      /* 0 : DMA request disabled.                                          */
#define LPI2C_SDMAEN_RXDMAEN_1                 1U      /* 1 : DMA request enabled.                                           */

/* ==============================================  LPI2C SDMAEN AVDMAEN [2..2]  ============================================== */
                                   /* LPI2C_SDMAEN_AVDMAEN                                               */
#define LPI2C_SDMAEN_AVDMAEN_0                 0U      /* 0 : DMA request disabled.                                          */
#define LPI2C_SDMAEN_AVDMAEN_1                 1U      /* 1 : DMA request enabled.                                           */


/* =========================================================  SCFG1  ========================================================= */
/* ==============================================  LPI2C SCFG1 ADDRSEN [0..0]  =============================================== */
                                  /* LPI2C_SCFG1_ADDRSEN                                                */
#define LPI2C_SCFG1_ADDRSEN_0                  0U      /* 0 : Clock stretching disabled.                                     */
#define LPI2C_SCFG1_ADDRSEN_1                  1U      /* 1 : Clock stretching enabled.                                      */

/* ===============================================  LPI2C SCFG1 RXDSEN [1..1]  =============================================== */
                                   /* LPI2C_SCFG1_RXDSEN                                                 */
#define LPI2C_SCFG1_RXDSEN_0                   0U      /* 0 : Clock stretching disabled.                                     */
#define LPI2C_SCFG1_RXDSEN_1                   1U      /* 1 : Clock stretching enabled.                                      */


/* ===============================================  LPI2C SCFG1 TXDSEN [2..2]  =============================================== */
                                  /* LPI2C_SCFG1_TXDSEN                                                 */
#define LPI2C_SCFG1_TXDSEN_0                   0U      /* 0 : Clock stretching disabled.                                     */
#define LPI2C_SCFG1_TXDSEN_1                   1U      /* 1 : Clock stretching enabled.                                      */

/* ===============================================  LPI2C SCFG1 ACKSEN [3..3]  =============================================== */
                                  /* LPI2C_SCFG1_ACKSEN                                                 */
#define LPI2C_SCFG1_ACKSEN_0                   0U      /* 0 : Clock stretching disabled.                                     */
#define LPI2C_SCFG1_ACKSEN_1                   1U      /* 1 : Clock stretching enabled.                                      */

/* ===============================================  LPI2C SCFG1 GCAEN [8..8]  ================================================ */
                                  /* LPI2C_SCFG1_GCAEN                                                  */
#define LPI2C_SCFG1_GCAEN_0                    0U      /* 0 : General Call address is disabled.                              */
#define LPI2C_SCFG1_GCAEN_1                    1U      /* 1 : General call address is enabled.                               */

/* ===============================================  LPI2C SCFG1 SAMEN [9..9]  ================================================ */
                                  /* LPI2C_SCFG1_SAMEN                                                  */
#define LPI2C_SCFG1_SAMEN_0                    0U      /* 0 : Disables match on SMBus Alert.                                 */
#define LPI2C_SCFG1_SAMEN_1                    1U      /* 1 : Enables match on SMBus Alert.                                  */

/* =============================================  LPI2C SCFG1 TXFCFG [10..10]  ============================================== */
                                   /* LPI2C_SCFG1_TXFCFG                                                */
#define LPI2C_SCFG1_TXFCFG_0                  0U      /* 0 : Transmit Data Flag will only assert during a slave-transmit
                                                     transfer when the transmit data register is empty.                 */
#define LPI2C_SCFG1_TXFCFG_1                  1U      /* 1 : Transmit Data Flag will assert whenever the transmit data
                                                     register is empty.                                                 */

/* =============================================  LPI2C SCFG1 RXFCFG [11..11]  ============================================== */
                                   /* LPI2C_SCFG1_RXFCFG                                                */
#define LPI2C_SCFG1_RXFCFG_0                  0U      /* 0 : Reading the receive data register will return receive data
                                                     and clear the receive data flag.                                   */
#define LPI2C_SCFG1_RXFCFG_1                  1U      /* 1 : Reading the Receive Data register when the Address Valid
                                                     flag (SSR[AVF])is set  will return the Address Status register
                                                     and clear the Address Valid flag. Reading the Receive Data
                                                     register when the Address Valid flag is clear  will return
                                                     received data and clear the Receive Data flag (MSR[RDF]).          */

/* ==============================================  LPI2C SCFG1 INACK [12..12]  =============================================== */
                                  /* LPI2C_SCFG1_INACK                                                  */
#define LPI2C_SCFG1_INACK_0                    0U      /* 0 : Slave will end transfer when NACK detected.                    */
#define LPI2C_SCFG1_INACK_1                    1U      /* 1 : Slave will not end transfer when NACK detected.                */

/* ==============================================  LPI2C SCFG1 HSMDEN [13..13]  ============================================== */
                                  /* LPI2C_SCFG1_HSMDEN                                                 */
#define LPI2C_SCFG1_HSMDEN_0                   0U      /* 0 : Disables detection of Hs-mode master code.                     */
#define LPI2C_SCFG1_HSMDEN_1                   1U      /* 1 : Enables detection of Hs-mode master code.                      */

/* ==============================================  LPI2C SCFG1 ADDRMCFG [16..18]  =============================================== */
                                   /* LPI2C_SCFG1_ADDRMCFG                                                  */
#define LPI2C_SCFG1_ADDRMCFG_000                  0U      /* 000 : Address match 0 (7-bit).                                     */
#define LPI2C_SCFG1_ADDRMCFG_001                  1U      /* 001 : Address match 0 (10-bit).                                    */
#define LPI2C_SCFG1_ADDRMCFG_010                  2U      /* 010 : Address match 0 (7-bit) or Address match 1 (7-bit).          */
#define LPI2C_SCFG1_ADDRMCFG_011                  3U      /* 011 : Address match 0 (10-bit) or Address match 1 (10-bit).        */
#define LPI2C_SCFG1_ADDRMCFG_100                  4U      /* 100 : Address match 0 (7-bit) or Address match 1 (10-bit).         */
#define LPI2C_SCFG1_ADDRMCFG_101                  5U      /* 101 : Address match 0 (10-bit) or Address match 1 (7-bit).         */
#define LPI2C_SCFG1_ADDRMCFG_110                  6U      /* 110 : From Address match 0 (7-bit) to Address match 1 (7-bit).     */
#define LPI2C_SCFG1_ADDRMCFG_111                  7U      /* 111 : From Address match 0 (10-bit) to Address match 1 (10-bit).   */


/* =========================================================  SCFG2  ========================================================= */
/* ========================================================  SADDRM  ========================================================= */
/* =======================================================  SADDRSTS  ======================================================== */
/* ===========================================  LPI2C SADDRSTS RXADDRNV [14..14]  ============================================ */
                                  /* LPI2C_SADDRSTS_RXADDRNV                                            */
#define LPI2C_SADDRSTS_RXADDRNV_0              0U      /* 0 : RADDR is valid.                                                */
#define LPI2C_SADDRSTS_RXADDRNV_1              1U      /* 1 : RADDR is not valid.                                            */

