MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ========================================================  STXACK  ========================================================= */
/* ==============================================  LPI2C STXACK TXNACK [0..0]  =============================================== */
                                  /* LPI2C_STXACK_TXNACK                                                */
#define LPI2C_STXACK_TXNACK_0                  0U      /* 0 : Transmit ACK for received word.                                */
#define LPI2C_STXACK_TXNACK_1                  1U      /* 1 : Transmit NACK for received word.                               */

/* ========================================================  STXDATA  ======================================================== */
/* ========================================================  SRXDATA  ======================================================== */
/* ==============================================  LPI2C SRXDATA RXDE [14..14]  ============================================== */
                                  /* LPI2C_SRXDATA_RXDE                                                 */
#define LPI2C_SRXDATA_RXDE_0                   0U      /* 0 : The Receive Data Register is not empty.                        */
#define LPI2C_SRXDATA_RXDE_1                   1U      /* 1 : The Receive Data Register is empty.                            */

/* ==============================================  LPI2C SRXDATA FDW [15..15]  =============================================== */
                                  /* LPI2C_SRXDATA_FDW                                                  */
#define LPI2C_SRXDATA_FDW_0                    0U      /* 0 : Indicates this is not the first data word since a (repeated)
                                                     START or STOP condition.                                           */
#define LPI2C_SRXDATA_FDW_1                    1U      /* 1 : Indicates this is the first data word since a (repeated)
                                                     START or STOP condition.                                           */



/* =========================================================================================================================== */
/* ================                                          LPUART                                          ================ */
/* =========================================================================================================================== */

/* =========================================================  VERID  ========================================================= */
/* =============================================  LPUART VERID FEATURE [0..15]  ============================================= */
                                 /* LPUART_VERID_FEATURE                                              */
#define LPUART_VERID_FEATURE_0000000000000001   1U    /* 0000000000000001 : Standard feature set.                           */
#define LPUART_VERID_FEATURE_0000000000000011   3U    /* 0000000000000011 : Standard feature set with MODEM/IrDA support.   */

/* =========================================================  PARA  ========================================================= */
/* ==========================================================  SWRST  ========================================================== */
/* ==============================================  LPUART SWRST SWRSTEN [1..1]  =============================================== */
                                 /* LPUART_SWRST_SWRSTEN                                                */
#define LPUART_SWRST_SWRSTEN_0                  0U      /* 0 : Module is not reset.                                           */
#define LPUART_SWRST_SWRSTEN_1                  1U      /* 1 : Module is reset.                                               */


/* =========================================================  PCFG  ========================================================== */
/* ==============================================  LPUART PCFG ITRGCFG [0..1]  ============================================== */
                                  /* LPUART_PCFG_ITRGCFG                                               */
#define LPUART_PCFG_ITRGCFG_00                0U      /* 00 : Input trigger is disabled.                                    */
#define LPUART_PCFG_ITRGCFG_01                1U      /* 01 : Input trigger is used instead of RXD pin input.               */
#define LPUART_PCFG_ITRGCFG_10                2U      /* 10 : Input trigger is used instead of CTS_B pin input.             */
#define LPUART_PCFG_ITRGCFG_11                3U      /* 11 : Input trigger is used to modulate the TXD pin output. The
                                                     TXD pin output (after TXINV configuration) is ANDed with
                                                     the input trigger.                                                 */


/* ==========================================================  BR  =========================================================== */
/* =============================================  LPUART BR STOPBSEL [13..13]  ============================================== */
                                  /* LPUART_BR_STOPBSEL                                                */
#define LPUART_BR_STOPBSEL_0                  0U      /* 0 : One stop bit.                                                  */
#define LPUART_BR_STOPBSEL_1                  1U      /* 1 : Two stop bits.                                                 */


/* =============================================  LPUART BR RXIAEIEN [14..14]  ============================================== */
                                  /* LPUART_BR_RXIAEIEN                                                */
#define LPUART_BR_RXIAEIEN_0                  0U      /* 0 : Hardware interrupts from LPUART_STAT[RXEDGIF] disabled.        */
#define LPUART_BR_RXIAEIEN_1                  1U      /* 1 : Hardware interrupt requested when LPUART_STAT[RXEDGIF] flag
                                                     is 1.                                                              */


/* ==============================================  LPUART BR LBDFIEN [15..15]  ============================================== */
                                  /* LPUART_BR_LBDFIEN                                                 */
#define LPUART_BR_LBDFIEN_0                   0U      /* 0 : Hardware interrupts from LPUART_STAT[LBKDIF] disabled (use
                                                     polling).                                                          */
#define LPUART_BR_LBDFIEN_1                   1U      /* 1 : Hardware interrupt requested when LPUART_STAT[LBKDIF] flag
                                                     is 1.                                                              */


/* =============================================  LPUART BR RXDWRDIS [16..16]  ============================================== */
                                  /* LPUART_BR_RXDWRDIS                                                */
#define LPUART_BR_RXDWRDIS_0                  0U      /* 0 : Resynchronization during received data word is supported       */
#define LPUART_BR_RXDWRDIS_1                  1U      /* 1 : Resynchronization during received data word is disabled        */


/* =============================================  LPUART BR BEDSMPSEL [17..17]  ============================================= */
                                  /* LPUART_BR_BEDSMPSEL                                               */
#define LPUART_BR_BEDSMPSEL_0                 0U      /* 0 : Receiver samples input data using the rising edge of the
                                                     baud rate clock.                                                   */
#define LPUART_BR_BEDSMPSEL_1                 1U      /* 1 : Receiver samples input data using the rising and falling
                                                     edge of the baud rate clock.                                       */


/* =============================================  LPUART BR MADDRMCFG [18..19]  ============================================= */
                                  /* LPUART_BR_MADDRMCFG                                               */
#define LPUART_BR_MADDRMCFG_00                0U      /* 00 : Address Match Wakeup                                          */
#define LPUART_BR_MADDRMCFG_01                1U      /* 01 : Idle Match Wakeup                                             */
#define LPUART_BR_MADDRMCFG_10                2U      /* 10 : Match On and Match Off                                        */

/* =============================================  LPUART BR RXIDMAREN [20..20]  ============================================= */
                                   /* LPUART_BR_RXIDMAREN                                               */
#define LPUART_BR_RXIDMAREN_0                 0U      /* 0 : DMA request disabled.                                          */
#define LPUART_BR_RXIDMAREN_1                 1U      /* 1 : DMA request enabled.                                           */

/* =============================================  LPUART BR RXFDMAREN [21..21]  ============================================= */
                                  /* LPUART_BR_RXFDMAREN                                               */
#define LPUART_BR_RXFDMAREN_0                 0U      /* 0 : DMA request disabled.                                          */
#define LPUART_BR_RXFDMAREN_1                 1U      /* 1 : DMA request enabled.                                           */


/* =============================================  LPUART BR TXDMAREN [23..23]  ============================================== */
                                  /* LPUART_BR_TXDMAREN                                                */
#define LPUART_BR_TXDMAREN_0                  0U      /* 0 : DMA request disabled.                                          */
#define LPUART_BR_TXDMAREN_1                  1U      /* 1 : DMA request enabled.                                           */


/* ==============================================  LPUART BR OSRCFG [24..28]  =============================================== */
                                  /* LPUART_BR_OSRCFG                                                  */
#define LPUART_BR_OSRCFG_00000                0U      /* 00000 : Writing 0 to this field will result in an oversampling
                                                     ratio of 16                                                        */
#define LPUART_BR_OSRCFG_00011                3U      /* 00011 : Oversampling ratio of 4  requires BOTHEDGE to be set.      */
#define LPUART_BR_OSRCFG_00100                4U      /* 00100 : Oversampling ratio of 5  requires BOTHEDGE to be set.      */
#define LPUART_BR_OSRCFG_00101                5U      /* 00101 : Oversampling ratio of 6  requires BOTHEDGE to be set.      */
#define LPUART_BR_OSRCFG_00110                6U      /* 00110 : Oversampling ratio of 7  requires BOTHEDGE to be set.      */
#define LPUART_BR_OSRCFG_00111                7U      /* 00111 : Oversampling ratio of 8.                                   */
#define LPUART_BR_OSRCFG_01000                8U      /* 01000 : Oversampling ratio of 9.                                   */
#define LPUART_BR_OSRCFG_01001                9U      /* 01001 : Oversampling ratio of 10.                                  */
#define LPUART_BR_OSRCFG_01010                10U     /* 01010 : Oversampling ratio of 11.                                  */
#define LPUART_BR_OSRCFG_01011                11U     /* 01011 : Oversampling ratio of 12.                                  */
#define LPUART_BR_OSRCFG_01100                12U     /* 01100 : Oversampling ratio of 13.                                  */
#define LPUART_BR_OSRCFG_01101                13U     /* 01101 : Oversampling ratio of 14.                                  */
#define LPUART_BR_OSRCFG_01110                14U     /* 01110 : Oversampling ratio of 15.                                  */
#define LPUART_BR_OSRCFG_01111                15U     /* 01111 : Oversampling ratio of 16.                                  */
#define LPUART_BR_OSRCFG_10000                16U     /* 10000 : Oversampling ratio of 17.                                  */
#define LPUART_BR_OSRCFG_10001                17U     /* 10001 : Oversampling ratio of 18.                                  */
#define LPUART_BR_OSRCFG_10010                18U     /* 10010 : Oversampling ratio of 19.                                  */
#define LPUART_BR_OSRCFG_10011                19U     /* 10011 : Oversampling ratio of 20.                                  */
#define LPUART_BR_OSRCFG_10100                20U     /* 10100 : Oversampling ratio of 21.                                  */
#define LPUART_BR_OSRCFG_10101                21U     /* 10101 : Oversampling ratio of 22.                                  */
#define LPUART_BR_OSRCFG_10110                22U     /* 10110 : Oversampling ratio of 23.                                  */
#define LPUART_BR_OSRCFG_10111                23U     /* 10111 : Oversampling ratio of 24.                                  */
#define LPUART_BR_OSRCFG_11000                24U     /* 11000 : Oversampling ratio of 25.                                  */
#define LPUART_BR_OSRCFG_11001                25U     /* 11001 : Oversampling ratio of 26.                                  */
#define LPUART_BR_OSRCFG_11010                26U     /* 11010 : Oversampling ratio of 27.                                  */
#define LPUART_BR_OSRCFG_11011                27U     /* 11011 : Oversampling ratio of 28.                                  */
#define LPUART_BR_OSRCFG_11100                28U     /* 11100 : Oversampling ratio of 29.                                  */
#define LPUART_BR_OSRCFG_11101                29U     /* 11101 : Oversampling ratio of 30.                                  */
#define LPUART_BR_OSRCFG_11110                30U     /* 11110 : Oversampling ratio of 31.                                  */
#define LPUART_BR_OSRCFG_11111                31U     /* 11111 : Oversampling ratio of 32.                                  */


/* ==============================================  LPUART BR SELM10 [29..29]  =============================================== */
                                   /* LPUART_BR_SELM10                                                  */
#define LPUART_BR_SELM10_0                    0U      /* 0 : Receiver and transmitter use 7-bit to 9-bit data characters.   */
#define LPUART_BR_SELM10_1                    1U      /* 1 : Receiver and transmitter use 10-bit data characters.           */

