MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ==============================================  LPUART STS LBDEN [25..25]  =============================================== */
                                  /* LPUART_STS_LBDEN                                                  */
#define LPUART_STS_LBDEN_0                    0U      /* 0 : LIN break detect is disabled  normal break character can
                                                     be detected.                                                       */
#define LPUART_STS_LBDEN_1                    1U      /* 1 : LIN break detect is enabled. LIN break character is detected
                                                     at length of 11 bit times (if M = 0) or 12 (if M = 1) or
                                                     13 (M10 = 1).                                                      */


/* =============================================  LPUART STS BCTXLEN [26..26]  ============================================== */
                                  /* LPUART_STS_BCTXLEN                                                */
#define LPUART_STS_BCTXLEN_0                  0U      /* 0 : Break character is transmitted with length of 9 to 13 bit
                                                     times.                                                             */
#define LPUART_STS_BCTXLEN_1                  1U      /* 1 : Break character is transmitted with length of 12 to 15 bit
                                                     times.                                                             */


/* =============================================  LPUART STS RXWUPID [27..27]  ============================================== */
                                 /* LPUART_STS_RXWUPID                                                */
#define LPUART_STS_RXWUPID_0                  0U      /* 0 : During receive standby state (RWU = 1)  the IDLE bit does
                                                     not get set upon detection of an idle character. During
                                                     address match wakeup  the IDLE bit does not set when an
                                                     address does not match.                                            */
#define LPUART_STS_RXWUPID_1                  1U      /* 1 : During receive standby state (RWU = 1)  the IDLE bit gets
                                                     set upon detection of an idle character. During address
                                                     match wakeup  the IDLE bit does set when an address does
                                                     not match.                                                         */


/* =============================================  LPUART STS RXDIPINV [28..28]  ============================================= */
                                  /* LPUART_STS_RXDIPINV                                               */
#define LPUART_STS_RXDIPINV_0                 0U      /* 0 : Receive data not inverted.                                     */
#define LPUART_STS_RXDIPINV_1                 1U      /* 1 : Receive data inverted.                                         */


/* =============================================  LPUART STS MSBFSET [29..29]  ============================================== */
                                 /* LPUART_STS_MSBFSET                                                */
#define LPUART_STS_MSBFSET_0                  0U      /* 0 : LSB (bit0) is the first bit that is transmitted following
                                                     the start bit. Further  the first bit received after the
                                                     start bit is identified as bit0.                                   */
#define LPUART_STS_MSBFSET_1                  1U      /* 1 : MSB (bit9  bit8  bit7 or bit6) is the first bit that is
                                                     transmitted following the start bit depending on the setting
                                                     of CTRL[M]  CTRL[PE] and BAUD[M10]. Further  the first
                                                     bit received after the start bit is identified as bit9
                                                     bit8  bit7 or bit6 depending on the setting of CTRL[M]
                                                     and CTRL[PE].                                                      */


/* =============================================  LPUART STS AERXPFLG [30..30]  ============================================= */
                                 /* LPUART_STS_AERXPFLG                                               */
#define LPUART_STS_AERXPFLG_0                 0U      /* 0 : No active edge on the receive pin has occurred.                */
#define LPUART_STS_AERXPFLG_1                 1U      /* 1 : An active edge on the receive pin has occurred.                */


/* ==============================================  LPUART STS LBDFLG [31..31]  ============================================== */
                                 /* LPUART_STS_LBDFLG                                                 */
#define LPUART_STS_LBDFLG_0                   0U      /* 0 : No LIN break character has been detected.                      */
#define LPUART_STS_LBDFLG_1                   1U      /* 1 : LIN break character has been detected.                         */


/* =========================================================  CTRL  ========================================================== */
/* ===============================================  LPUART CTRL PTCFG [0..0]  =============================================== */
                                   /* LPUART_CTRL_PTCFG                                                 */
#define LPUART_CTRL_PTCFG_0                   0U      /* 0 : Even parity.                                                   */
#define LPUART_CTRL_PTCFG_1                   1U      /* 1 : Odd parity.                                                    */


/* ===============================================  LPUART CTRL PENCFG [1..1]  =============================================== */
                                 /* LPUART_CTRL_PECFG                                                 */
#define LPUART_CTRL_PENCFG_0                   0U      /* 0 : No hardware parity generation or checking.                     */
#define LPUART_CTRL_PENCFG_1                   1U      /* 1 : Parity enabled.                                                */


