MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ==============================================  LPUART CTRL RXIEN [21..21]  ============================================== */
                                  /* LPUART_CTRL_RXIEN                                                 */
#define LPUART_CTRL_RXIEN_0                   0U      /* 0 : Hardware interrupts from RDRF disabled; use polling.           */
#define LPUART_CTRL_RXIEN_1                   1U      /* 1 : Hardware interrupt requested when RDRF flag is 1.              */


/* =============================================  LPUART CTRL TXCIEN [22..22]  ============================================== */
                                  /* LPUART_CTRL_TXCIEN                                                */
#define LPUART_CTRL_TXCIEN_0                  0U      /* 0 : Hardware interrupts from TC disabled; use polling.             */
#define LPUART_CTRL_TXCIEN_1                  1U      /* 1 : Hardware interrupt requested when TC flag is 1.                */

/* ==============================================  LPUART CTRL TXIEN [23..23]  ============================================== */
                                  /* LPUART_CTRL_TXIEN                                                 */
#define LPUART_CTRL_TXIEN_0                   0U      /* 0 : Hardware interrupts from TDRE disabled; use polling.           */
#define LPUART_CTRL_TXIEN_1                   1U      /* 1 : Hardware interrupt requested when TDRE flag is 1.              */


/* ==============================================  LPUART CTRL PEIEN [24..24]  ============================================== */
                                 /* LPUART_CTRL_PEIEN                                                 */
#define LPUART_CTRL_PEIEN_0                   0U      /* 0 : PF interrupts disabled; use polling).                          */
#define LPUART_CTRL_PEIEN_1                   1U      /* 1 : Hardware interrupt requested when PF is set.                   */


/* ==============================================  LPUART CTRL FEIEN [25..25]  ============================================== */
                                   /* LPUART_CTRL_FEIEN                                                 */
#define LPUART_CTRL_FEIEN_0                   0U      /* 0 : FE interrupts disabled; use polling.                           */
#define LPUART_CTRL_FEIEN_1                   1U      /* 1 : Hardware interrupt requested when FE is set.                   */


/* ==============================================  LPUART CTRL NEIEN [26..26]  ============================================== */
                                 /* LPUART_CTRL_NEIEN                                                 */
#define LPUART_CTRL_NEIEN_0                   0U      /* 0 : NF interrupts disabled; use polling.                           */
#define LPUART_CTRL_NEIEN_1                   1U      /* 1 : Hardware interrupt requested when NF is set.                   */


/* =============================================  LPUART CTRL OVRIEN [27..27]  ============================================== */
                                  /* LPUART_CTRL_OVRIEN                                                */
#define LPUART_CTRL_OVRIEN_0                  0U      /* 0 : OR interrupts disabled; use polling.                           */
#define LPUART_CTRL_OVRIEN_1                  1U      /* 1 : Hardware interrupt requested when OR is set.                   */


/* ============================================  LPUART CTRL TXDOPINV [28..28]  ============================================= */
                                  /* LPUART_CTRL_TXDOPINV                                              */
#define LPUART_CTRL_TXDOPINV_0                0U      /* 0 : Transmit data not inverted.                                    */
#define LPUART_CTRL_TXDOPINV_1                1U      /* 1 : Transmit data inverted.                                        */


/* ===========================================  LPUART CTRL TXDPDIRSEL [29..29]  ============================================ */
                                  /* LPUART_CTRL_TXDPDIRSEL                                            */
#define LPUART_CTRL_TXDPDIRSEL_0              0U      /* 0 : TXD pin is an input in single-wire mode.                       */
#define LPUART_CTRL_TXDPDIRSEL_1              1U      /* 1 : TXD pin is an output in single-wire mode.                      */


/* =========================================================  DATA  ========================================================== */
/* =============================================  LPUART DATA RXIDLE [11..11]  ============================================== */
                                  /* LPUART_DATA_RXIDLE                                                */
#define LPUART_DATA_RXIDLE_0                  0U      /* 0 : Receiver was not idle before receiving this character.         */
#define LPUART_DATA_RXIDLE_1                  1U      /* 1 : Receiver was idle before receiving this character.             */


/* ==============================================  LPUART DATA RXBE [12..12]  =============================================== */
                                  /* LPUART_DATA_RXBE                                                  */
#define LPUART_DATA_RXBE_0                    0U      /* 0 : Receive buffer contains valid data.                            */
#define LPUART_DATA_RXBE_1                    1U      /* 1 : Receive buffer is empty  data returned on read is not valid.   */


/* =============================================  LPUART DATA FETXSC [13..13]  ============================================== */
                                  /* LPUART_DATA_FETXSC                                                */
#define LPUART_DATA_FETXSC_0                  0U      /* 0 : The dataword was received without a frame error on read
                                                     or transmit a normal character on write.                           */
#define LPUART_DATA_FETXSC_1                  1U      /* 1 : The dataword was received with a frame error  or transmit
                                                     an idle or break character on transmit.                            */


/* ===============================================  LPUART DATA PE [14..14]  ================================================ */
                                  /* LPUART_DATA_PE                                                    */
#define LPUART_DATA_PE_0                      0U      /* 0 : The dataword was received without a parity error.              */
#define LPUART_DATA_PE_1                      1U      /* 1 : The dataword was received with a parity error.                 */


