MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ===============================================  LPUART DATA NE [15..15]  ================================================ */
                                  /* LPUART_DATA_NE                                                    */
#define LPUART_DATA_NE_0                      0U      /* 0 : The dataword was received without noise.                       */
#define LPUART_DATA_NE_1                      1U      /* 1 : The data was received with noise.                              */


/* =========================================================  MADDR  ========================================================= */
/* ==========================================================  MIR  ========================================================== */
/* ===============================================  LPUART MIR TXCSEN [0..0]  =============================================== */
                                  /* LPUART_MIR_TXCSEN                                                 */
#define LPUART_MIR_TXCSEN_0                   0U      /* 0 : CTS has no effect on the transmitter.                          */
#define LPUART_MIR_TXCSEN_1                   1U      /* 1 : Enables clear-to-send operation. The transmitter checks
                                                     the state of CTS each time it is ready to send a character.
                                                     If CTS is asserted  the character is sent. If CTS is deasserted
                                                     the signal TXD remains in the mark state and transmission
                                                     is delayed until CTS is asserted. Changes in CTS as a character
                                                     is being sent do not affect its transmission.                      */


/* ===============================================  LPUART MIR TXRSEN [1..1]  =============================================== */
                                  /* LPUART_MIR_TXRSEN                                                 */
#define LPUART_MIR_TXRSEN_0                   0U      /* 0 : The transmitter has no effect on RTS.                          */
#define LPUART_MIR_TXRSEN_1                   1U      /* 1 : When a character is placed into an empty transmitter data
                                                     buffer   RTS asserts one bit time before the start bit
                                                     is transmitted. RTS deasserts one bit time after all characters
                                                     in the transmitter data buffer and shift register are completely
                                                     sent  including the last stop bit.                                 */


/* ==============================================  LPUART MIR TXRSPCFG [2..2]  ============================================== */
                                  /* LPUART_MIR_TXRSPCFG                                               */
#define LPUART_MIR_TXRSPCFG_0                 0U      /* 0 : Transmitter RTS is active low.                                 */
#define LPUART_MIR_TXRSPCFG_1                 1U      /* 1 : Transmitter RTS is active high.                                */


/* ===============================================  LPUART MIR RXRSEN [3..3]  =============================================== */
                                  /* LPUART_MIR_RXRSEN                                                 */
#define LPUART_MIR_RXRSEN_0                   0U      /* 0 : The receiver has no effect on RTS.                             */


/* ==============================================  LPUART MIR TXCSCFG [4..4]  =============================================== */
                                   /* LPUART_MIR_TXCSCFG                                                */
#define LPUART_MIR_TXCSCFG_0                  0U      /* 0 : CTS input is sampled at the start of each character.           */
#define LPUART_MIR_TXCSCFG_1                  1U      /* 1 : CTS input is sampled when the transmitter is idle.             */


/* =============================================  LPUART MIR TXCSRCSEL [5..5]  ============================================== */
                                  /* LPUART_MIR_TXCSRCSEL                                              */
#define LPUART_MIR_TXCSRCSEL_0                0U      /* 0 : CTS input is the CTS_B pin.                                    */
#define LPUART_MIR_TXCSRCSEL_1                1U      /* 1 : CTS input is the inverted Receiver Match result.               */


/* =============================================  LPUART MIR TXNPCFG [16..17]  ============================================== */
                                  /* LPUART_MIR_TXNPCFG                                                */
#define LPUART_MIR_TXNPCFG_00                 0U      /* 00 : 1/OSR.                                                        */
#define LPUART_MIR_TXNPCFG_01                 1U      /* 01 : 2/OSR.                                                        */
#define LPUART_MIR_TXNPCFG_10                 2U      /* 10 : 3/OSR.                                                        */
#define LPUART_MIR_TXNPCFG_11                 3U      /* 11 : 4/OSR.                                                        */


/* =============================================  LPUART MIR IRMODEEN [18..18]  ============================================= */
                                   /* LPUART_MIR_IRMODEEN                                               */
#define LPUART_MIR_IRMODEEN_0                 0U      /* 0 : IR disabled.                                                   */
#define LPUART_MIR_IRMODEEN_1                 1U      /* 1 : IR enabled.                                                    */


/* =========================================================  FIFO  ========================================================== */
/* =============================================  LPUART FIFO RXFBDCFG [0..2]  ============================================== */
                                  /* LPUART_FIFO_RXFBDCFG                                              */
#define LPUART_FIFO_RXFBDCFG_000              0U      /* 000 : Receive FIFO/Buffer depth = 1 dataword.                      */
#define LPUART_FIFO_RXFBDCFG_001              1U      /* 001 : Receive FIFO/Buffer depth = 4 datawords.                     */
#define LPUART_FIFO_RXFBDCFG_010              2U      /* 010 : Receive FIFO/Buffer depth = 8 datawords.                     */
#define LPUART_FIFO_RXFBDCFG_011              3U      /* 011 : Receive FIFO/Buffer depth = 16 datawords.                    */
#define LPUART_FIFO_RXFBDCFG_100              4U      /* 100 : Receive FIFO/Buffer depth = 32 datawords.                    */
#define LPUART_FIFO_RXFBDCFG_101              5U      /* 101 : Receive FIFO/Buffer depth = 64 datawords.                    */
#define LPUART_FIFO_RXFBDCFG_110              6U      /* 110 : Receive FIFO/Buffer depth = 128 datawords.                   */
#define LPUART_FIFO_RXFBDCFG_111              7U      /* 111 : Receive FIFO/Buffer depth = 256 datawords.                   */


/* ==============================================  LPUART FIFO RXBFEN [3..3]  =============================================== */
                                  /* LPUART_FIFO_RXBFEN                                                */
#define LPUART_FIFO_RXBFEN_0                  0U      /* 0 : Receive FIFO is not enabled. Buffer is depth 1. (Legacy
                                                     support)                                                           */
#define LPUART_FIFO_RXBFEN_1                  1U     /* 1 : Receive FIFO is enabled. Buffer is depth indicted by RXFIFOSIZE.*/


/* =============================================  LPUART FIFO TXFBDCFG [4..6]  ============================================== */
                                  /* LPUART_FIFO_TXFBDCFG                                              */
#define LPUART_FIFO_TXFBDCFG_000              0U      /* 000 : Transmit FIFO/Buffer depth = 1 dataword.                     */
#define LPUART_FIFO_TXFBDCFG_001              1U      /* 001 : Transmit FIFO/Buffer depth = 4 datawords.                    */
#define LPUART_FIFO_TXFBDCFG_010              2U      /* 010 : Transmit FIFO/Buffer depth = 8 datawords.                    */
#define LPUART_FIFO_TXFBDCFG_011              3U      /* 011 : Transmit FIFO/Buffer depth = 16 datawords.                   */
#define LPUART_FIFO_TXFBDCFG_100              4U      /* 100 : Transmit FIFO/Buffer depth = 32 datawords.                   */
#define LPUART_FIFO_TXFBDCFG_101              5U      /* 101 : Transmit FIFO/Buffer depth = 64 datawords.                   */
#define LPUART_FIFO_TXFBDCFG_110              6U      /* 110 : Transmit FIFO/Buffer depth = 128 datawords.                  */
#define LPUART_FIFO_TXFBDCFG_111              7U      /* 111 : Transmit FIFO/Buffer depth = 256 datawords                   */


/* ==============================================  LPUART FIFO TXBFEN [7..7]  =============================================== */
                               /* LPUART_FIFO_TXBFEN                                         */
#define LPUART_FIFO_TXBFEN_0                  0U      /* 0 : Transmit FIFO is not enabled. Buffer is depth 1. (Legacy
                                                     support).                                                   */
#define LPUART_FIFO_TXBFEN_1                  1U   /* 1 : Transmit FIFO is enabled. Buffer is depth indicated by TXFIFOSIZE.*/


/* =============================================  LPUART FIFO RXUFGINT [8..8]  ============================================== */
                                 /* LPUART_FIFO_RXUFGINT                                       */
#define LPUART_FIFO_RXUFGINT_0                0U      /* 0 : RXUF flag does not generate an interrupt to the host.   */
#define LPUART_FIFO_RXUFGINT_1                1U      /* 1 : RXUF flag generates an interrupt to the host.           */


/* =============================================  LPUART FIFO TXOFGINT [9..9]  ============================================== */
                                  /* LPUART_FIFO_TXOFGINT                                       */
#define LPUART_FIFO_TXOFGINT_0                0U      /* 0 : TXOF flag does not generate an interrupt to the host.   */
#define LPUART_FIFO_TXOFGINT_1                1U      /* 1 : TXOF flag generates an interrupt to the host.           */


