MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ============================================  LPUART FIFO CFGRXIEEN [10..12]  ============================================ */
                                  /* LPUART_FIFO_CFGRXIEEN                                      */
#define LPUART_FIFO_CFGRXIEEN_000             0U      /* 000 : Disable RDRF assertion due to partially filled FIFO when
                                                     receiver is idle.                                           */
#define LPUART_FIFO_CFGRXIEEN_001             1U      /* 001 : Enable RDRF assertion due to partially filled FIFO when
                                                     receiver is idle for 1 character.                           */
#define LPUART_FIFO_CFGRXIEEN_010             2U      /* 010 : Enable RDRF assertion due to partially filled FIFO when
                                                     receiver is idle for 2 characters.                          */
#define LPUART_FIFO_CFGRXIEEN_011             3U      /* 011 : Enable RDRF assertion due to partially filled FIFO when
                                                     receiver is idle for 4 characters.                          */
#define LPUART_FIFO_CFGRXIEEN_100             4U      /* 100 : Enable RDRF assertion due to partially filled FIFO when
                                                     receiver is idle for 8 characters.                          */
#define LPUART_FIFO_CFGRXIEEN_101             5U      /* 101 : Enable RDRF assertion due to partially filled FIFO when
                                                     receiver is idle for 16 characters.                         */
#define LPUART_FIFO_CFGRXIEEN_110             6U      /* 110 : Enable RDRF assertion due to partially filled FIFO when
                                                     receiver is idle for 32 characters.                         */
#define LPUART_FIFO_CFGRXIEEN_111             7U      /* 111 : Enable RDRF assertion due to partially filled FIFO when
                                                     receiver is idle for 64 characters.                         */


/* ============================================  LPUART FIFO RXFBDFLU [14..14]  ============================================= */
                                   /* LPUART_FIFO_RXFBDFLU                                       */
#define LPUART_FIFO_RXFBDFLU_0                0U      /* 0 : No flush operation occurs.                              */
#define LPUART_FIFO_RXFBDFLU_1                1U      /* 1 : All data in the receive FIFO/buffer is cleared out.     */


/* ============================================  LPUART FIFO TXFBDFLU [15..15]  ============================================= */
                                  /* LPUART_FIFO_TXFBDFLU                                       */
#define LPUART_FIFO_TXFBDFLU_0                0U      /* 0 : No flush operation occurs.                              */
#define LPUART_FIFO_TXFBDFLU_1                1U      /* 1 : All data in the transmit FIFO/Buffer is cleared out.    */


/* =============================================  LPUART FIFO RXBUFLG [16..16]  ============================================= */
                                   /* LPUART_FIFO_RXBUFLG                                               */
#define LPUART_FIFO_RXBUFLG_0                 0U      /* 0 : No receive buffer underflow has occurred since the last
                                                     time the flag was cleared.                                         */
#define LPUART_FIFO_RXBUFLG_1                 1U      /* 1 : At least one receive buffer underflow has occurred since
                                                     the last time the flag was cleared.                                */


/* =============================================  LPUART FIFO TXBOFLG [17..17]  ============================================= */
                                  /* LPUART_FIFO_TXBOFLG                                               */
#define LPUART_FIFO_TXBOFLG_0                 0U      /* 0 : No transmit buffer overflow has occurred since the last
                                                     time the flag was cleared.                                         */
#define LPUART_FIFO_TXBOFLG_1                 1U      /* 1 : At least one transmit buffer overflow has occurred since
                                                     the last time the flag was cleared.                                */

/* ==============================================  LPUART FIFO RXBE [22..22]  =============================================== */
                                 /* LPUART_FIFO_RXBE                                                  */
#define LPUART_FIFO_RXBE_0                    0U      /* 0 : Receive buffer is not empty.                                   */
#define LPUART_FIFO_RXBE_1                    1U      /* 1 : Receive buffer is empty.                                       */


/* ==============================================  LPUART FIFO TXBE [23..23]  =============================================== */
                                  /* LPUART_FIFO_TXBE                                                  */
#define LPUART_FIFO_TXBE_0                    0U      /* 0 : Transmit buffer is not empty.                                  */
#define LPUART_FIFO_TXBE_1                    1U      /* 1 : Transmit buffer is empty.                                      */


/* =========================================================  WMKR  ========================================================== */


/* =========================================================================================================================== */
/* ================                                           COMP                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL0  ========================================================= */
/* ===============================================  COMP CTRL0 HBHLSEL [0..1]  =============================================== */
                                   /* COMP_CTRL0_HBHLSEL                                                 */
#define COMP_CTRL0_HBHLSEL_00                  0U      /* 00 : The hard block output has level 0 hysteresis internally.      */
#define COMP_CTRL0_HBHLSEL_01                  1U      /* 01 : The hard block output has level 1 hysteresis internally.      */
#define COMP_CTRL0_HBHLSEL_10                  2U      /* 10 : The hard block output has level 2 hysteresis internally.      */
#define COMP_CTRL0_HBHLSEL_11                  3U      /* 11 : The hard block output has level 3 hysteresis internally.      */


/* ===============================================  COMP CTRL0 HBOLSEL [2..2]  =============================================== */
                                  /* COMP_CTRL0_HBOLSEL                                                 */
#define COMP_CTRL0_HBOLSEL_0                   0U      /* 0 : The comparator hard block output has level 0 offset internally.*/
#define COMP_CTRL0_HBOLSEL_1                   1U      /* 1 : The comparator hard block output has level 1 offset internally.*/


/* ==============================================  COMP CTRL0 FOSMPCNT [4..6]  =============================================== */
                               /* COMP_CTRL0_FOSMPCNT                                                */
#define COMP_CTRL0_FOSMPCNT_000                0U      /* 000 : Filter is disabled. If SE = 1  then COUT is a logic zero
                                                     (this is not a legal state  and is not recommended). If
                                                     SE = 0  COUT = COUTA.                                              */
#define COMP_CTRL0_FOSMPCNT_001                1U      /* 001 : 1 consecutive sample must agree (comparator output is
                                                     simply sampled).                                                   */
#define COMP_CTRL0_FOSMPCNT_010                2U      /* 010 : 2 consecutive samples must agree.                            */
#define COMP_CTRL0_FOSMPCNT_011                3U      /* 011 : 3 consecutive samples must agree.                            */
#define COMP_CTRL0_FOSMPCNT_100                4U      /* 100 : 4 consecutive samples must agree.                            */
#define COMP_CTRL0_FOSMPCNT_101                5U      /* 101 : 5 consecutive samples must agree.                            */
#define COMP_CTRL0_FOSMPCNT_110                6U      /* 110 : 6 consecutive samples must agree.                            */
#define COMP_CTRL0_FOSMPCNT_111                7U      /* 111 : 7 consecutive samples must agree.                            */


/* ================================================  COMP CTRL0 ACEN [8..8]  ================================================= */
                                  /* COMP_CTRL0_ACEN                                                    */
#define COMP_CTRL0_ACEN_0                      0U      /* 0 : Analog Comparator is disabled.                                 */
#define COMP_CTRL0_ACEN_1                      1U      /* 1 : Analog Comparator is enabled.                                  */


/* ===============================================  COMP CTRL0 COPCFG [9..9]  ================================================ */
                               /* COMP_CTRL0_COPCFG                                                  */
#define COMP_CTRL0_COPCFG_0                    0U      /* 0 : When OPE is 0  the comparator output (after window/filter
                                                     settings dependent on software configuration) is not available
                                                     to a packaged pin.                                                 */
#define COMP_CTRL0_COPCFG_1                    1U      /* 1 : When OPE is 1  and if the software has configured the comparator
                                                     to own a packaged pin  the comparator is available in a
                                                     packaged pin.                                                      */


