MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ===============================================  COMP CTRL0 COCFG [10..10]  =============================================== */
                                 /* COMP_CTRL0_COCFG                                                   */
#define COMP_CTRL0_COCFG_0                     0U      /* 0 : Set CMPO to equal COUT (filtered comparator output).           */
#define COMP_CTRL0_COCFG_1                     1U      /* 1 : Set CMPO to equal COUTA (unfiltered comparator output).        */


/* ===============================================  COMP CTRL0 INVEN [11..11]  =============================================== */
                                 /* COMP_CTRL0_INVEN                                                   */
#define COMP_CTRL0_INVEN_0                     0U      /* 0 : Does not invert the comparator output.                         */
#define COMP_CTRL0_INVEN_1                     1U      /* 1 : Inverts the comparator output.                                 */


/* ===============================================  COMP CTRL0 PMSEL [12..12]  =============================================== */
                                 /* COMP_CTRL0_PMSEL                                                   */
#define COMP_CTRL0_PMSEL_0                     0U      /* 0 : Low Speed (LS) comparison mode is selected.                    */
#define COMP_CTRL0_PMSEL_1                     1U      /* 1 : High Speed (HS) comparison mode is selected  in VLPx mode
                                                     or Stop mode switched to Low Speed (LS) mode.                      */


/* ==============================================  COMP CTRL0 WINMEN [14..14]  =============================================== */
                                /* COMP_CTRL0_WINMEN                                                  */
#define COMP_CTRL0_WINMEN_0                    0U      /* 0 : Windowing mode is not selected.                                */
#define COMP_CTRL0_WINMEN_1                    1U      /* 1 : Windowing mode is selected.                                    */


/* ==============================================  COMP CTRL0 SMPMEN [15..15]  =============================================== */
                                  /* COMP_CTRL0_SMPMEN                                                  */
#define COMP_CTRL0_SMPMEN_0                    0U      /* 0 : Sampling mode is not selected.                                 */
#define COMP_CTRL0_SMPMEN_1                    1U      /* 1 : Sampling mode is selected.                                     */


/* ==============================================  COMP CTRL0 ACFFLG [25..25]  =============================================== */
                                 /* COMP_CTRL0_ACFFLG                                                  */
#define COMP_CTRL0_ACFFLG_0                    0U      /* 0 : A falling edge has not been detected on COUT.                  */
#define COMP_CTRL0_ACFFLG_1                    1U      /* 1 : A falling edge on COUT has occurred.                           */


/* ==============================================  COMP CTRL0 ACRFLG [26..26]  =============================================== */
                                  /* COMP_CTRL0_ACRFLG                                                  */
#define COMP_CTRL0_ACRFLG_0                    0U      /* 0 : A rising edge has not been detected on COUT.                   */
#define COMP_CTRL0_ACRFLG_1                    1U      /* 1 : A rising edge on COUT has occurred.                            */


/* ==============================================  COMP CTRL0 ACFIEN [27..27]  =============================================== */
                                   /* COMP_CTRL0_ACFIEN                                                  */
#define COMP_CTRL0_ACFIEN_0                    0U      /* 0 : Interrupt is disabled.                                         */
#define COMP_CTRL0_ACFIEN_1                    1U      /* 1 : Interrupt is enabled.                                          */


/* ==============================================  COMP CTRL0 ACRIEN [28..28]  =============================================== */
                                  /* COMP_CTRL0_ACRIEN                                                  */
#define COMP_CTRL0_ACRIEN_0                    0U      /* 0 : Interrupt is disabled.                                         */
#define COMP_CTRL0_ACRIEN_1                    1U      /* 1 : Interrupt is enabled.                                          */


/* ===============================================  COMP CTRL0 DMAEN [30..30]  =============================================== */
                                /* COMP_CTRL0_DMAEN                                                   */
#define COMP_CTRL0_DMAEN_0                     0U      /* 0 : DMA is disabled.                                               */
#define COMP_CTRL0_DMAEN_1                     1U      /* 1 : DMA is enabled.                                                */


/* =========================================================  CTRL1  ========================================================= */
/* =============================================  COMP CTRL1 MUXMICSEL [8..10]  ============================================== */
                                   /* COMP_CTRL1_MUXMICSEL                                               */
#define COMP_CTRL1_MUXMICSEL_000               0U      /* 000 : IN0                                                          */
#define COMP_CTRL1_MUXMICSEL_001               1U      /* 001 : IN1                                                          */
#define COMP_CTRL1_MUXMICSEL_010               2U      /* 010 : IN2                                                          */
#define COMP_CTRL1_MUXMICSEL_011               3U      /* 011 : IN3                                                          */
#define COMP_CTRL1_MUXMICSEL_100               4U      /* 100 : IN4                                                          */
#define COMP_CTRL1_MUXMICSEL_101               5U      /* 101 : IN5                                                          */
#define COMP_CTRL1_MUXMICSEL_110               6U      /* 110 : IN6                                                          */
#define COMP_CTRL1_MUXMICSEL_111               7U      /* 111 : IN7                                                          */


/* =============================================  COMP CTRL1 MUXPICSEL [11..13]  ============================================= */
                                   /* COMP_CTRL1_MUXPICSEL                                               */
#define COMP_CTRL1_MUXPICSEL_000               0U      /* 000 : IN0                                                          */
#define COMP_CTRL1_MUXPICSEL_001               1U      /* 001 : IN1                                                          */
#define COMP_CTRL1_MUXPICSEL_010               2U      /* 010 : IN2                                                          */
#define COMP_CTRL1_MUXPICSEL_011               3U      /* 011 : IN3                                                          */
#define COMP_CTRL1_MUXPICSEL_100               4U      /* 100 : IN4                                                          */
#define COMP_CTRL1_MUXPICSEL_101               5U      /* 101 : IN5                                                          */
#define COMP_CTRL1_MUXPICSEL_110               6U      /* 110 : IN6                                                          */
#define COMP_CTRL1_MUXPICSEL_111               7U      /* 111 : IN7                                                          */


/* ==============================================  COMP CTRL1 SVRSSEL [14..14]  ============================================== */
                                  /* COMP_CTRL1_SVRSSEL                                                 */
#define COMP_CTRL1_SVRSSEL_0                   0U      /* 0 : Vin1 is selected as resistor ladder network supply reference
                                                     Vin.                                                               */
#define COMP_CTRL1_SVRSSEL_1                   1U      /* 1 : Vin2 is selected as resistor ladder network supply reference
                                                     Vin.                                                               */


/* ===============================================  COMP CTRL1 DACEN [15..15]  =============================================== */
                                  /* COMP_CTRL1_DACEN                                                   */
#define COMP_CTRL1_DACEN_0                     0U      /* 0 : DAC is disabled.                                               */
#define COMP_CTRL1_DACEN_1                     1U      /* 1 : DAC is enabled.                                                */


