MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* =======================================================  LVDCSTS1  ======================================================== */
/* ============================================  PMU LVDCSTS1 LVDEGSYSREN [4..4]  ============================================ */
                                  /* PMU_LVDCSTS1_LVDEGSYSREN                                           */
#define PMU_LVDCSTS1_LVDEGSYSREN_0             0U      /* 0 : Hardware interrupt disabled (use polling)                      */
#define PMU_LVDCSTS1_LVDEGSYSREN_1             1U      /* 1 : Request a hardware interrupt when LVWF=1                       */


/* ==============================================  PMU LVDCSTS1 LVWEFLG [7..7]  ============================================== */
                                  /* PMU_LVDCSTS1_LVWEFLG                                               */
#define PMU_LVDCSTS1_LVWEFLG_0                 0U      /* 0 : Low-voltage warning event not detected                         */
#define PMU_LVDCSTS1_LVWEFLG_1                 1U      /* 1 : Low-voltage warning event detected                             */


/* =======================================================  LVDCSTS2  ======================================================== */
/* ============================================  PMU LVDCSTS2 LVWHWINTREN [5..5]  ============================================ */
                                  /* PMU_LVDCSTS2_LVWHWINTREN                                           */
#define PMU_LVDCSTS2_LVWHWINTREN_0             0U      /* 0 : Hardware interrupt disabled (use polling)                      */
#define PMU_LVDCSTS2_LVWHWINTREN_1             1U      /* 1 : Request a hardware interrupt when LVWF=1                       */


/* ==============================================  PMU LVDCSTS2 LVWEFLG [7..7]  ============================================== */
                                  /* PMU_LVDCSTS2_LVWEFLG                                               */
#define PMU_LVDCSTS2_LVWEFLG_0                 0U      /* 0 : Low-voltage warning event not detected                         */
#define PMU_LVDCSTS2_LVWEFLG_1                 1U      /* 1 : Low-voltage warning event detected                             */


/* ========================================================  REGCSTS  ======================================================== */
/* ================================================  PMU REGCSTS BEN [0..0]  ================================================= */
                                  /* PMU_REGCSTS_BEN                                                    */
#define PMU_REGCSTS_BEN_0                      0U      /* 0 : Biasing disabled  core logic can run in full performance       */
#define PMU_REGCSTS_BEN_1                      1U      /* 1 : Biasing enabled  core logic is slower and there are restrictions
                                                     in allowed system clock speed (see Data Sheet for details)         */


/* ==============================================  PMU REGCSTS CLKBDIS [1..1]  =============================================== */
                                  /* PMU_REGCSTS_CLKBDIS                                                */
#define PMU_REGCSTS_CLKBDIS_0                  0U      /* 0 : No effect                                                      */
#define PMU_REGCSTS_CLKBDIS_1                  1U      /* 1 : In VLPS mode  the bias currents and reference voltages for
                                                     the following clock modules are disabled: LSI  HSI  PLL.
                                                     (if available on device)                                           */


/* ==============================================  PMU REGCSTS RFPMSTS [2..2]  =============================================== */
                                 /* PMU_REGCSTS_RFPMSTS                                                */
#define PMU_REGCSTS_RFPMSTS_0                  0U      /* 0 : Regulator is in low power mode or transition to/from           */
#define PMU_REGCSTS_RFPMSTS_1                  1U      /* 1 : Regulator is in full performance mode                          */


/* =============================================  PMU REGCSTS LPOCLKSTS [6..6]  ============================================== */
                                 /* PMU_REGCSTS_LPOCLKSTS                                              */
#define PMU_REGCSTS_LPOCLKSTS_0                0U      /* 0 : Low power oscillator in low phase                              */
#define PMU_REGCSTS_LPOCLKSTS_1                1U      /* 1 : Low power oscillator in high phase                             */


/* ===============================================  PMU REGCSTS LPODIS [7..7]  =============================================== */
                                 /* PMU_REGCSTS_LPODIS                                                 */
#define PMU_REGCSTS_LPODIS_0                   0U      /* 0 : Low power oscillator enabled                                   */
#define PMU_REGCSTS_LPODIS_1                   1U      /* 1 : Low power oscillator disabled                                  */


/* =======================================================  LPOSCTRIM  ======================================================= */


/* =========================================================================================================================== */
/* ================                                           SYSMC                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  VERID  ========================================================= */
/* ==============================================  SYSMC VERID FEATURE [0..15]  ============================================== */
                               /* SYSMC_VERID_FEATURE                                                */
#define SYSMC_VERID_FEATURE_0                  0U      /* 0 : Standard features implemented                                  */


