MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ==============================================  RMU PARA CLOCKRSTSTS [9..9]  ============================================== */
                                 /* RMU_PARA_CLOCKRSTSTS                                               */
#define RMU_PARA_CLOCKRSTSTS_0                 0U      /* 0 : The feature is not available.                                  */
#define RMU_PARA_CLOCKRSTSTS_1                 1U      /* 1 : The feature is available.                                      */


/* ==============================================  RMU PARA SWRSTSTS [10..10]  =============================================== */
                                  /* RMU_PARA_SWRSTSTS                                                  */
#define RMU_PARA_SWRSTSTS_0                    0U      /* 0 : The feature is not available.                                  */
#define RMU_PARA_SWRSTSTS_1                    1U      /* 1 : The feature is available.                                      */


/* ===============================================  RMU PARA SRSTSTS [11..11]  =============================================== */
                                 /* RMU_PARA_SRSTSTS                                                   */
#define RMU_PARA_SRSTSTS_0                     0U      /* 0 : The feature is not available.                                  */
#define RMU_PARA_SRSTSTS_1                     1U      /* 1 : The feature is available.                                      */


/* ===========================================  RMU PARA STOPACKERSTSTS [13..13]  ============================================ */
                                /* RMU_PARA_STOPACKERSTSTS                                            */
#define RMU_PARA_STOPACKERSTSTS_0              0U      /* 0 : The feature is not available.                                  */
#define RMU_PARA_STOPACKERSTSTS_1              1U      /* 1 : The feature is available.                                      */


/* ========================================================  RSTFLG  ========================================================= */
/* ===============================================  RMU RSTFLG LVDRSTFLG [1..1]  ================================================ */
                                 /* RMU_RSTFLG_LVDRSTFLG                                                  */
#define RMU_RSTFLG_LVDRSTFLG_0                    0U      /* 0 : Reset not caused by LVD trip  HVD trip or POR                  */
#define RMU_RSTFLG_LVDRSTFLG_1                    1U      /* 1 : Reset caused by LVD trip  HVD trip or POR                      */


/* ===============================================  RMU RSTFLG CLKLRSTFLG [2..2]  =============================================== */
                                 /* RMU_RSTFLG_CLKLRSTFLG                                                 */
#define RMU_RSTFLG_CLKLRSTFLG_0                   0U      /* 0 : Reset not caused by a loss of external clock.                  */
#define RMU_RSTFLG_CLKLRSTFLG_1                   1U      /* 1 : Reset caused by a loss of external clock.                      */


/* ==============================================  RMU RSTFLG LOCKLRSTFLG [3..3]  =============================================== */
                                   /* RMU_RSTFLG_LOCKLRSTFLG                                                */
#define RMU_RSTFLG_LOCKLRSTFLG_0                  0U      /* 0 : Reset not caused by a loss of lock in the PLL/FLL              */
#define RMU_RSTFLG_LOCKLRSTFLG_1                  1U      /* 1 : Reset caused by a loss of lock in the PLL/FLL                  */

/* ===============================================  RMU RSTFLG WDTTOFFLG [5..5]  ================================================ */
                                 /* RMU_RSTFLG_WDTTOFFLG                                                  */
#define RMU_RSTFLG_WDTTOFFLG_0                    0U      /* 0 : Reset not caused by external reset pin                         */
#define RMU_RSTFLG_WDTTOFFLG_1                    1U      /* 1 : Reset caused by external reset pin                             */


/* ================================================  RMU RSTFLG ERSTPFLG [6..6]  ================================================ */
                                   /* RMU_RSTFLG_ERSTPFLG                                                   */
#define RMU_RSTFLG_ERSTPFLG_0                     0U      /* 0 : Reset not caused by POR                                        */
#define RMU_RSTFLG_ERSTPFLG_1                     1U      /* 1 : Reset caused by POR                                            */


/* =================================================  RMU RSTFLG PORFLG [7..7]  ================================================= */
                                   /* RMU_RSTFLG_PORFLG                                                     */
#define RMU_RSTFLG_PORFLG_0                       0U      /* 0 : Reset not caused by JTAG                                       */
#define RMU_RSTFLG_PORFLG_1                       1U      /* 1 : Reset caused by JTAG                                           */


/* ===============================================  RMU RSTFLG JTAGRSTFLG [8..8]  =============================================== */
                                   /* RMU_RSTFLG_JTAGRSTFLG                                                 */
#define RMU_RSTFLG_JTAGRSTFLG_0                   0U      /* 0 : Reset not caused by core LOCKUP event                          */
#define RMU_RSTFLG_JTAGRSTFLG_1                   1U      /* 1 : Reset caused by core LOCKUP event                              */


/* ==============================================  RMU RSTFLG CLOCKEFLG [9..9]  =============================================== */
                                 /* RMU_RSTFLG_CLOCKEFLG                                                 */
#define RMU_RSTFLG_CLOCKEFLG_0                    0U      /* 0 : Reset not caused by software setting of SYSRESETREQ bit        */
#define RMU_RSTFLG_CLOCKEFLG_1                    1U      /* 1 : Reset caused by software setting of SYSRESETREQ bit            */


