MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ===============================================  RMU RSTFLG SWSETFLG [10..10]  =============================================== */
                                 /* RMU_RSTFLG_SWSETFLG                                                   */
#define RMU_RSTFLG_SWSETFLG_0                     0U      /* 0 : Reset was not caused by host debugger system setting of
                                                     the System Reset Request bit                                       */
#define RMU_RSTFLG_SWSETFLG_1                     1U      /* 1 : Reset was caused by host debugger system setting of the
                                                     System Reset Request bit                                           */

/* ==============================================  RMU RSTFLG SRSTREQFLG [11..11]  ============================================== */
                                  /* RMU_RSTFLG_SRSTREQFLG                                                        */
 #define RMU_RSTFLG_SRSTREQFLG_0                  0U     /* 0 : Reset was not caused by host debugger system setting of
                                                     the System Reset Request bit                                              */
#define  RMU_RSTFLG_SRSTREQFLG_1                  1U     /* 1 : Reset was caused by host debugger system setting of the
                                                     System Reset Request bit                                                  */

/* ==============================================  RMU RSTFLG SRSTREQFLG [13..13]  ============================================== */
                                 /* RMU_RSTFLG_SRSTREQFLG                                                 */
#define RMU_RSTFLG_SRSTREQFLG_0                   0U      /* 0 : Reset not caused by peripheral failure to acknowledge attempt
                                                     to enter stop mode                                                 */
#define RMU_RSTFLG_SRSTREQFLG_1                   1U      /* 1 : Reset caused by peripheral failure to acknowledge attempt
                                                     to enter stop mode                                                 */


/* =======================================================  RSTPCTRL  ======================================================== */
/* =============================================  RMU RSTPCTRL RSTPFSEL [0..1]  ============================================== */
                                  /* RMU_RSTPCTRL_RSTPFSEL                                              */
#define RMU_RSTPCTRL_RSTPFSEL_00               0U      /* 00 : All filtering disabled                                        */
#define RMU_RSTPCTRL_RSTPFSEL_01               1U      /* 01 : Bus clock filter enabled for normal operation                 */
#define RMU_RSTPCTRL_RSTPFSEL_10               2U      /* 10 : LPO clock filter enabled for normal operation                 */


/* ==============================================  RMU RSTPCTRL RSTPFEN [2..2]  ============================================== */
                                   /* RMU_RSTPCTRL_RSTPFEN                                               */
#define RMU_RSTPCTRL_RSTPFEN_0                 0U      /* 0 : All filtering disabled                                         */
#define RMU_RSTPCTRL_RSTPFEN_1                 1U      /* 1 : LPO clock filter enabled                                       */


/* ========================================================  SRSTFLG  ======================================================== */
/* =============================================  RMU SRSTFLG LVDRSTRCD [1..1]  ============================================== */
                                  /* RMU_SRSTFLG_LVDRSTRCD                                              */
#define RMU_SRSTFLG_LVDRSTRCD_0                0U      /* 0 : Reset not caused by LVD trip or POR                            */
#define RMU_SRSTFLG_LVDRSTRCD_1                1U      /* 1 : Reset caused by LVD trip or POR                                */


/* ============================================  RMU SRSTFLG ECLKLRSTRCD [2..2]  ============================================= */
                                  /* RMU_SRSTFLG_ECLKLRSTRCD                                            */
#define RMU_SRSTFLG_ECLKLRSTRCD_0              0U      /* 0 : Reset not caused by a loss of external clock.                  */
#define RMU_SRSTFLG_ECLKLRSTRCD_1              1U      /* 1 : Reset caused by a loss of external clock.                      */


/* ============================================  RMU SRSTFLG LOCKLRSTRCD [3..3]  ============================================= */
                                  /* RMU_SRSTFLG_LOCKLRSTRCD                                            */
#define RMU_SRSTFLG_LOCKLRSTRCD_0              0U      /* 0 : Reset not caused by a loss of lock in the PLL/FLL              */
#define RMU_SRSTFLG_LOCKLRSTRCD_1              1U      /* 1 : Reset caused by a loss of lock in the PLL/FLL                  */


/* =============================================  RMU SRSTFLG WDTRSTRCD [5..5]  ============================================== */
                                  /* RMU_SRSTFLG_WDTRSTRCD                                              */
#define RMU_SRSTFLG_WDTRSTRCD_0                0U      /* 0 : Reset not caused by watchdog timeout                           */
#define RMU_SRSTFLG_WDTRSTRCD_1                1U      /* 1 : Reset caused by watchdog timeout                               */


/* ==============================================  RMU SRSTFLG EPRSTRCD [6..6]  ============================================== */
                                   /* RMU_SRSTFLG_EPRSTRCD                                               */
#define RMU_SRSTFLG_EPRSTRCD_0                 0U      /* 0 : Reset not caused by external reset pin                         */
#define RMU_SRSTFLG_EPRSTRCD_1                 1U      /* 1 : Reset caused by external reset pin                             */


