MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ============================================  APM32_SCB ICSR PENDSVCLR [27..27]  ============================================ */
                                   /* APM32_SCB_ICSR_PENDSVCLR                                             */
#define APM32_SCB_ICSR_PENDSVCLR_0               0U      /* 0 : no effect                                                      */
#define APM32_SCB_ICSR_PENDSVCLR_1               1U      /* 1 : removes the pending state from the PendSV exception            */


/* ============================================  APM32_SCB ICSR PENDSVSET [28..28]  ============================================ */
                                   /* APM32_SCB_ICSR_PENDSVSET                                             */
#define APM32_SCB_ICSR_PENDSVSET_0               0U      /* 0 : write: no effect; read: PendSV exception is not pending        */
#define APM32_SCB_ICSR_PENDSVSET_1               1U      /* 1 : write: changes PendSV exception state to pending; read:
                                                     PendSV exception is pending                                        */


/* ===========================================  APM32_SCB ICSR NMIPENDSET [31..31]  ============================================ */
                                  /* APM32_SCB_ICSR_NMIPENDSET                                            */
#define APM32_SCB_ICSR_NMIPENDSET_0              0U      /* 0 : write: no effect; read: NMI exception is not pending           */
#define APM32_SCB_ICSR_NMIPENDSET_1              1U      /* 1 : write: changes NMI exception state to pending; read: NMI
                                                     exception is pending                                               */


/* =========================================================  VTOR  ========================================================== */
/* =========================================================  AIRCR  ========================================================= */
/* ===========================================  APM32_SCB AIRCR SYSRESETREQ [2..2]  ============================================ */
                                  /* APM32_SCB_AIRCR_SYSRESETREQ                                          */
#define APM32_SCB_AIRCR_SYSRESETREQ_0            0U      /* 0 : no system reset request                                        */
#define APM32_SCB_AIRCR_SYSRESETREQ_1            1U      /* 1 : asserts a signal to the outer system that requests a reset     */


/* ===========================================  APM32_SCB AIRCR ENDIANNESS [15..15]  =========================================== */
                                   /* APM32_SCB_AIRCR_ENDIANNESS                                           */
#define APM32_SCB_AIRCR_ENDIANNESS_0             0U      /* 0 : Little-endian                                                  */
#define APM32_SCB_AIRCR_ENDIANNESS_1             1U      /* 1 : Big-endian                                                     */


/* ==========================================================  SCR  ========================================================== */
/* ============================================  APM32_SCB SCR SLEEPONEXIT [1..1]  ============================================= */
                                  /* APM32_SCB_SCR_SLEEPONEXIT                                            */
#define APM32_SCB_SCR_SLEEPONEXIT_0              0U      /* 0 : o not sleep when returning to Thread mode                      */
#define APM32_SCB_SCR_SLEEPONEXIT_1              1U      /* 1 : enter sleep  or deep sleep  on return from an ISR              */


/* =============================================  APM32_SCB SCR SLEEPDEEP [2..2]  ============================================== */
                                   /* APM32_SCB_SCR_SLEEPDEEP                                              */
#define APM32_SCB_SCR_SLEEPDEEP_0                0U      /* 0 : sleep                                                          */
#define APM32_SCB_SCR_SLEEPDEEP_1                1U      /* 1 : deep sleep                                                     */


/* =============================================  APM32_SCB SCR SEVONPEND [4..4]  ============================================== */
                                   /* APM32_SCB_SCR_SEVONPEND                                              */
#define APM32_SCB_SCR_SEVONPEND_0                0U      /* 0 : only enabled interrupts or events can wakeup the processor
                                                     disabled interrupts are excluded                                   */
#define APM32_SCB_SCR_SEVONPEND_1                1U      /* 1 : enabled events and all interrupts  including disabled interrupts
                                                     can wakeup the processor                                           */


/* ==========================================================  CCR  ========================================================== */
/* ===========================================  APM32_SCB CCR NONBASETHRDENA [0..0]  =========================================== */
                                 /* APM32_SCB_CCR_NONBASETHRDENA                                         */
#define APM32_SCB_CCR_NONBASETHRDENA_0           0U      /* 0 : processor can enter Thread mode only when no exception is
                                                     active                                                             */
#define APM32_SCB_CCR_NONBASETHRDENA_1           1U      /* 1 : processor can enter Thread mode from any level under the
                                                     control of an EXC_RETURN value                                     */


/* ============================================  APM32_SCB CCR USERSETMPEND [1..1]  ============================================ */
                                  /* APM32_SCB_CCR_USERSETMPEND                                           */
#define APM32_SCB_CCR_USERSETMPEND_0             0U      /* 0 : disable                                                        */
#define APM32_SCB_CCR_USERSETMPEND_1             1U      /* 1 : enable                                                         */


/* ============================================  APM32_SCB CCR UNALIGN_TRP [3..3]  ============================================= */
                                   /* APM32_SCB_CCR_UNALIGN_TRP                                            */
#define APM32_SCB_CCR_UNALIGN_TRP_0              0U      /* 0 : do not trap unaligned halfword and word accesses               */
#define APM32_SCB_CCR_UNALIGN_TRP_1              1U      /* 1 : trap unaligned halfword and word accesses                      */

