MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* =============================================  APM32_SCB CCR DIV_0_TRP [4..4]  ============================================== */
                                  /* APM32_SCB_CCR_DIV_0_TRP                                              */
#define APM32_SCB_CCR_DIV_0_TRP_0                0U      /* 0 : do not trap divide by 0                                        */
#define APM32_SCB_CCR_DIV_0_TRP_1                1U      /* 1 : trap divide by 0                                               */


/* =============================================  APM32_SCB CCR BFHFNMIGN [8..8]  ============================================== */
                                  /* APM32_SCB_CCR_BFHFNMIGN                                              */
#define APM32_SCB_CCR_BFHFNMIGN_0                0U      /* 0 : data bus faults caused by load and store instructions cause
                                                     a lock-up                                                          */
#define APM32_SCB_CCR_BFHFNMIGN_1                1U      /* 1 : handlers running at priority -1 and -2 ignore data bus faults
                                                     caused by load and store instructions                              */


/* ==============================================  APM32_SCB CCR STKALIGN [9..9]  ============================================== */
                                  /* APM32_SCB_CCR_STKALIGN                                               */
#define APM32_SCB_CCR_STKALIGN_0                 0U      /* 0 : 4-byte aligned                                                 */
#define APM32_SCB_CCR_STKALIGN_1                 1U      /* 1 : 8-byte aligned                                                 */


/* =========================================================  SHPR1  ========================================================= */
/* =========================================================  SHPR2  ========================================================= */
/* =========================================================  SHPR3  ========================================================= */
/* =========================================================  SHCSR  ========================================================= */
/* ===========================================  APM32_SCB SHCSR MEMFAULTACT [0..0]  ============================================ */
                                   /* APM32_SCB_SHCSR_MEMFAULTACT                                          */
#define APM32_SCB_SHCSR_MEMFAULTACT_0            0U      /* 0 : exception is not active                                        */
#define APM32_SCB_SHCSR_MEMFAULTACT_1            1U      /* 1 : exception is active                                            */


/* ===========================================  APM32_SCB SHCSR BUSFAULTACT [1..1]  ============================================ */
                                  /* APM32_SCB_SHCSR_BUSFAULTACT                                          */
#define APM32_SCB_SHCSR_BUSFAULTACT_0            0U      /* 0 : exception is not active                                        */
#define APM32_SCB_SHCSR_BUSFAULTACT_1            1U      /* 1 : exception is active                                            */


/* ===========================================  APM32_SCB SHCSR USGFAULTACT [3..3]  ============================================ */
                                  /* APM32_SCB_SHCSR_USGFAULTACT                                          */
#define APM32_SCB_SHCSR_USGFAULTACT_0            0U      /* 0 : exception is not active                                        */
#define APM32_SCB_SHCSR_USGFAULTACT_1            1U      /* 1 : exception is active                                            */


/* ============================================  APM32_SCB SHCSR SVCALLACT [7..7]  ============================================= */
                                  /* APM32_SCB_SHCSR_SVCALLACT                                            */
#define APM32_SCB_SHCSR_SVCALLACT_0              0U      /* 0 : exception is not active                                        */
#define APM32_SCB_SHCSR_SVCALLACT_1              1U      /* 1 : exception is active                                            */


/* ============================================  APM32_SCB SHCSR MONITORACT [8..8]  ============================================ */
                                 /* APM32_SCB_SHCSR_MONITORACT                                           */
#define APM32_SCB_SHCSR_MONITORACT_0             0U      /* 0 : exception is not active                                        */
#define APM32_SCB_SHCSR_MONITORACT_1             1U      /* 1 : exception is active                                            */


/* ===========================================  APM32_SCB SHCSR PENDSVACT [10..10]  ============================================ */
                                  /* APM32_SCB_SHCSR_PENDSVACT                                            */
#define APM32_SCB_SHCSR_PENDSVACT_0              0U      /* 0 : exception is not active                                        */
#define APM32_SCB_SHCSR_PENDSVACT_1              1U      /* 1 : exception is active                                            */


/* ===========================================  APM32_SCB SHCSR SYSTICKACT [11..11]  =========================================== */
                                  /* APM32_SCB_SHCSR_SYSTICKACT                                           */
#define APM32_SCB_SHCSR_SYSTICKACT_0             0U      /* 0 : exception is not active                                        */
#define APM32_SCB_SHCSR_SYSTICKACT_1             1U      /* 1 : exception is active                                            */


/* =========================================  APM32_SCB SHCSR USGFAULTPENDED [12..12]  ========================================= */
                                  /* APM32_SCB_SHCSR_USGFAULTPENDED                                       */
#define APM32_SCB_SHCSR_USGFAULTPENDED_0         0U      /* 0 : exception is not pending                                       */
#define APM32_SCB_SHCSR_USGFAULTPENDED_1         1U      /* 1 : exception is pending                                           */


/* =========================================  APM32_SCB SHCSR MEMFAULTPENDED [13..13]  ========================================= */
                                  /* APM32_SCB_SHCSR_MEMFAULTPENDED                                       */
#define APM32_SCB_SHCSR_MEMFAULTPENDED_0         0U      /* 0 : exception is not pending                                       */
#define APM32_SCB_SHCSR_MEMFAULTPENDED_1         1U      /* 1 : exception is pending                                           */


/* =========================================  APM32_SCB SHCSR BUSFAULTPENDED [14..14]  ========================================= */
                                 /* APM32_SCB_SHCSR_BUSFAULTPENDED                                       */
#define APM32_SCB_SHCSR_BUSFAULTPENDED_0         0U      /* 0 : exception is not pending                                       */
#define APM32_SCB_SHCSR_BUSFAULTPENDED_1         1U      /* 1 : exception is pending                                           */


