MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ==============================================  APM32_SCB FPCCR MMRDY [5..5]  =============================================== */
                                /* APM32_SCB_FPCCR_MMRDY                                                       */
#define APM32_SCB_FPCCR_MMRDY_0                   0U      /* 0 : MemManage is disabled or priority did not permit setting
                                                     the MemManage handler to the pending state when the floating-point
                                                     stack frame was allocated.                                                */
#define APM32_SCB_FPCCR_MMRDY_1                   1U      /* 1 : MemManage is enabled and priority permitted setting the
                                                     MemManage handler to the pending state when the floating-point
                                                     stack frame was allocated.                                                */


/* ==============================================  APM32_SCB FPCCR BFRDY [6..6]  =============================================== */
                                  /* APM32_SCB_FPCCR_BFRDY                                                       */
#define APM32_SCB_FPCCR_BFRDY_0                   0U      /* 0 : BusFault is disabled or priority did not permit setting
                                                     the BusFault handler to the pending state when the floating-point
                                                     stack frame was allocated.                                                */
#define APM32_SCB_FPCCR_BFRDY_1                   1U      /* 1 : BusFault is disabled or priority did not permit setting
                                                     the BusFault handler to the pending state when the floating-point
                                                     stack frame was allocated.                                                */


/* ==============================================  APM32_SCB FPCCR MONRDY [8..8]  ============================================== */
                                   /* APM32_SCB_FPCCR_MONRDY                                                      */
#define APM32_SCB_FPCCR_MONRDY_0                  0U      /* 0 : DebugMonitor is disabled or priority did not permit setting
                                                     MON_PEND when the floating-point stack frame was allocated.               */
#define APM32_SCB_FPCCR_MONRDY_1                  1U      /* 1 : DebugMonitor is enabled and priority permits setting MON_PEND
                                                     when the floating-point stack frame was allocated.                        */


/* =============================================  APM32_SCB FPCCR LSPEN [30..30]  ============================================== */
                                  /* APM32_SCB_FPCCR_LSPEN                                                       */
#define APM32_SCB_FPCCR_LSPEN_0                   0U      /* 0 : Disable automatic lazy state preservation for floating-point
                                                     context.                                                                  */
#define APM32_SCB_FPCCR_LSPEN_1                   1U      /* 1 : Enable automatic lazy state preservation for floating-point
                                                     context.                                                                  */


/* =============================================  APM32_SCB FPCCR ASPEN [31..31]  ============================================== */
                                  /* APM32_SCB_FPCCR_ASPEN                                                       */
#define APM32_SCB_FPCCR_ASPEN_0                   0U      /* 0 : Disable CONTROL2 setting on execution of a floating-point
                                                     instruction.                                                              */
#define APM32_SCB_FPCCR_ASPEN_1                   1U      /* 1 : Enable CONTROL2 setting on execution of a floating-point
                                                     instruction.                                                              */


/* =========================================================  FPCAR  ========================================================= */
/* ========================================================  FPDSCR  ========================================================= */
/* =============================================  APM32_SCB FPDSCR RMode [22..23]  ============================================= */
                                 /* APM32_SCB_FPDSCR_RMode                                                      */
#define APM32_SCB_FPDSCR_RMode_00                 0U      /* 00 : Round to Nearest (RN) mode                                    */
#define APM32_SCB_FPDSCR_RMode_01                 1U      /* 01 : Round towards Plus Infinity (RP) mode.                        */
#define APM32_SCB_FPDSCR_RMode_10                 2U      /* 10 : Round towards Minus Infinity (RM) mode.                       */
#define APM32_SCB_FPDSCR_RMode_11                 3U      /* 11 : Round towards Zero (RZ) mode.                                 */


/* ==============================================  APM32_SCB FPDSCR FZ [24..24]  =============================================== */
                                  /* APM32_SCB_FPDSCR_FZ                                                  */
#define APM32_SCB_FPDSCR_FZ_0                    0U      /* 0 : Flush-to-zero mode disabled. Behavior of the floating-point
                                                     system is fully compliant with the IEEE 754 standard.              */
#define APM32_SCB_FPDSCR_FZ_1                    1U      /* 1 : Flush-to-zero mode enabled.                                    */


/* ==============================================  APM32_SCB FPDSCR DN [25..25]  =============================================== */
                                   /* APM32_SCB_FPDSCR_DN                                                  */
#define APM32_SCB_FPDSCR_DN_0                    0U      /* 0 : NaN operands propagate through to the output of a floating-point
                                                     operation.                                                         */
#define APM32_SCB_FPDSCR_DN_1                    1U      /* 1 : Any operation involving one or more NaNs returns the Default
                                                     NaN.                                                               */


/* ==============================================  APM32_SCB FPDSCR AHP [26..26]  ============================================== */
                                 /* APM32_SCB_FPDSCR_AHP                                                 */
#define APM32_SCB_FPDSCR_AHP_0                   0U      /* 0 : IEEE half-precision format selected.                           */
#define APM32_SCB_FPDSCR_AHP_1                   1U      /* 1 : Alternative half-precision format selected.                    */




/* =========================================================================================================================== */
/* ================                                        APM32_SysTick                                        ================ */
/* =========================================================================================================================== */

/* ==========================================================  CSR  ========================================================== */
/* =============================================  APM32_SysTick CSR ENABLE [0..0]  ============================================= */
                                   /* APM32_SysTick_CSR_ENABLE                                             */
#define APM32_SysTick_CSR_ENABLE_0               0U      /* 0 : counter disabled                                               */
#define APM32_SysTick_CSR_ENABLE_1               1U      /* 1 : counter enabled                                                */

/* ============================================  APM32_SysTick CSR TICKINT [1..1]  ============================================= */
                               /* APM32_SysTick_CSR_TICKINT                                            */
#define APM32_SysTick_CSR_TICKINT_0              0U      /* 0 : counting down to 0 does not assert the SysTick exception
                                                     request                                                            */
#define APM32_SysTick_CSR_TICKINT_1              1U      /* 1 : counting down to 0 asserts the SysTick exception request       */

