MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* ===============================================  MC LMDES2 VALID [31..31]  ================================================ */
                                   /* MC_LMDES2_VALID                                                    */
#define MC_LMDES2_VALID_0                      0U      /* 0 : LMEMn is not present.                                          */
#define MC_LMDES2_VALID_1                      1U      /* 1 : LMEMn is present.                                              */


/* =======================================================  LMPECTRL  ======================================================== */
/* ===============================================  MC LMPECTRL NCREN [0..0]  ================================================ */
                                   /* MC_LMPECTRL_NCREN                                                  */
#define MC_LMPECTRL_NCREN_0                  = 0U      /* 0 : Reporting disabled                                             */
#define MC_LMPECTRL_NCREN_1                  = 1U      /* 1 : Reporting enabled                                              */


/* ===============================================  MC LMPECTRL R1BREN [8..8]  =============================================== */
                                   /* MC_LMPECTRL_R1BREN                                                 */
#define MC_LMPECTRL_R1BREN_0                 = 0U      /* 0 : Reporting disabled                                             */
#define MC_LMPECTRL_R1BREN_1                 = 1U      /* 1 : Reporting enabled                                              */


/* ==============================================  MC LMPECTRL CPREN [20..20]  =============================================== */
                                  /* MC_LMPECTRL_CPREN                                                  */
#define MC_LMPECTRL_CPREN_0                    0U      /* 0 : Reporting disabled                                             */
#define MC_LMPECTRL_CPREN_1                    1U      /* 1 : Reporting enabled                                              */


/* ========================================================  LMPEINT  ======================================================== */
/* ==============================================  MC LMPEINT PEERRL [24..28]  =============================================== */
                                   /* MC_LMPEINT_PEERRL                                                  */
#define MC_LMPEINT_PEERRL_00                   0U      /* 00 : Non-correctable ECC event from SRAM_L                         */
#define MC_LMPEINT_PEERRL_01                   1U      /* 01 : Non-correctable ECC event from SRAM_U                         */


/* ========================================================  LMFADDR  ======================================================== */
/* =========================================================  LMFAT  ========================================================= */
/* ===============================================  MC LMFAT PEFMSIZE [4..6]  ================================================ */
                                /* MC_LMFAT_PEFMSIZE                                                  */
#define MC_LMFAT_PEFMSIZE_000                   0U      /* 000 : 8-bit access                                                 */
#define MC_LMFAT_PEFMSIZE_001                   1U      /* 001 : 16-bit access                                                */
#define MC_LMFAT_PEFMSIZE_010                   2U      /* 010 : 32-bit access                                                */
#define MC_LMFAT_PEFMSIZE_011                   3U      /* 011 : 64-bit access                                                */


/* =======================================================  LMFDATAH  ======================================================== */
/* =======================================================  LMFDATAL  ======================================================== */


/* =========================================================================================================================== */
/* ================                                            LMC                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  CCTRL  ========================================================= */
/* =================================================  LMC CCTRL CEN [0..0]  ================================================= */
                                 /* LMC_CCTRL_CEN                                                     */
#define LMC_CCTRL_CEN_0                        0U      /* 0 : Cache disabled                                                 */
#define LMC_CCTRL_CEN_1                        1U      /* 1 : Cache enabled                                                  */


/* ================================================  LMC CCTRL IW0 [24..24]  ================================================ */
                                  /* LMC_CCTRL_IW0                                                     */
#define LMC_CCTRL_IW0_0                        0U      /* 0 : No operation                                                   */
#define LMC_CCTRL_IW0_1                        1U      /* 1 : When setting the GO bit  invalidate all lines in way 0.        */


/* ================================================  LMC CCTRL PW0 [25..25]  ================================================ */
                                 /* LMC_CCTRL_PW0                                                     */
#define LMC_CCTRL_PW0_0                        0U      /* 0 : No operation                                                   */
#define LMC_CCTRL_PW0_1                        1U      /* 1 : When setting the GO bit  push all modified lines in way
                                                     0                                                                  */


/* ================================================  LMC CCTRL IW1 [26..26]  ================================================ */
                                  /* LMC_CCTRL_IW1                                                     */
#define LMC_CCTRL_IW1_0                        0U      /* 0 : No operation                                                   */
#define LMC_CCTRL_IW1_1                        1U      /* 1 : When setting the GO bit  invalidate all lines in way 1         */


/* ================================================  LMC CCTRL PW1 [27..27]  ================================================ */
                                  /* LMC_CCTRL_PW1                                                     */
#define LMC_CCTRL_PW1_0                        0U      /* 0 : No operation                                                   */
#define LMC_CCTRL_PW1_1                        1U      /* 1 : When setting the GO bit  push all modified lines in way
                                                     1                                                                  */


/* ===============================================  LMC CCTRL ICCMD [31..31]  =============================================== */
                                  /* LMC_CCTRL_ICCMD                                                   */
#define LMC_CCTRL_ICCMD_0                      0U      /* 0 : Write: no effect. Read: no cache command active.               */
#define LMC_CCTRL_ICCMD_1                      1U      /* 1 : Write: initiate command indicated by bits 27-24. Read: cache
                                                     command active.                                                    */


/* ========================================================  CLCTRL  ======================================================== */
/* ===============================================  LMC CLCTRL ICLCMD [0..0]  =============================================== */
                                  /* LMC_CLCTRL_ICLCMD                                                 */
#define LMC_CLCTRL_ICLCMD_0                    0U      /* 0 : Write: no effect. Read: no line command active.                */
#define LMC_CLCTRL_ICLCMD_1                    1U      /* 1 : Write: initiate line command indicated by bits 27-24. Read:
                                                     line command active.                                               */


/* =============================================  LMC CLCTRL LCMDWSEL [14..14]  ============================================= */
                                  /* LMC_CLCTRL_LCMDWSEL                                               */
#define LMC_CLCTRL_LCMDWSEL_0                  0U      /* 0 : Way 0                                                          */
#define LMC_CLCTRL_LCMDWSEL_1                  1U      /* 1 : Way 1                                                          */


/* ===========================================  LMC CLCTRL TAG_DATASEL [16..16]  ============================================ */
                                  /* LMC_CLCTRL_TAG_DATASEL                                            */
#define LMC_CLCTRL_TAG_DATASEL_0               0U      /* 0 : Data                                                           */
#define LMC_CLCTRL_TAG_DATASEL_1               1U      /* 1 : Tag                                                            */


