MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F445VE/mcu.h
/* =============================================  LMC CLCTRL LCMDCFG [24..25]  ============================================== */
                                  /* LMC_CLCTRL_LCMDCFG                                                */
#define LMC_CLCTRL_LCMDCFG_00                  0U      /* 00 : Search and read or write                                      */
#define LMC_CLCTRL_LCMDCFG_01                  1U      /* 01 : Invalidate                                                    */
#define LMC_CLCTRL_LCMDCFG_10                  2U      /* 10 : Push                                                          */
#define LMC_CLCTRL_LCMDCFG_11                  3U      /* 11 : Clear                                                         */


/* =============================================  LMC CLCTRL LADDRSEL [26..26]  ============================================= */
                                  /* LMC_CLCTRL_LADDRSEL                                               */
#define LMC_CLCTRL_LADDRSEL_0                 0U      /* 0 : Cache address                                                  */
#define LMC_CLCTRL_LADDRSEL_1                 1U      /* 1 : Physical address                                               */


/* =============================================  LMC CLCTRL LACCTSEL [27..27]  ============================================= */
                                 /* LMC_CLCTRL_LACCTSEL                                               */
#define LMC_CLCTRL_LACCTSEL_0                  0U      /* 0 : Read                                                           */
#define LMC_CLCTRL_LACCTSEL_1                  1U      /* 1 : Write                                                          */


/* ========================================================  CSADDR  ======================================================== */
/* ===============================================  LMC CSADDR CLCMDI [0..0]  =============================================== */
                                  /* LMC_CSADDR_CLCMDI                                                 */
#define LMC_CSADDR_CLCMDI_0                    0U      /* 0 : Write: no effect. Read: no line command active.                */
#define LMC_CSADDR_CLCMDI_1                    1U      /* 1 : Write: initiate line command indicated by bits CLCR[27:24].
                                                     Read: line command active.                                         */


/* =========================================================  CDATA  ========================================================= */
/* ========================================================  RCMCFG  ========================================================= */
/* ===============================================  LMC RCMCFG CMCFGR [0..1]  ================================================ */
                                  /* LMC_RCMCFG_CMCFGR                                                  */
#define LMC_RCMCFG_CMCFGR_00                    0U      /* 00 : Non-cacheable                                                 */
#define LMC_RCMCFG_CMCFGR_01                    1U      /* 01 : Non-cacheable                                                 */
#define LMC_RCMCFG_CMCFGR_10                    2U      /* 10 : Write-through                                                 */
#define LMC_RCMCFG_CMCFGR_11                    3U      /* 11 : Write-back                                                    */



/** @} */ /* End of group Macros_peripherals */


#ifdef __cplusplus
}
#endif

#endif /* APM32F445_446_H */


/** @} */ /* End of group APM32F445_446 */

/** @} */ /* End of group  */
